JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_STATUS_MASK (0x10000U)
#define BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_STATUS_SHIFT (16U)
/*! IRQ_STATUS - Async wakeup interrupt status
 *  0b0..Interrupt not asserted
 *  0b1..Interrupt asserted
 */
#define BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_STATUS(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_STATUS_SHIFT)) & BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_STATUS_MASK)

#define BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_EN_MASK (0x80000000U)
#define BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_EN_SHIFT (31U)
/*! IRQ_EN - Master mode async wakeup interrupt enable
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_EN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_EN_SHIFT)) & BLK_CTRL_WAKEUPMIX_I3C2_ASYNC_WAKEUP_CTRL_IRQ_EN_MASK)
/*! @} */

/*! @name XBAR_AOI_WE - XBAR and AOI write protect register */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_XBAR_AOI_WE_WE_MASK   (0x1U)
#define BLK_CTRL_WAKEUPMIX_XBAR_AOI_WE_WE_SHIFT  (0U)
/*! WE - Write Enable to XBAR and AOI
 *  0b0..Write is disabled
 *  0b1..Write is enabled
 */
#define BLK_CTRL_WAKEUPMIX_XBAR_AOI_WE_WE(x)     (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_AOI_WE_WE_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_AOI_WE_WE_MASK)
/*! @} */

/*! @name XBAR_TRIG_SYNC_CTRL1 - XBAR trigger synchronizer control register1 */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_POL_SEL_MASK (0xFFU)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_POL_SEL_SHIFT (0U)
/*! POL_SEL - Trigger out polarity select
 *  0b00000000..Same as trigger in
 *  0b00000001..Invert trigger in
 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_POL_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_POL_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_POL_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_ASYNC_EN_MASK (0xFF00U)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_ASYNC_EN_SHIFT (8U)
/*! ASYNC_EN - Asynchronous trigger in enable
 *  0b00000000..Trigger in is synchronous
 *  0b00000001..Trigger in is asynchronous
 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_ASYNC_EN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_ASYNC_EN_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_ASYNC_EN_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_SYNC_ENABLE_MASK (0xFF0000U)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_SYNC_ENABLE_SHIFT (16U)
/*! SYNC_ENABLE - Trigger out synchronizer enable
 *  0b00000000..Channel is disabled
 *  0b00000001..Channel is enabled
 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_SYNC_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_SYNC_ENABLE_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL1_SYNC_ENABLE_MASK)
/*! @} */

/*! @name XBAR_TRIG_SYNC_CTRL2 - XBAR trigger synchronizer control register2 */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH0_MASK (0xFU)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH0_SHIFT (0U)
/*! PULSE_WIDTH0 - Pulse width control register of channel0 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH0(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH0_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH0_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH1_MASK (0xF0U)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH1_SHIFT (4U)
/*! PULSE_WIDTH1 - Pulse width control register of channel1 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH1(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH1_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH1_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH2_MASK (0xF00U)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH2_SHIFT (8U)
/*! PULSE_WIDTH2 - Pulse width control register of channel2 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH2(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH2_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH2_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH3_MASK (0xF000U)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH3_SHIFT (12U)
/*! PULSE_WIDTH3 - Pulse width control register of channel3 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH3(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH3_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH3_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH4_MASK (0xF0000U)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH4_SHIFT (16U)
/*! PULSE_WIDTH4 - Pulse width control register of channel4 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH4(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH4_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH4_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH5_MASK (0xF00000U)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH5_SHIFT (20U)
/*! PULSE_WIDTH5 - Pulse width control register of channel5 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH5(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH5_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH5_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH6_MASK (0xF000000U)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH6_SHIFT (24U)
/*! PULSE_WIDTH6 - Pulse width control register of channel6 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH6(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH6_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH6_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH7_MASK (0xF0000000U)
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH7_SHIFT (28U)
/*! PULSE_WIDTH7 - Pulse width control register of channel7 */
#define BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH7(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH7_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_TRIG_SYNC_CTRL2_PULSE_WIDTH7_MASK)
/*! @} */

/*! @name NETC_LINK_CFG - NETC link configuration for port0..NETC link configuration for port4 */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_MII_PROT_MASK (0xFU)
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_MII_PROT_SHIFT (0U)
/*! MII_PROT - MII protocol selection
 *  0b0000..MII
 *  0b0001..RMII
 *  0b0010..RGMII
 *  0b0100-0b1111..Reserved
 */
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_MII_PROT(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_MII_PROT_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_MII_PROT_MASK)

#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_IO_VAR_MASK (0xF0000U)
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_IO_VAR_SHIFT (16U)
/*! IO_VAR - IO variant selection
 *  0b0000..None
 *  0b0001-0b1110..Reserved
 */
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_IO_VAR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_IO_VAR_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_LINK_CFG_IO_VAR_MASK)

