JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name GPR_SHARED3_AUTHEN_TOG - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED3_AUTHEN_TOG_TZ_USER_MASK  (0x100U)
#define CCM_GPR_SHARED3_AUTHEN_TOG_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED3_AUTHEN_TOG_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_AUTHEN_TOG_TZ_USER_SHIFT)) & CCM_GPR_SHARED3_AUTHEN_TOG_TZ_USER_MASK)

#define CCM_GPR_SHARED3_AUTHEN_TOG_TZ_NS_MASK    (0x200U)
#define CCM_GPR_SHARED3_AUTHEN_TOG_TZ_NS_SHIFT   (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED3_AUTHEN_TOG_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_AUTHEN_TOG_TZ_NS_SHIFT)) & CCM_GPR_SHARED3_AUTHEN_TOG_TZ_NS_MASK)

#define CCM_GPR_SHARED3_AUTHEN_TOG_LOCK_TZ_MASK  (0x800U)
#define CCM_GPR_SHARED3_AUTHEN_TOG_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED3_AUTHEN_TOG_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_AUTHEN_TOG_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED3_AUTHEN_TOG_LOCK_TZ_MASK)

#define CCM_GPR_SHARED3_AUTHEN_TOG_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED3_AUTHEN_TOG_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED3_AUTHEN_TOG_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_AUTHEN_TOG_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED3_AUTHEN_TOG_LOCK_LIST_MASK)

#define CCM_GPR_SHARED3_AUTHEN_TOG_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED3_AUTHEN_TOG_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED3_AUTHEN_TOG_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_AUTHEN_TOG_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED3_AUTHEN_TOG_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED4 - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED4_m33_mask_sinc3_MASK      (0x1U)
#define CCM_GPR_SHARED4_m33_mask_sinc3_SHIFT     (0U)
/*! m33_mask_sinc3 - m33_mask_sinc3 */
#define CCM_GPR_SHARED4_m33_mask_sinc3(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_m33_mask_sinc3_SHIFT)) & CCM_GPR_SHARED4_m33_mask_sinc3_MASK)

#define CCM_GPR_SHARED4_m33_mask_sai1_MASK       (0x2U)
#define CCM_GPR_SHARED4_m33_mask_sai1_SHIFT      (1U)
/*! m33_mask_sai1 - m33_mask_sai1 */
#define CCM_GPR_SHARED4_m33_mask_sai1(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_m33_mask_sai1_SHIFT)) & CCM_GPR_SHARED4_m33_mask_sai1_MASK)

#define CCM_GPR_SHARED4_m33_mask_sai2_MASK       (0x4U)
#define CCM_GPR_SHARED4_m33_mask_sai2_SHIFT      (2U)
/*! m33_mask_sai2 - m33_mask_sai2 */
#define CCM_GPR_SHARED4_m33_mask_sai2(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_m33_mask_sai2_SHIFT)) & CCM_GPR_SHARED4_m33_mask_sai2_MASK)

#define CCM_GPR_SHARED4_m33_mask_sai3_MASK       (0x8U)
#define CCM_GPR_SHARED4_m33_mask_sai3_SHIFT      (3U)
/*! m33_mask_sai3 - m33_mask_sai3 */
#define CCM_GPR_SHARED4_m33_mask_sai3(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_m33_mask_sai3_SHIFT)) & CCM_GPR_SHARED4_m33_mask_sai3_MASK)

#define CCM_GPR_SHARED4_m33_mask_sai4_MASK       (0x10U)
#define CCM_GPR_SHARED4_m33_mask_sai4_SHIFT      (4U)
/*! m33_mask_sai4 - m33_mask_sai4 */
#define CCM_GPR_SHARED4_m33_mask_sai4(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_m33_mask_sai4_SHIFT)) & CCM_GPR_SHARED4_m33_mask_sai4_MASK)

#define CCM_GPR_SHARED4_m33_mask_mic_MASK        (0x20U)
#define CCM_GPR_SHARED4_m33_mask_mic_SHIFT       (5U)
/*! m33_mask_mic - m33_mask_mic */
#define CCM_GPR_SHARED4_m33_mask_mic(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_m33_mask_mic_SHIFT)) & CCM_GPR_SHARED4_m33_mask_mic_MASK)
/*! @} */

/*! @name GPR_SHARED4_SET - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED4_SET_m33_mask_sinc3_MASK  (0x1U)
#define CCM_GPR_SHARED4_SET_m33_mask_sinc3_SHIFT (0U)
/*! m33_mask_sinc3 - m33_mask_sinc3 */
#define CCM_GPR_SHARED4_SET_m33_mask_sinc3(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_SET_m33_mask_sinc3_SHIFT)) & CCM_GPR_SHARED4_SET_m33_mask_sinc3_MASK)

#define CCM_GPR_SHARED4_SET_m33_mask_sai1_MASK   (0x2U)
#define CCM_GPR_SHARED4_SET_m33_mask_sai1_SHIFT  (1U)
/*! m33_mask_sai1 - m33_mask_sai1 */
#define CCM_GPR_SHARED4_SET_m33_mask_sai1(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_SET_m33_mask_sai1_SHIFT)) & CCM_GPR_SHARED4_SET_m33_mask_sai1_MASK)

#define CCM_GPR_SHARED4_SET_m33_mask_sai2_MASK   (0x4U)
#define CCM_GPR_SHARED4_SET_m33_mask_sai2_SHIFT  (2U)
/*! m33_mask_sai2 - m33_mask_sai2 */
#define CCM_GPR_SHARED4_SET_m33_mask_sai2(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_SET_m33_mask_sai2_SHIFT)) & CCM_GPR_SHARED4_SET_m33_mask_sai2_MASK)

#define CCM_GPR_SHARED4_SET_m33_mask_sai3_MASK   (0x8U)
#define CCM_GPR_SHARED4_SET_m33_mask_sai3_SHIFT  (3U)
/*! m33_mask_sai3 - m33_mask_sai3 */
#define CCM_GPR_SHARED4_SET_m33_mask_sai3(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_SET_m33_mask_sai3_SHIFT)) & CCM_GPR_SHARED4_SET_m33_mask_sai3_MASK)

#define CCM_GPR_SHARED4_SET_m33_mask_sai4_MASK   (0x10U)
#define CCM_GPR_SHARED4_SET_m33_mask_sai4_SHIFT  (4U)
/*! m33_mask_sai4 - m33_mask_sai4 */
#define CCM_GPR_SHARED4_SET_m33_mask_sai4(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_SET_m33_mask_sai4_SHIFT)) & CCM_GPR_SHARED4_SET_m33_mask_sai4_MASK)

#define CCM_GPR_SHARED4_SET_m33_mask_mic_MASK    (0x20U)
#define CCM_GPR_SHARED4_SET_m33_mask_mic_SHIFT   (5U)
/*! m33_mask_mic - m33_mask_mic */
#define CCM_GPR_SHARED4_SET_m33_mask_mic(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_SET_m33_mask_mic_SHIFT)) & CCM_GPR_SHARED4_SET_m33_mask_mic_MASK)
/*! @} */

/*! @name GPR_SHARED4_CLR - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED4_CLR_m33_mask_sinc3_MASK  (0x1U)
#define CCM_GPR_SHARED4_CLR_m33_mask_sinc3_SHIFT (0U)
/*! m33_mask_sinc3 - m33_mask_sinc3 */
#define CCM_GPR_SHARED4_CLR_m33_mask_sinc3(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_CLR_m33_mask_sinc3_SHIFT)) & CCM_GPR_SHARED4_CLR_m33_mask_sinc3_MASK)

#define CCM_GPR_SHARED4_CLR_m33_mask_sai1_MASK   (0x2U)
#define CCM_GPR_SHARED4_CLR_m33_mask_sai1_SHIFT  (1U)
/*! m33_mask_sai1 - m33_mask_sai1 */
#define CCM_GPR_SHARED4_CLR_m33_mask_sai1(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_CLR_m33_mask_sai1_SHIFT)) & CCM_GPR_SHARED4_CLR_m33_mask_sai1_MASK)

#define CCM_GPR_SHARED4_CLR_m33_mask_sai2_MASK   (0x4U)
#define CCM_GPR_SHARED4_CLR_m33_mask_sai2_SHIFT  (2U)
/*! m33_mask_sai2 - m33_mask_sai2 */
#define CCM_GPR_SHARED4_CLR_m33_mask_sai2(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_CLR_m33_mask_sai2_SHIFT)) & CCM_GPR_SHARED4_CLR_m33_mask_sai2_MASK)

#define CCM_GPR_SHARED4_CLR_m33_mask_sai3_MASK   (0x8U)
#define CCM_GPR_SHARED4_CLR_m33_mask_sai3_SHIFT  (3U)
/*! m33_mask_sai3 - m33_mask_sai3 */
#define CCM_GPR_SHARED4_CLR_m33_mask_sai3(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED4_CLR_m33_mask_sai3_SHIFT)) & CCM_GPR_SHARED4_CLR_m33_mask_sai3_MASK)

