JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define CCM_GPR_SHARED5_TOG_m7_mask_gpio6_MASK   (0x200000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_gpio6_SHIFT  (21U)
/*! m7_mask_gpio6 - m7_mask_gpio6 */
#define CCM_GPR_SHARED5_TOG_m7_mask_gpio6(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_gpio6_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_gpio6_MASK)

#define CCM_GPR_SHARED5_TOG_m7_mask_flexio1_MASK (0x400000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_flexio1_SHIFT (22U)
/*! m7_mask_flexio1 - m7_mask_flexio1 */
#define CCM_GPR_SHARED5_TOG_m7_mask_flexio1(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_flexio1_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_flexio1_MASK)

#define CCM_GPR_SHARED5_TOG_m7_mask_flexio2_MASK (0x800000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_flexio2_SHIFT (23U)
/*! m7_mask_flexio2 - m7_mask_flexio2 */
#define CCM_GPR_SHARED5_TOG_m7_mask_flexio2(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_flexio2_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_flexio2_MASK)

#define CCM_GPR_SHARED5_TOG_m7_mask_lpit1_MASK   (0x1000000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_lpit1_SHIFT  (24U)
/*! m7_mask_lpit1 - m7_mask_lpit1 */
#define CCM_GPR_SHARED5_TOG_m7_mask_lpit1(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_lpit1_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_lpit1_MASK)

#define CCM_GPR_SHARED5_TOG_m7_mask_lpit2_MASK   (0x2000000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_lpit2_SHIFT  (25U)
/*! m7_mask_lpit2 - m7_mask_lpit2 */
#define CCM_GPR_SHARED5_TOG_m7_mask_lpit2(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_lpit2_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_lpit2_MASK)

#define CCM_GPR_SHARED5_TOG_m7_mask_lpit3_MASK   (0x4000000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_lpit3_SHIFT  (26U)
/*! m7_mask_lpit3 - m7_mask_lpit3 */
#define CCM_GPR_SHARED5_TOG_m7_mask_lpit3(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_lpit3_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_lpit3_MASK)

#define CCM_GPR_SHARED5_TOG_m7_mask_tpm1_MASK    (0x8000000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_tpm1_SHIFT   (27U)
/*! m7_mask_tpm1 - m7_mask_tpm1 */
#define CCM_GPR_SHARED5_TOG_m7_mask_tpm1(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_tpm1_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_tpm1_MASK)

#define CCM_GPR_SHARED5_TOG_m7_mask_tpm2_MASK    (0x10000000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_tpm2_SHIFT   (28U)
/*! m7_mask_tpm2 - m7_mask_tpm2 */
#define CCM_GPR_SHARED5_TOG_m7_mask_tpm2(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_tpm2_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_tpm2_MASK)

#define CCM_GPR_SHARED5_TOG_m7_mask_tpm3_MASK    (0x20000000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_tpm3_SHIFT   (29U)
/*! m7_mask_tpm3 - m7_mask_tpm3 */
#define CCM_GPR_SHARED5_TOG_m7_mask_tpm3(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_tpm3_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_tpm3_MASK)

#define CCM_GPR_SHARED5_TOG_m7_mask_tpm4_MASK    (0x40000000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_tpm4_SHIFT   (30U)
/*! m7_mask_tpm4 - m7_mask_tpm4 */
#define CCM_GPR_SHARED5_TOG_m7_mask_tpm4(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_tpm4_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_tpm4_MASK)

#define CCM_GPR_SHARED5_TOG_m7_mask_tpm5_MASK    (0x80000000U)
#define CCM_GPR_SHARED5_TOG_m7_mask_tpm5_SHIFT   (31U)
/*! m7_mask_tpm5 - m7_mask_tpm5 */
#define CCM_GPR_SHARED5_TOG_m7_mask_tpm5(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_TOG_m7_mask_tpm5_SHIFT)) & CCM_GPR_SHARED5_TOG_m7_mask_tpm5_MASK)
/*! @} */

/*! @name GPR_SHARED5_AUTHEN - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED5_AUTHEN_TZ_USER_MASK      (0x100U)
#define CCM_GPR_SHARED5_AUTHEN_TZ_USER_SHIFT     (8U)
/*! TZ_USER - User access permission
 *  0b1..Registers of shared GPR slice can be changed in user mode.
 *  0b0..Registers of shared GPR slice cannot be changed in user mode.
 */
#define CCM_GPR_SHARED5_AUTHEN_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_TZ_USER_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_TZ_USER_MASK)

#define CCM_GPR_SHARED5_AUTHEN_TZ_NS_MASK        (0x200U)
#define CCM_GPR_SHARED5_AUTHEN_TZ_NS_SHIFT       (9U)
/*! TZ_NS - Non-secure access permission
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_GPR_SHARED5_AUTHEN_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_TZ_NS_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_TZ_NS_MASK)

#define CCM_GPR_SHARED5_AUTHEN_LOCK_TZ_MASK      (0x800U)
#define CCM_GPR_SHARED5_AUTHEN_LOCK_TZ_SHIFT     (11U)
/*! LOCK_TZ - Lock TrustZone settings
 *  0b0..TrustZone settings is not locked.
 *  0b1..TrustZone settings is locked.
 */
#define CCM_GPR_SHARED5_AUTHEN_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_LOCK_TZ_MASK)

#define CCM_GPR_SHARED5_AUTHEN_LOCK_LIST_MASK    (0x8000U)
#define CCM_GPR_SHARED5_AUTHEN_LOCK_LIST_SHIFT   (15U)
/*! LOCK_LIST - Lock white list
 *  0b0..Whitelist is not locked.
 *  0b1..Whitelist is locked.
 */
#define CCM_GPR_SHARED5_AUTHEN_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_LOCK_LIST_MASK)

#define CCM_GPR_SHARED5_AUTHEN_WHITE_LIST_MASK   (0xFFFF0000U)
#define CCM_GPR_SHARED5_AUTHEN_WHITE_LIST_SHIFT  (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED5_AUTHEN_WHITE_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED5_AUTHEN_SET - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED5_AUTHEN_SET_TZ_USER_MASK  (0x100U)
#define CCM_GPR_SHARED5_AUTHEN_SET_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED5_AUTHEN_SET_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_SET_TZ_USER_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_SET_TZ_USER_MASK)

#define CCM_GPR_SHARED5_AUTHEN_SET_TZ_NS_MASK    (0x200U)
#define CCM_GPR_SHARED5_AUTHEN_SET_TZ_NS_SHIFT   (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED5_AUTHEN_SET_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_SET_TZ_NS_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_SET_TZ_NS_MASK)

#define CCM_GPR_SHARED5_AUTHEN_SET_LOCK_TZ_MASK  (0x800U)
#define CCM_GPR_SHARED5_AUTHEN_SET_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED5_AUTHEN_SET_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_SET_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_SET_LOCK_TZ_MASK)

#define CCM_GPR_SHARED5_AUTHEN_SET_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED5_AUTHEN_SET_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED5_AUTHEN_SET_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_SET_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_SET_LOCK_LIST_MASK)

