JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define CCM_GPR_SHARED9_m33_sai2_ipg_stop_MASK   (0x800000U)
#define CCM_GPR_SHARED9_m33_sai2_ipg_stop_SHIFT  (23U)
/*! m33_sai2_ipg_stop - m33_sai2_ipg_stop */
#define CCM_GPR_SHARED9_m33_sai2_ipg_stop(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_m33_sai2_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_m33_sai2_ipg_stop_MASK)

#define CCM_GPR_SHARED9_m33_sai3_ipg_stop_MASK   (0x1000000U)
#define CCM_GPR_SHARED9_m33_sai3_ipg_stop_SHIFT  (24U)
/*! m33_sai3_ipg_stop - m33_sai3_ipg_stop */
#define CCM_GPR_SHARED9_m33_sai3_ipg_stop(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_m33_sai3_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_m33_sai3_ipg_stop_MASK)

#define CCM_GPR_SHARED9_m33_sai4_ipg_stop_MASK   (0x2000000U)
#define CCM_GPR_SHARED9_m33_sai4_ipg_stop_SHIFT  (25U)
/*! m33_sai4_ipg_stop - m33_sai4_ipg_stop */
#define CCM_GPR_SHARED9_m33_sai4_ipg_stop(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_m33_sai4_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_m33_sai4_ipg_stop_MASK)

#define CCM_GPR_SHARED9_m33_mic_ipg_stop_MASK    (0x4000000U)
#define CCM_GPR_SHARED9_m33_mic_ipg_stop_SHIFT   (26U)
/*! m33_mic_ipg_stop - m33_mic_ipg_stop */
#define CCM_GPR_SHARED9_m33_mic_ipg_stop(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_m33_mic_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_m33_mic_ipg_stop_MASK)
/*! @} */

/*! @name GPR_SHARED9_SET - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED9_SET_m33_lpuart6_ipg_stop_MASK (0x1U)
#define CCM_GPR_SHARED9_SET_m33_lpuart6_ipg_stop_SHIFT (0U)
/*! m33_lpuart6_ipg_stop - m33_lpuart6_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpuart6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpuart6_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpuart6_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpuart7_ipg_stop_MASK (0x2U)
#define CCM_GPR_SHARED9_SET_m33_lpuart7_ipg_stop_SHIFT (1U)
/*! m33_lpuart7_ipg_stop - m33_lpuart7_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpuart7_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpuart7_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpuart7_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpuart8_ipg_stop_MASK (0x4U)
#define CCM_GPR_SHARED9_SET_m33_lpuart8_ipg_stop_SHIFT (2U)
/*! m33_lpuart8_ipg_stop - m33_lpuart8_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpuart8_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpuart8_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpuart8_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpuart9_ipg_stop_MASK (0x8U)
#define CCM_GPR_SHARED9_SET_m33_lpuart9_ipg_stop_SHIFT (3U)
/*! m33_lpuart9_ipg_stop - m33_lpuart9_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpuart9_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpuart9_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpuart9_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpuart10_ipg_stop_MASK (0x10U)
#define CCM_GPR_SHARED9_SET_m33_lpuart10_ipg_stop_SHIFT (4U)
/*! m33_lpuart10_ipg_stop - m33_lpuart10_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpuart10_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpuart10_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpuart10_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpuart11_ipg_stop_MASK (0x20U)
#define CCM_GPR_SHARED9_SET_m33_lpuart11_ipg_stop_SHIFT (5U)
/*! m33_lpuart11_ipg_stop - m33_lpuart11_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpuart11_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpuart11_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpuart11_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpuart12_ipg_stop_MASK (0x40U)
#define CCM_GPR_SHARED9_SET_m33_lpuart12_ipg_stop_SHIFT (6U)
/*! m33_lpuart12_ipg_stop - m33_lpuart12_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpuart12_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpuart12_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpuart12_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpi2c1_ipg_stop_MASK (0x80U)
#define CCM_GPR_SHARED9_SET_m33_lpi2c1_ipg_stop_SHIFT (7U)
/*! m33_lpi2c1_ipg_stop - m33_lpi2c1_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpi2c1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpi2c1_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpi2c1_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpi2c2_ipg_stop_MASK (0x100U)
#define CCM_GPR_SHARED9_SET_m33_lpi2c2_ipg_stop_SHIFT (8U)
/*! m33_lpi2c2_ipg_stop - m33_lpi2c2_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpi2c2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpi2c2_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpi2c2_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpi2c3_ipg_stop_MASK (0x200U)
#define CCM_GPR_SHARED9_SET_m33_lpi2c3_ipg_stop_SHIFT (9U)
/*! m33_lpi2c3_ipg_stop - m33_lpi2c3_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpi2c3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpi2c3_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpi2c3_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpi2c4_ipg_stop_MASK (0x400U)
#define CCM_GPR_SHARED9_SET_m33_lpi2c4_ipg_stop_SHIFT (10U)
/*! m33_lpi2c4_ipg_stop - m33_lpi2c4_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpi2c4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpi2c4_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpi2c4_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpi2c5_ipg_stop_MASK (0x800U)
#define CCM_GPR_SHARED9_SET_m33_lpi2c5_ipg_stop_SHIFT (11U)
/*! m33_lpi2c5_ipg_stop - m33_lpi2c5_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpi2c5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpi2c5_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpi2c5_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpi2c6_ipg_stop_MASK (0x1000U)
#define CCM_GPR_SHARED9_SET_m33_lpi2c6_ipg_stop_SHIFT (12U)
/*! m33_lpi2c6_ipg_stop - m33_lpi2c6_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpi2c6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpi2c6_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpi2c6_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpspi1_ipg_stop_MASK (0x2000U)
#define CCM_GPR_SHARED9_SET_m33_lpspi1_ipg_stop_SHIFT (13U)
/*! m33_lpspi1_ipg_stop - m33_lpspi1_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpspi1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpspi1_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpspi1_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpspi2_ipg_stop_MASK (0x4000U)
#define CCM_GPR_SHARED9_SET_m33_lpspi2_ipg_stop_SHIFT (14U)
/*! m33_lpspi2_ipg_stop - m33_lpspi2_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpspi2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpspi2_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpspi2_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpspi3_ipg_stop_MASK (0x8000U)
#define CCM_GPR_SHARED9_SET_m33_lpspi3_ipg_stop_SHIFT (15U)
/*! m33_lpspi3_ipg_stop - m33_lpspi3_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpspi3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpspi3_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpspi3_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpspi4_ipg_stop_MASK (0x10000U)
#define CCM_GPR_SHARED9_SET_m33_lpspi4_ipg_stop_SHIFT (16U)
/*! m33_lpspi4_ipg_stop - m33_lpspi4_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpspi4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpspi4_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpspi4_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpspi5_ipg_stop_MASK (0x20000U)
#define CCM_GPR_SHARED9_SET_m33_lpspi5_ipg_stop_SHIFT (17U)
/*! m33_lpspi5_ipg_stop - m33_lpspi5_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpspi5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpspi5_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpspi5_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_lpspi6_ipg_stop_MASK (0x40000U)
#define CCM_GPR_SHARED9_SET_m33_lpspi6_ipg_stop_SHIFT (18U)
/*! m33_lpspi6_ipg_stop - m33_lpspi6_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_lpspi6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_lpspi6_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_lpspi6_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_sinc1_ipg_stop_MASK (0x80000U)
#define CCM_GPR_SHARED9_SET_m33_sinc1_ipg_stop_SHIFT (19U)
/*! m33_sinc1_ipg_stop - m33_sinc1_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_sinc1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_sinc1_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_sinc1_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_sinc2_ipg_stop_MASK (0x100000U)
#define CCM_GPR_SHARED9_SET_m33_sinc2_ipg_stop_SHIFT (20U)
/*! m33_sinc2_ipg_stop - m33_sinc2_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_sinc2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_sinc2_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_sinc2_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_sinc3_ipg_stop_MASK (0x200000U)
#define CCM_GPR_SHARED9_SET_m33_sinc3_ipg_stop_SHIFT (21U)
/*! m33_sinc3_ipg_stop - m33_sinc3_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_sinc3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_sinc3_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_sinc3_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_sai1_ipg_stop_MASK (0x400000U)
#define CCM_GPR_SHARED9_SET_m33_sai1_ipg_stop_SHIFT (22U)
/*! m33_sai1_ipg_stop - m33_sai1_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_sai1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_sai1_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_sai1_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_sai2_ipg_stop_MASK (0x800000U)
#define CCM_GPR_SHARED9_SET_m33_sai2_ipg_stop_SHIFT (23U)
/*! m33_sai2_ipg_stop - m33_sai2_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_sai2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_sai2_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_sai2_ipg_stop_MASK)

#define CCM_GPR_SHARED9_SET_m33_sai3_ipg_stop_MASK (0x1000000U)
#define CCM_GPR_SHARED9_SET_m33_sai3_ipg_stop_SHIFT (24U)
/*! m33_sai3_ipg_stop - m33_sai3_ipg_stop */
#define CCM_GPR_SHARED9_SET_m33_sai3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_SET_m33_sai3_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_SET_m33_sai3_ipg_stop_MASK)

