JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define CCM_GPR_SHARED14_SET_m7_tpm6_ipg_doze_MASK (0x4000U)
#define CCM_GPR_SHARED14_SET_m7_tpm6_ipg_doze_SHIFT (14U)
/*! m7_tpm6_ipg_doze - m7_tpm6_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_tpm6_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_tpm6_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_tpm6_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_gpt1_ipg_doze_MASK (0x8000U)
#define CCM_GPR_SHARED14_SET_m7_gpt1_ipg_doze_SHIFT (15U)
/*! m7_gpt1_ipg_doze - m7_gpt1_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_gpt1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_gpt1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_gpt1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_gpt2_ipg_doze_MASK (0x10000U)
#define CCM_GPR_SHARED14_SET_m7_gpt2_ipg_doze_SHIFT (16U)
/*! m7_gpt2_ipg_doze - m7_gpt2_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_gpt2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_gpt2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_gpt2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_can1_ipg_doze_MASK (0x20000U)
#define CCM_GPR_SHARED14_SET_m7_can1_ipg_doze_SHIFT (17U)
/*! m7_can1_ipg_doze - m7_can1_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_can1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_can1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_can1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_can2_ipg_doze_MASK (0x40000U)
#define CCM_GPR_SHARED14_SET_m7_can2_ipg_doze_SHIFT (18U)
/*! m7_can2_ipg_doze - m7_can2_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_can2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_can2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_can2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_can3_ipg_doze_MASK (0x80000U)
#define CCM_GPR_SHARED14_SET_m7_can3_ipg_doze_SHIFT (19U)
/*! m7_can3_ipg_doze - m7_can3_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_can3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_can3_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_can3_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart1_ipg_doze_MASK (0x100000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart1_ipg_doze_SHIFT (20U)
/*! m7_lpuart1_ipg_doze - m7_lpuart1_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart2_ipg_doze_MASK (0x200000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart2_ipg_doze_SHIFT (21U)
/*! m7_lpuart2_ipg_doze - m7_lpuart2_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart3_ipg_doze_MASK (0x400000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart3_ipg_doze_SHIFT (22U)
/*! m7_lpuart3_ipg_doze - m7_lpuart3_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart3_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart3_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart4_ipg_doze_MASK (0x800000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart4_ipg_doze_SHIFT (23U)
/*! m7_lpuart4_ipg_doze - m7_lpuart4_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart4_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart4_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart4_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart5_ipg_doze_MASK (0x1000000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart5_ipg_doze_SHIFT (24U)
/*! m7_lpuart5_ipg_doze - m7_lpuart5_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart5_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart5_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart5_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart6_ipg_doze_MASK (0x2000000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart6_ipg_doze_SHIFT (25U)
/*! m7_lpuart6_ipg_doze - m7_lpuart6_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart6_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart6_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart6_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart7_ipg_doze_MASK (0x4000000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart7_ipg_doze_SHIFT (26U)
/*! m7_lpuart7_ipg_doze - m7_lpuart7_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart7_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart7_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart7_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart8_ipg_doze_MASK (0x8000000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart8_ipg_doze_SHIFT (27U)
/*! m7_lpuart8_ipg_doze - m7_lpuart8_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart8_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart8_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart8_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart9_ipg_doze_MASK (0x10000000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart9_ipg_doze_SHIFT (28U)
/*! m7_lpuart9_ipg_doze - m7_lpuart9_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart9_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart9_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart9_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart10_ipg_doze_MASK (0x20000000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart10_ipg_doze_SHIFT (29U)
/*! m7_lpuart10_ipg_doze - m7_lpuart10_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart10_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart10_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart10_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart11_ipg_doze_MASK (0x40000000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart11_ipg_doze_SHIFT (30U)
/*! m7_lpuart11_ipg_doze - m7_lpuart11_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart11_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart11_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart11_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpuart12_ipg_doze_MASK (0x80000000U)
#define CCM_GPR_SHARED14_SET_m7_lpuart12_ipg_doze_SHIFT (31U)
/*! m7_lpuart12_ipg_doze - m7_lpuart12_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpuart12_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpuart12_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpuart12_ipg_doze_MASK)
/*! @} */

/*! @name GPR_SHARED14_CLR - General Purpose Register */
/*! @{ */

