JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define ECAT_CONFIGURED_STATION_ALIAS_BF0_MASK   (0xFFFFU)
#define ECAT_CONFIGURED_STATION_ALIAS_BF0_SHIFT  (0U)
/*! BF0 - Alias Address used for node addressing (FPRD/FPWR/FPRW/FRMW commands). */
#define ECAT_CONFIGURED_STATION_ALIAS_BF0(x)     (((uint16_t)(((uint16_t)(x)) << ECAT_CONFIGURED_STATION_ALIAS_BF0_SHIFT)) & ECAT_CONFIGURED_STATION_ALIAS_BF0_MASK)
/*! @} */

/*! @name CONFIGURED_STATION_ALIAS_PDI - Configured Station Alias */
/*! @{ */

#define ECAT_CONFIGURED_STATION_ALIAS_PDI_BF0_MASK (0xFFFFU)
#define ECAT_CONFIGURED_STATION_ALIAS_PDI_BF0_SHIFT (0U)
/*! BF0 - Alias Address used for node addressing (FPRD/FPWR/FPRW/FRMW commands). */
#define ECAT_CONFIGURED_STATION_ALIAS_PDI_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_CONFIGURED_STATION_ALIAS_PDI_BF0_SHIFT)) & ECAT_CONFIGURED_STATION_ALIAS_PDI_BF0_MASK)
/*! @} */

/*! @name REGISTER_WRITE_ENABLE - Register Write Enable */
/*! @{ */

#define ECAT_REGISTER_WRITE_ENABLE_BF0_MASK      (0x1U)
#define ECAT_REGISTER_WRITE_ENABLE_BF0_SHIFT     (0U)
/*! BF0 - Register Write Enable. */
#define ECAT_REGISTER_WRITE_ENABLE_BF0(x)        (((uint8_t)(((uint8_t)(x)) << ECAT_REGISTER_WRITE_ENABLE_BF0_SHIFT)) & ECAT_REGISTER_WRITE_ENABLE_BF0_MASK)

#define ECAT_REGISTER_WRITE_ENABLE_BF1_MASK      (0xFEU)
#define ECAT_REGISTER_WRITE_ENABLE_BF1_SHIFT     (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_REGISTER_WRITE_ENABLE_BF1(x)        (((uint8_t)(((uint8_t)(x)) << ECAT_REGISTER_WRITE_ENABLE_BF1_SHIFT)) & ECAT_REGISTER_WRITE_ENABLE_BF1_MASK)
/*! @} */

/*! @name REGISTER_WRITE_ENABLE_PDI - Register Write Enable */
/*! @{ */

#define ECAT_REGISTER_WRITE_ENABLE_PDI_BF0_MASK  (0x1U)
#define ECAT_REGISTER_WRITE_ENABLE_PDI_BF0_SHIFT (0U)
/*! BF0 - Register Write Enable. */
#define ECAT_REGISTER_WRITE_ENABLE_PDI_BF0(x)    (((uint8_t)(((uint8_t)(x)) << ECAT_REGISTER_WRITE_ENABLE_PDI_BF0_SHIFT)) & ECAT_REGISTER_WRITE_ENABLE_PDI_BF0_MASK)

#define ECAT_REGISTER_WRITE_ENABLE_PDI_BF1_MASK  (0xFEU)
#define ECAT_REGISTER_WRITE_ENABLE_PDI_BF1_SHIFT (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_REGISTER_WRITE_ENABLE_PDI_BF1(x)    (((uint8_t)(((uint8_t)(x)) << ECAT_REGISTER_WRITE_ENABLE_PDI_BF1_SHIFT)) & ECAT_REGISTER_WRITE_ENABLE_PDI_BF1_MASK)
/*! @} */

/*! @name REGISTER_WRITE_PROTECTION - Register Write Protection */
/*! @{ */

#define ECAT_REGISTER_WRITE_PROTECTION_BF0_MASK  (0x1U)
#define ECAT_REGISTER_WRITE_PROTECTION_BF0_SHIFT (0U)
/*! BF0 - Register write protection.
 *  0b0..Protection disabled
 *  0b1..Protection enabled
 */
#define ECAT_REGISTER_WRITE_PROTECTION_BF0(x)    (((uint8_t)(((uint8_t)(x)) << ECAT_REGISTER_WRITE_PROTECTION_BF0_SHIFT)) & ECAT_REGISTER_WRITE_PROTECTION_BF0_MASK)

#define ECAT_REGISTER_WRITE_PROTECTION_BF1_MASK  (0xFEU)
#define ECAT_REGISTER_WRITE_PROTECTION_BF1_SHIFT (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_REGISTER_WRITE_PROTECTION_BF1(x)    (((uint8_t)(((uint8_t)(x)) << ECAT_REGISTER_WRITE_PROTECTION_BF1_SHIFT)) & ECAT_REGISTER_WRITE_PROTECTION_BF1_MASK)
/*! @} */

/*! @name REGISTER_WRITE_PROTECTION_PDI - Register Write Protection */
/*! @{ */

#define ECAT_REGISTER_WRITE_PROTECTION_PDI_BF0_MASK (0x1U)
#define ECAT_REGISTER_WRITE_PROTECTION_PDI_BF0_SHIFT (0U)
/*! BF0 - Register write protection.
 *  0b0..Protection disabled
 *  0b1..Protection enabled
 */
#define ECAT_REGISTER_WRITE_PROTECTION_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_REGISTER_WRITE_PROTECTION_PDI_BF0_SHIFT)) & ECAT_REGISTER_WRITE_PROTECTION_PDI_BF0_MASK)

#define ECAT_REGISTER_WRITE_PROTECTION_PDI_BF1_MASK (0xFEU)
#define ECAT_REGISTER_WRITE_PROTECTION_PDI_BF1_SHIFT (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_REGISTER_WRITE_PROTECTION_PDI_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_REGISTER_WRITE_PROTECTION_PDI_BF1_SHIFT)) & ECAT_REGISTER_WRITE_PROTECTION_PDI_BF1_MASK)
/*! @} */

/*! @name ESC_WRITE_ENABLE - ESC Write Enable */
/*! @{ */

#define ECAT_ESC_WRITE_ENABLE_BF0_MASK           (0x1U)
#define ECAT_ESC_WRITE_ENABLE_BF0_SHIFT          (0U)
/*! BF0 - ESC Write Enable */
#define ECAT_ESC_WRITE_ENABLE_BF0(x)             (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_WRITE_ENABLE_BF0_SHIFT)) & ECAT_ESC_WRITE_ENABLE_BF0_MASK)

#define ECAT_ESC_WRITE_ENABLE_BF1_MASK           (0xFEU)
#define ECAT_ESC_WRITE_ENABLE_BF1_SHIFT          (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_ESC_WRITE_ENABLE_BF1(x)             (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_WRITE_ENABLE_BF1_SHIFT)) & ECAT_ESC_WRITE_ENABLE_BF1_MASK)
/*! @} */

/*! @name ESC_WRITE_ENABLE_PDI - ESC Write Enable */
/*! @{ */

#define ECAT_ESC_WRITE_ENABLE_PDI_BF0_MASK       (0x1U)
#define ECAT_ESC_WRITE_ENABLE_PDI_BF0_SHIFT      (0U)
/*! BF0 - ESC Write Enable */
#define ECAT_ESC_WRITE_ENABLE_PDI_BF0(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_WRITE_ENABLE_PDI_BF0_SHIFT)) & ECAT_ESC_WRITE_ENABLE_PDI_BF0_MASK)

#define ECAT_ESC_WRITE_ENABLE_PDI_BF1_MASK       (0xFEU)
#define ECAT_ESC_WRITE_ENABLE_PDI_BF1_SHIFT      (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_ESC_WRITE_ENABLE_PDI_BF1(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_WRITE_ENABLE_PDI_BF1_SHIFT)) & ECAT_ESC_WRITE_ENABLE_PDI_BF1_MASK)
/*! @} */

/*! @name ESC_WRITE_PROTECTION - ESC Write Protection */
/*! @{ */

#define ECAT_ESC_WRITE_PROTECTION_BF0_MASK       (0x1U)
#define ECAT_ESC_WRITE_PROTECTION_BF0_SHIFT      (0U)
/*! BF0 - Write protect:
 *  0b0..Protection disabled
 *  0b1..Protection enabled
 */
#define ECAT_ESC_WRITE_PROTECTION_BF0(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_WRITE_PROTECTION_BF0_SHIFT)) & ECAT_ESC_WRITE_PROTECTION_BF0_MASK)

#define ECAT_ESC_WRITE_PROTECTION_BF1_MASK       (0xFEU)
#define ECAT_ESC_WRITE_PROTECTION_BF1_SHIFT      (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_ESC_WRITE_PROTECTION_BF1(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_WRITE_PROTECTION_BF1_SHIFT)) & ECAT_ESC_WRITE_PROTECTION_BF1_MASK)
/*! @} */

/*! @name ESC_WRITE_PROTECTION_PDI - ESC Write Protection */
/*! @{ */

#define ECAT_ESC_WRITE_PROTECTION_PDI_BF0_MASK   (0x1U)
#define ECAT_ESC_WRITE_PROTECTION_PDI_BF0_SHIFT  (0U)
/*! BF0 - Write protect:
 *  0b0..Protection disabled
 *  0b1..Protection enabled
 */
#define ECAT_ESC_WRITE_PROTECTION_PDI_BF0(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_WRITE_PROTECTION_PDI_BF0_SHIFT)) & ECAT_ESC_WRITE_PROTECTION_PDI_BF0_MASK)

#define ECAT_ESC_WRITE_PROTECTION_PDI_BF1_MASK   (0xFEU)
#define ECAT_ESC_WRITE_PROTECTION_PDI_BF1_SHIFT  (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_ESC_WRITE_PROTECTION_PDI_BF1(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_WRITE_PROTECTION_PDI_BF1_SHIFT)) & ECAT_ESC_WRITE_PROTECTION_PDI_BF1_MASK)
/*! @} */

/*! @name ESC_RESET_ECAT_WRITE - ESC Reset ECAT WRITE */
/*! @{ */

#define ECAT_ESC_RESET_ECAT_WRITE_BF0_MASK       (0xFFU)
#define ECAT_ESC_RESET_ECAT_WRITE_BF0_SHIFT      (0U)
/*! BF0 - A reset is asserted after writing 0x52 ('R'), 0x45 ('E') and 0x53 ('S') in this register with 3 consecutive frames. */
#define ECAT_ESC_RESET_ECAT_WRITE_BF0(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_RESET_ECAT_WRITE_BF0_SHIFT)) & ECAT_ESC_RESET_ECAT_WRITE_BF0_MASK)
/*! @} */

/*! @name ESC_RESET_ECAT_WRITE_PDI - ESC Reset ECAT WRITE */
/*! @{ */

