JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name REGISTER_EEPROM_PDI_ACCESS_STATE_PDI - EEPROM PDI Access State */
/*! @{ */

#define ECAT_REGISTER_EEPROM_PDI_ACCESS_STATE_PDI_BF0_MASK (0x1U)
#define ECAT_REGISTER_EEPROM_PDI_ACCESS_STATE_PDI_BF0_SHIFT (0U)
/*! BF0 - Access to EEPROM:
 *  0b0..PDI releases EEPROM access
 *  0b1..PDI takes EEPROM access (PDI has EEPROM control)
 */
#define ECAT_REGISTER_EEPROM_PDI_ACCESS_STATE_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_REGISTER_EEPROM_PDI_ACCESS_STATE_PDI_BF0_SHIFT)) & ECAT_REGISTER_EEPROM_PDI_ACCESS_STATE_PDI_BF0_MASK)

#define ECAT_REGISTER_EEPROM_PDI_ACCESS_STATE_PDI_BF1_MASK (0xFEU)
#define ECAT_REGISTER_EEPROM_PDI_ACCESS_STATE_PDI_BF1_SHIFT (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_REGISTER_EEPROM_PDI_ACCESS_STATE_PDI_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_REGISTER_EEPROM_PDI_ACCESS_STATE_PDI_BF1_SHIFT)) & ECAT_REGISTER_EEPROM_PDI_ACCESS_STATE_PDI_BF1_MASK)
/*! @} */

/*! @name EEPROM_CONTROL_STATUS - Register EEPROM Control/Status */
/*! @{ */

#define ECAT_EEPROM_CONTROL_STATUS_BF0_MASK      (0x1U)
#define ECAT_EEPROM_CONTROL_STATUS_BF0_SHIFT     (0U)
/*! BF0 - ECAT write enable2
 *  0b0..Write requests are disabled
 *  0b1..Write requests are enabled
 */
#define ECAT_EEPROM_CONTROL_STATUS_BF0(x)        (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF0_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF0_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_BF1_MASK      (0x1EU)
#define ECAT_EEPROM_CONTROL_STATUS_BF1_SHIFT     (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_EEPROM_CONTROL_STATUS_BF1(x)        (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF1_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF1_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_BF5_MASK      (0x20U)
#define ECAT_EEPROM_CONTROL_STATUS_BF5_SHIFT     (5U)
/*! BF5 - EEPROM emulation:
 *  0b0..Normal operation (I2C interface used)
 *  0b1..PDI emulates EEPROM (I2C not used)
 */
#define ECAT_EEPROM_CONTROL_STATUS_BF5(x)        (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF5_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF5_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_BF6_MASK      (0x40U)
#define ECAT_EEPROM_CONTROL_STATUS_BF6_SHIFT     (6U)
/*! BF6 - Supported number of EEPROM read bytes:
 *  0b0..4 Bytes
 *  0b1..8 Bytes
 */
#define ECAT_EEPROM_CONTROL_STATUS_BF6(x)        (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF6_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF6_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_BF7_MASK      (0x80U)
#define ECAT_EEPROM_CONTROL_STATUS_BF7_SHIFT     (7U)
/*! BF7 - Selected EEPROM Algorithm:
 *  0b0..1 address byte (1Kbit to 16Kbit EEPROMs)
 *  0b1..2 address bytes (32Kbit to 4 Mbit EEPROMs)
 */
#define ECAT_EEPROM_CONTROL_STATUS_BF7(x)        (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF7_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF7_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_BF8_MASK      (0x700U)
#define ECAT_EEPROM_CONTROL_STATUS_BF8_SHIFT     (8U)
/*! BF8 - Command register
 *  0b000..No command/EEPROM idle (clear error bits)
 *  0b001..Read
 *  0b010..Write
 *  0b100..Reload
 */
#define ECAT_EEPROM_CONTROL_STATUS_BF8(x)        (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF8_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF8_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_BF11_MASK     (0x800U)
#define ECAT_EEPROM_CONTROL_STATUS_BF11_SHIFT    (11U)
/*! BF11 - Checksum Error in ESC Configuration Area:
 *  0b0..Checksum ok
 *  0b1..Checksum error
 */
#define ECAT_EEPROM_CONTROL_STATUS_BF11(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF11_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF11_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_BF12_MASK     (0x1000U)
#define ECAT_EEPROM_CONTROL_STATUS_BF12_SHIFT    (12U)
/*! BF12 - EEPROM loading status:
 *  0b0..EEPROM loaded, device information ok
 *  0b1..EEPROM not loaded, device information not available (EEPROM loading in progress or finished with a failure)
 */
#define ECAT_EEPROM_CONTROL_STATUS_BF12(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF12_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF12_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_BF13_MASK     (0x2000U)
#define ECAT_EEPROM_CONTROL_STATUS_BF13_SHIFT    (13U)
/*! BF13 - Error Acknowledge/Command3:
 *  0b0..No error
 *  0b1..Missing EEPROM acknowledge or invalid command
 */
#define ECAT_EEPROM_CONTROL_STATUS_BF13(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF13_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF13_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_BF14_MASK     (0x4000U)
#define ECAT_EEPROM_CONTROL_STATUS_BF14_SHIFT    (14U)
/*! BF14 - Error Write Enable3:
 *  0b0..No error
 *  0b1..Write Command without Write enable
 */
#define ECAT_EEPROM_CONTROL_STATUS_BF14(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF14_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF14_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_BF15_MASK     (0x8000U)
#define ECAT_EEPROM_CONTROL_STATUS_BF15_SHIFT    (15U)
/*! BF15 - Busy:
 *  0b0..EEPROM Interface is idle
 *  0b1..EEPROM Interface is busy
 */
#define ECAT_EEPROM_CONTROL_STATUS_BF15(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_BF15_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_BF15_MASK)
/*! @} */

/*! @name EEPROM_CONTROL_STATUS_PDI - Register EEPROM Control/Status */
/*! @{ */

#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF0_MASK  (0x1U)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF0_SHIFT (0U)
/*! BF0 - ECAT write enable2
 *  0b0..Write requests are disabled
 *  0b1..Write requests are enabled
 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF0(x)    (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF0_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF0_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF1_MASK  (0x1EU)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF1_SHIFT (1U)
/*! BF1 - Reserved, write 0 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF1(x)    (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF1_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF1_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF5_MASK  (0x20U)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF5_SHIFT (5U)
/*! BF5 - EEPROM emulation:
 *  0b0..Normal operation (I2C interface used)
 *  0b1..PDI emulates EEPROM (I2C not used)
 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF5(x)    (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF5_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF5_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF6_MASK  (0x40U)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF6_SHIFT (6U)
/*! BF6 - Supported number of EEPROM read bytes:
 *  0b0..4 Bytes
 *  0b1..8 Bytes
 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF6(x)    (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF6_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF6_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF7_MASK  (0x80U)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF7_SHIFT (7U)
/*! BF7 - Selected EEPROM Algorithm:
 *  0b0..1 address byte (1Kbit to 16Kbit EEPROMs)
 *  0b1..2 address bytes (32Kbit to 4 Mbit EEPROMs)
 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF7(x)    (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF7_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF7_MASK)

#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF8_MASK  (0x700U)
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF8_SHIFT (8U)
/*! BF8 - Command register
 *  0b000..No command/EEPROM idle (clear error bits)
 *  0b001..Read
 *  0b010..Write
 *  0b100..Reload
 */
#define ECAT_EEPROM_CONTROL_STATUS_PDI_BF8(x)    (((uint16_t)(((uint16_t)(x)) << ECAT_EEPROM_CONTROL_STATUS_PDI_BF8_SHIFT)) & ECAT_EEPROM_CONTROL_STATUS_PDI_BF8_MASK)

