JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name MII_MANAGEMENT_CONTROL_OR_STATUS_PDI - MII Management Control/Status */
/*! @{ */

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF0_MASK (0x1U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF0_SHIFT (0U)
/*! BF0 - Write enable*:
 *  0b0..Write disabled
 *  0b1..Write enabled
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF0_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF0_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF1_MASK (0x2U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF1_SHIFT (1U)
/*! BF1 - Management Interface can be controlled by PDI (registers 0x0516-0x0517):
 *  0b0..Only ECAT control
 *  0b1..PDI control possible
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF1(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF1_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF1_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF2_MASK (0x4U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF2_SHIFT (2U)
/*! BF2 - MI link detection and configuration:
 *  0b0..Disabled for all ports
 *  0b1..Enabled for at least one MII port, refer to PHY Port Status (0x0518 ff.) for details
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF2(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF2_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF2_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF3_MASK (0xF8U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF3_SHIFT (3U)
/*! BF3 - PHY address of port 0 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF3(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF3_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF3_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF8_MASK (0x300U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF8_SHIFT (8U)
/*! BF8 - Command register*:
 *  0b00..No command/MI idle (clear error bits)
 *  0b01..Read
 *  0b10..Write
 *  0b11..Reserved/invalid command (do not issue)
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF8(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF8_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF8_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF10_MASK (0x1C00U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF10_SHIFT (10U)
/*! BF10 - Reserved, write 0 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF10(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF10_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF10_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF13_MASK (0x2000U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF13_SHIFT (13U)
/*! BF13 - Read error:
 *  0b0..No read error
 *  0b1..Read error occurred (PHY or register not available)
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF13(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF13_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF13_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF14_MASK (0x4000U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF14_SHIFT (14U)
/*! BF14 - Command error:
 *  0b0..Last Command was successful
 *  0b1..Invalid command or write command without Write Enable
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF14(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF14_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF14_MASK)

#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF15_MASK (0x8000U)
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF15_SHIFT (15U)
/*! BF15 - Busy:
 *  0b0..MII Management Interface is idle
 *  0b1..MII Management Interface is busy
 */
#define ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF15(x) (((uint16_t)(((uint16_t)(x)) << ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF15_SHIFT)) & ECAT_MII_MANAGEMENT_CONTROL_OR_STATUS_PDI_BF15_MASK)
/*! @} */

/*! @name PHY_ADDRESS - PHY Address */
/*! @{ */

#define ECAT_PHY_ADDRESS_BF0_MASK                (0x1FU)
#define ECAT_PHY_ADDRESS_BF0_SHIFT               (0U)
/*! BF0 - PHY Address */
#define ECAT_PHY_ADDRESS_BF0(x)                  (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_ADDRESS_BF0_SHIFT)) & ECAT_PHY_ADDRESS_BF0_MASK)

#define ECAT_PHY_ADDRESS_BF5_MASK                (0x60U)
#define ECAT_PHY_ADDRESS_BF5_SHIFT               (5U)
/*! BF5 - Reserved, write 0 */
#define ECAT_PHY_ADDRESS_BF5(x)                  (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_ADDRESS_BF5_SHIFT)) & ECAT_PHY_ADDRESS_BF5_MASK)

#define ECAT_PHY_ADDRESS_BF7_MASK                (0x80U)
#define ECAT_PHY_ADDRESS_BF7_SHIFT               (7U)
/*! BF7 - Show configured PHY address of port 0-3 in register 0x0510[7:3]. This is used if the PHY addresses are not consecutive.
 *  0b0..Register 0x0510[7:3] shows PHY address of port 0 (this is also the PHY address offset, if the PHY addresses are consecutive)
 *  0b1..Register 0x0510[7:3] shows PHY address of port 0x0512[4:0] (valid values 0-3)
 */
#define ECAT_PHY_ADDRESS_BF7(x)                  (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_ADDRESS_BF7_SHIFT)) & ECAT_PHY_ADDRESS_BF7_MASK)
/*! @} */

/*! @name PHY_REGISTER_ADDRESS - PHY Register Address */
/*! @{ */

#define ECAT_PHY_REGISTER_ADDRESS_BF0_MASK       (0x1FU)
#define ECAT_PHY_REGISTER_ADDRESS_BF0_SHIFT      (0U)
/*! BF0 - Address of PHY Register that shall be read/written */
#define ECAT_PHY_REGISTER_ADDRESS_BF0(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_REGISTER_ADDRESS_BF0_SHIFT)) & ECAT_PHY_REGISTER_ADDRESS_BF0_MASK)

#define ECAT_PHY_REGISTER_ADDRESS_BF5_MASK       (0xE0U)
#define ECAT_PHY_REGISTER_ADDRESS_BF5_SHIFT      (5U)
/*! BF5 - Reserved, write 0 */
#define ECAT_PHY_REGISTER_ADDRESS_BF5(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_PHY_REGISTER_ADDRESS_BF5_SHIFT)) & ECAT_PHY_REGISTER_ADDRESS_BF5_MASK)
/*! @} */

/*! @name PHY_DATA - PHY Data */
/*! @{ */

#define ECAT_PHY_DATA_BF0_MASK                   (0xFFFFU)
#define ECAT_PHY_DATA_BF0_SHIFT                  (0U)
/*! BF0 - PHY Read/Write Data */
#define ECAT_PHY_DATA_BF0(x)                     (((uint16_t)(((uint16_t)(x)) << ECAT_PHY_DATA_BF0_SHIFT)) & ECAT_PHY_DATA_BF0_MASK)
/*! @} */

