JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF0_MASK  (0x7U)
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF0_SHIFT (0U)
/*! BF0 - Last logical bit that shall be mapped (bits are counted from least significant bit 0 to most significant bit 7) */
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF0(x)    (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF0_SHIFT)) & ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF0_MASK)

#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF3_MASK  (0xF8U)
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF3_SHIFT (3U)
/*! BF3 - Reserved, write 0 */
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF3(x)    (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF3_SHIFT)) & ECAT_FMMU_LOGICAL_STOP_BIT_PDI_BF3_MASK)
/*! @} */

/* The count of ECAT_FMMU_LOGICAL_STOP_BIT_PDI */
#define ECAT_FMMU_LOGICAL_STOP_BIT_PDI_COUNT     (8U)

/*! @name FMMU_PHYSICAL_START_ADDRESS - Register Physical Start address FMMU */
/*! @{ */

#define ECAT_FMMU_PHYSICAL_START_ADDRESS_BF0_MASK (0xFFFFU)
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_BF0_SHIFT (0U)
/*! BF0 - Physical Start Address (mapped to logical Start address) */
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_BF0(x)  (((uint16_t)(((uint16_t)(x)) << ECAT_FMMU_PHYSICAL_START_ADDRESS_BF0_SHIFT)) & ECAT_FMMU_PHYSICAL_START_ADDRESS_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_PHYSICAL_START_ADDRESS */
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_COUNT   (8U)

/*! @name FMMU_PHYSICAL_START_ADDRESS_PDI - Register Physical Start address FMMU */
/*! @{ */

#define ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_BF0_MASK (0xFFFFU)
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_BF0_SHIFT (0U)
/*! BF0 - Physical Start Address (mapped to logical Start address) */
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_BF0_SHIFT)) & ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_BF0_MASK)
/*! @} */

/* The count of ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI */
#define ECAT_FMMU_PHYSICAL_START_ADDRESS_PDI_COUNT (8U)

/*! @name FMMU_PHYSICAL_START_BIT - Register Physical Start bit FMMU */
/*! @{ */

#define ECAT_FMMU_PHYSICAL_START_BIT_BF0_MASK    (0x7U)
#define ECAT_FMMU_PHYSICAL_START_BIT_BF0_SHIFT   (0U)
/*! BF0 - Physical starting bit as target of logical start bit mapping (bits are counted from least
 *    significant bit 0 to most significant bit 7)
 */
#define ECAT_FMMU_PHYSICAL_START_BIT_BF0(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_PHYSICAL_START_BIT_BF0_SHIFT)) & ECAT_FMMU_PHYSICAL_START_BIT_BF0_MASK)

#define ECAT_FMMU_PHYSICAL_START_BIT_BF3_MASK    (0xF8U)
#define ECAT_FMMU_PHYSICAL_START_BIT_BF3_SHIFT   (3U)
/*! BF3 - Reserved, write 0 */
#define ECAT_FMMU_PHYSICAL_START_BIT_BF3(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_PHYSICAL_START_BIT_BF3_SHIFT)) & ECAT_FMMU_PHYSICAL_START_BIT_BF3_MASK)
/*! @} */

/* The count of ECAT_FMMU_PHYSICAL_START_BIT */
#define ECAT_FMMU_PHYSICAL_START_BIT_COUNT       (8U)

/*! @name FMMU_PHYSICAL_START_BIT_PDI - Register Physical Start bit FMMU */
/*! @{ */

#define ECAT_FMMU_PHYSICAL_START_BIT_PDI_BF0_MASK (0x7U)
#define ECAT_FMMU_PHYSICAL_START_BIT_PDI_BF0_SHIFT (0U)
/*! BF0 - Physical starting bit as target of logical start bit mapping (bits are counted from least
 *    significant bit 0 to most significant bit 7)
 */
#define ECAT_FMMU_PHYSICAL_START_BIT_PDI_BF0(x)  (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_PHYSICAL_START_BIT_PDI_BF0_SHIFT)) & ECAT_FMMU_PHYSICAL_START_BIT_PDI_BF0_MASK)

#define ECAT_FMMU_PHYSICAL_START_BIT_PDI_BF3_MASK (0xF8U)
#define ECAT_FMMU_PHYSICAL_START_BIT_PDI_BF3_SHIFT (3U)
/*! BF3 - Reserved, write 0 */
#define ECAT_FMMU_PHYSICAL_START_BIT_PDI_BF3(x)  (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_PHYSICAL_START_BIT_PDI_BF3_SHIFT)) & ECAT_FMMU_PHYSICAL_START_BIT_PDI_BF3_MASK)
/*! @} */

/* The count of ECAT_FMMU_PHYSICAL_START_BIT_PDI */
#define ECAT_FMMU_PHYSICAL_START_BIT_PDI_COUNT   (8U)

/*! @name FMMU_TYPE - Register Type FMMU y */
/*! @{ */

#define ECAT_FMMU_TYPE_BF0_MASK                  (0x1U)
#define ECAT_FMMU_TYPE_BF0_SHIFT                 (0U)
/*! BF0 - Bit field access for ECAT: r/w
 *  0b0..Ignore mapping for read accesses
 *  0b1..Use mapping for read accesses
 */
#define ECAT_FMMU_TYPE_BF0(x)                    (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_TYPE_BF0_SHIFT)) & ECAT_FMMU_TYPE_BF0_MASK)

#define ECAT_FMMU_TYPE_BF1_MASK                  (0x2U)
#define ECAT_FMMU_TYPE_BF1_SHIFT                 (1U)
/*! BF1 - Bit field access for ECAT: r/w
 *  0b0..Ignore mapping for write accesses
 *  0b1..Use mapping for write accesses
 */
#define ECAT_FMMU_TYPE_BF1(x)                    (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_TYPE_BF1_SHIFT)) & ECAT_FMMU_TYPE_BF1_MASK)

#define ECAT_FMMU_TYPE_BF2_MASK                  (0xFCU)
#define ECAT_FMMU_TYPE_BF2_SHIFT                 (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_FMMU_TYPE_BF2(x)                    (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_TYPE_BF2_SHIFT)) & ECAT_FMMU_TYPE_BF2_MASK)
/*! @} */

/* The count of ECAT_FMMU_TYPE */
#define ECAT_FMMU_TYPE_COUNT                     (8U)

/*! @name FMMU_TYPE_PDI - Register Type FMMU y */
/*! @{ */

#define ECAT_FMMU_TYPE_PDI_BF0_MASK              (0x1U)
#define ECAT_FMMU_TYPE_PDI_BF0_SHIFT             (0U)
/*! BF0
 *  0b0..Ignore mapping for read accesses
 *  0b1..Use mapping for read accesses
 */
#define ECAT_FMMU_TYPE_PDI_BF0(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_TYPE_PDI_BF0_SHIFT)) & ECAT_FMMU_TYPE_PDI_BF0_MASK)

#define ECAT_FMMU_TYPE_PDI_BF1_MASK              (0x2U)
#define ECAT_FMMU_TYPE_PDI_BF1_SHIFT             (1U)
/*! BF1
 *  0b0..Ignore mapping for write accesses
 *  0b1..Use mapping for write accesses
 */
#define ECAT_FMMU_TYPE_PDI_BF1(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_TYPE_PDI_BF1_SHIFT)) & ECAT_FMMU_TYPE_PDI_BF1_MASK)

#define ECAT_FMMU_TYPE_PDI_BF2_MASK              (0xFCU)
#define ECAT_FMMU_TYPE_PDI_BF2_SHIFT             (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_FMMU_TYPE_PDI_BF2(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_FMMU_TYPE_PDI_BF2_SHIFT)) & ECAT_FMMU_TYPE_PDI_BF2_MASK)
/*! @} */

