JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define ENETC_GLOBAL_SMDTR_THRESH_MASK           (0xFFFFFFU)
#define ENETC_GLOBAL_SMDTR_THRESH_SHIFT          (0U)
#define ENETC_GLOBAL_SMDTR_THRESH(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMDTR_THRESH_SHIFT)) & ENETC_GLOBAL_SMDTR_THRESH_MASK)
/*! @} */

/*! @name SMACR - Shared memory available count register */
/*! @{ */

#define ENETC_GLOBAL_SMACR_COUNT_MASK            (0xFFFFFFU)
#define ENETC_GLOBAL_SMACR_COUNT_SHIFT           (0U)
#define ENETC_GLOBAL_SMACR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMACR_COUNT_SHIFT)) & ENETC_GLOBAL_SMACR_COUNT_MASK)
/*! @} */

/*! @name SMCLWMR - Shared memory count low watermark register */
/*! @{ */

#define ENETC_GLOBAL_SMCLWMR_WATERMARK_MASK      (0xFFFFFFU)
#define ENETC_GLOBAL_SMCLWMR_WATERMARK_SHIFT     (0U)
#define ENETC_GLOBAL_SMCLWMR_WATERMARK(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMCLWMR_WATERMARK_SHIFT)) & ENETC_GLOBAL_SMCLWMR_WATERMARK_MASK)
/*! @} */

/*! @name SMBUCR - Shared memory buffer unassigned count register */
/*! @{ */

#define ENETC_GLOBAL_SMBUCR_COUNT_MASK           (0xFFFFFFU)
#define ENETC_GLOBAL_SMBUCR_COUNT_SHIFT          (0U)
#define ENETC_GLOBAL_SMBUCR_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMBUCR_COUNT_SHIFT)) & ENETC_GLOBAL_SMBUCR_COUNT_MASK)
/*! @} */

/*! @name SMBUCHWMR - Shared memory buffer unassigned count high watermark register */
/*! @{ */

#define ENETC_GLOBAL_SMBUCHWMR_WATERMARK_MASK    (0xFFFFFFU)
#define ENETC_GLOBAL_SMBUCHWMR_WATERMARK_SHIFT   (0U)
#define ENETC_GLOBAL_SMBUCHWMR_WATERMARK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMBUCHWMR_WATERMARK_SHIFT)) & ENETC_GLOBAL_SMBUCHWMR_WATERMARK_MASK)
/*! @} */

/*! @name SMLCR - Shared memory loss count register */
/*! @{ */

#define ENETC_GLOBAL_SMLCR_COUNT_MASK            (0xFFFFFFU)
#define ENETC_GLOBAL_SMLCR_COUNT_SHIFT           (0U)
#define ENETC_GLOBAL_SMLCR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMLCR_COUNT_SHIFT)) & ENETC_GLOBAL_SMLCR_COUNT_MASK)

#define ENETC_GLOBAL_SMLCR_IFLC_MASK             (0x40000000U)
#define ENETC_GLOBAL_SMLCR_IFLC_SHIFT            (30U)
#define ENETC_GLOBAL_SMLCR_IFLC(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMLCR_IFLC_SHIFT)) & ENETC_GLOBAL_SMLCR_IFLC_MASK)

#define ENETC_GLOBAL_SMLCR_IFDC_MASK             (0x80000000U)
#define ENETC_GLOBAL_SMLCR_IFDC_SHIFT            (31U)
#define ENETC_GLOBAL_SMLCR_IFDC(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMLCR_IFDC_SHIFT)) & ENETC_GLOBAL_SMLCR_IFDC_MASK)
/*! @} */

/*! @name HBTCAPR - Hash bucket table capability register */
/*! @{ */

#define ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES_MASK    (0xFFFFU)
#define ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES_SHIFT   (0U)
#define ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES_SHIFT)) & ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES_MASK)

#define ENETC_GLOBAL_HBTCAPR_MAX_COL_MASK        (0x7000000U)
#define ENETC_GLOBAL_HBTCAPR_MAX_COL_SHIFT       (24U)
#define ENETC_GLOBAL_HBTCAPR_MAX_COL(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTCAPR_MAX_COL_SHIFT)) & ENETC_GLOBAL_HBTCAPR_MAX_COL_MASK)

#define ENETC_GLOBAL_HBTCAPR_MAX_VISITS_MASK     (0xF0000000U)
#define ENETC_GLOBAL_HBTCAPR_MAX_VISITS_SHIFT    (28U)
#define ENETC_GLOBAL_HBTCAPR_MAX_VISITS(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTCAPR_MAX_VISITS_SHIFT)) & ENETC_GLOBAL_HBTCAPR_MAX_VISITS_MASK)
/*! @} */

/*! @name HBTOR0 - Hash bucket table operational register 0 */
/*! @{ */

#define ENETC_GLOBAL_HBTOR0_NUM_ENTRIES_MASK     (0xFFFFU)
#define ENETC_GLOBAL_HBTOR0_NUM_ENTRIES_SHIFT    (0U)
#define ENETC_GLOBAL_HBTOR0_NUM_ENTRIES(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTOR0_NUM_ENTRIES_SHIFT)) & ENETC_GLOBAL_HBTOR0_NUM_ENTRIES_MASK)

#define ENETC_GLOBAL_HBTOR0_HWM_ENTRIES_MASK     (0xFFFF0000U)
#define ENETC_GLOBAL_HBTOR0_HWM_ENTRIES_SHIFT    (16U)
#define ENETC_GLOBAL_HBTOR0_HWM_ENTRIES(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTOR0_HWM_ENTRIES_SHIFT)) & ENETC_GLOBAL_HBTOR0_HWM_ENTRIES_MASK)
/*! @} */

/*! @name HBTOR2 - Hash bucket table operational register 2 */
/*! @{ */

#define ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT_MASK   (0xFFU)
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT_SHIFT  (0U)
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT_SHIFT)) & ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT_MASK)

#define ENETC_GLOBAL_HBTOR2_RUN_AVG_INT_MASK     (0xFF00U)
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_INT_SHIFT    (8U)
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_INT(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTOR2_RUN_AVG_INT_SHIFT)) & ENETC_GLOBAL_HBTOR2_RUN_AVG_INT_MASK)

#define ENETC_GLOBAL_HBTOR2_HWM_COL_MASK         (0xF0000U)
#define ENETC_GLOBAL_HBTOR2_HWM_COL_SHIFT        (16U)
#define ENETC_GLOBAL_HBTOR2_HWM_COL(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTOR2_HWM_COL_SHIFT)) & ENETC_GLOBAL_HBTOR2_HWM_COL_MASK)
/*! @} */

/*! @name SMERBCAPR - Shared memory ENETC receive buffer capability register */
/*! @{ */

#define ENETC_GLOBAL_SMERBCAPR_THRESH_MASK       (0xFFFFFFU)
#define ENETC_GLOBAL_SMERBCAPR_THRESH_SHIFT      (0U)
#define ENETC_GLOBAL_SMERBCAPR_THRESH(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMERBCAPR_THRESH_SHIFT)) & ENETC_GLOBAL_SMERBCAPR_THRESH_MASK)

#define ENETC_GLOBAL_SMERBCAPR_WORD_SIZE_MASK    (0x30000000U)
#define ENETC_GLOBAL_SMERBCAPR_WORD_SIZE_SHIFT   (28U)
#define ENETC_GLOBAL_SMERBCAPR_WORD_SIZE(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMERBCAPR_WORD_SIZE_SHIFT)) & ENETC_GLOBAL_SMERBCAPR_WORD_SIZE_MASK)

#define ENETC_GLOBAL_SMERBCAPR_MLOC_MASK         (0xC0000000U)
#define ENETC_GLOBAL_SMERBCAPR_MLOC_SHIFT        (30U)
#define ENETC_GLOBAL_SMERBCAPR_MLOC(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMERBCAPR_MLOC_SHIFT)) & ENETC_GLOBAL_SMERBCAPR_MLOC_MASK)
/*! @} */

/*! @name SMERBOR0 - Shared memory ENETC receive buffer operational register 0 */
/*! @{ */

#define ENETC_GLOBAL_SMERBOR0_AMOUNT_MASK        (0xFFFFFFU)
#define ENETC_GLOBAL_SMERBOR0_AMOUNT_SHIFT       (0U)
#define ENETC_GLOBAL_SMERBOR0_AMOUNT(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMERBOR0_AMOUNT_SHIFT)) & ENETC_GLOBAL_SMERBOR0_AMOUNT_MASK)
/*! @} */

/*! @name SMERBOR1 - Shared memory ENETC receive buffer operational 1 */
/*! @{ */

