JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define ENETC_GLOBAL_SMERBOR1_WATERMARK_MASK     (0xFFFFFFU)
#define ENETC_GLOBAL_SMERBOR1_WATERMARK_SHIFT    (0U)
#define ENETC_GLOBAL_SMERBOR1_WATERMARK(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMERBOR1_WATERMARK_SHIFT)) & ENETC_GLOBAL_SMERBOR1_WATERMARK_MASK)
/*! @} */

/*! @name PCEOR - PCE 0 operational register */
/*! @{ */

#define ENETC_GLOBAL_PCEOR_NUM_FRAMES_MASK       (0x3FU)
#define ENETC_GLOBAL_PCEOR_NUM_FRAMES_SHIFT      (0U)
#define ENETC_GLOBAL_PCEOR_NUM_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_PCEOR_NUM_FRAMES_SHIFT)) & ENETC_GLOBAL_PCEOR_NUM_FRAMES_MASK)

#define ENETC_GLOBAL_PCEOR_HWM_FRAMES_MASK       (0x3F00U)
#define ENETC_GLOBAL_PCEOR_HWM_FRAMES_SHIFT      (8U)
#define ENETC_GLOBAL_PCEOR_HWM_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_PCEOR_HWM_FRAMES_SHIFT)) & ENETC_GLOBAL_PCEOR_HWM_FRAMES_MASK)

#define ENETC_GLOBAL_PCEOR_MAX_FRAMES_MASK       (0x3F0000U)
#define ENETC_GLOBAL_PCEOR_MAX_FRAMES_SHIFT      (16U)
#define ENETC_GLOBAL_PCEOR_MAX_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_PCEOR_MAX_FRAMES_SHIFT)) & ENETC_GLOBAL_PCEOR_MAX_FRAMES_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_PCEOR */
#define ENETC_GLOBAL_PCEOR_COUNT                 (1U)

/*! @name RFEOR - Replication Forwarding Engine 0 operational register */
/*! @{ */

#define ENETC_GLOBAL_RFEOR_NUM_FRAMES_MASK       (0x3FU)
#define ENETC_GLOBAL_RFEOR_NUM_FRAMES_SHIFT      (0U)
#define ENETC_GLOBAL_RFEOR_NUM_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RFEOR_NUM_FRAMES_SHIFT)) & ENETC_GLOBAL_RFEOR_NUM_FRAMES_MASK)

#define ENETC_GLOBAL_RFEOR_HWM_FRAMES_MASK       (0x3F00U)
#define ENETC_GLOBAL_RFEOR_HWM_FRAMES_SHIFT      (8U)
#define ENETC_GLOBAL_RFEOR_HWM_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RFEOR_HWM_FRAMES_SHIFT)) & ENETC_GLOBAL_RFEOR_HWM_FRAMES_MASK)

#define ENETC_GLOBAL_RFEOR_MAX_FRAMES_MASK       (0x3F0000U)
#define ENETC_GLOBAL_RFEOR_MAX_FRAMES_SHIFT      (16U)
#define ENETC_GLOBAL_RFEOR_MAX_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RFEOR_MAX_FRAMES_SHIFT)) & ENETC_GLOBAL_RFEOR_MAX_FRAMES_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_RFEOR */
#define ENETC_GLOBAL_RFEOR_COUNT                 (1U)

/*! @name NETCCLKR - NETC clock register */
/*! @{ */

#define ENETC_GLOBAL_NETCCLKR_FREQ_MASK          (0x7FFU)
#define ENETC_GLOBAL_NETCCLKR_FREQ_SHIFT         (0U)
/*! FREQ - Frequency */
#define ENETC_GLOBAL_NETCCLKR_FREQ(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_NETCCLKR_FREQ_SHIFT)) & ENETC_GLOBAL_NETCCLKR_FREQ_MASK)
/*! @} */

/*! @name HTACAPR - HTA 0 capability register */
/*! @{ */

#define ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES_MASK  (0xFFU)
#define ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES_SHIFT (0U)
#define ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES_SHIFT)) & ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES_MASK)

#define ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES_MASK  (0xFF00U)
#define ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES_SHIFT (8U)
#define ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES_SHIFT)) & ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_HTACAPR */
#define ENETC_GLOBAL_HTACAPR_COUNT               (1U)

/*! @name HTARFCOR - HTA 0 receive frame count operational register */
/*! @{ */

#define ENETC_GLOBAL_HTARFCOR_HP_COUNT_MASK      (0xFFU)
#define ENETC_GLOBAL_HTARFCOR_HP_COUNT_SHIFT     (0U)
#define ENETC_GLOBAL_HTARFCOR_HP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTARFCOR_HP_COUNT_SHIFT)) & ENETC_GLOBAL_HTARFCOR_HP_COUNT_MASK)

#define ENETC_GLOBAL_HTARFCOR_HP_HWM_MASK        (0xFF00U)
#define ENETC_GLOBAL_HTARFCOR_HP_HWM_SHIFT       (8U)
#define ENETC_GLOBAL_HTARFCOR_HP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTARFCOR_HP_HWM_SHIFT)) & ENETC_GLOBAL_HTARFCOR_HP_HWM_MASK)

#define ENETC_GLOBAL_HTARFCOR_LP_COUNT_MASK      (0xFF0000U)
#define ENETC_GLOBAL_HTARFCOR_LP_COUNT_SHIFT     (16U)
#define ENETC_GLOBAL_HTARFCOR_LP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTARFCOR_LP_COUNT_SHIFT)) & ENETC_GLOBAL_HTARFCOR_LP_COUNT_MASK)

#define ENETC_GLOBAL_HTARFCOR_LP_HWM_MASK        (0xFF000000U)
#define ENETC_GLOBAL_HTARFCOR_LP_HWM_SHIFT       (24U)
#define ENETC_GLOBAL_HTARFCOR_LP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTARFCOR_LP_HWM_SHIFT)) & ENETC_GLOBAL_HTARFCOR_LP_HWM_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_HTARFCOR */
#define ENETC_GLOBAL_HTARFCOR_COUNT              (1U)

/*! @name HTAHPBCOR - HTA 0 high priority byte count operational register */
/*! @{ */

#define ENETC_GLOBAL_HTAHPBCOR_HP_COUNT_MASK     (0xFFFFU)
#define ENETC_GLOBAL_HTAHPBCOR_HP_COUNT_SHIFT    (0U)
#define ENETC_GLOBAL_HTAHPBCOR_HP_COUNT(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTAHPBCOR_HP_COUNT_SHIFT)) & ENETC_GLOBAL_HTAHPBCOR_HP_COUNT_MASK)

#define ENETC_GLOBAL_HTAHPBCOR_HWM_MASK          (0xFFFF0000U)
#define ENETC_GLOBAL_HTAHPBCOR_HWM_SHIFT         (16U)
#define ENETC_GLOBAL_HTAHPBCOR_HWM(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTAHPBCOR_HWM_SHIFT)) & ENETC_GLOBAL_HTAHPBCOR_HWM_MASK)
/*! @} */

/* The count of ENETC_GLOBAL_HTAHPBCOR */
#define ENETC_GLOBAL_HTAHPBCOR_COUNT             (1U)

/*! @name HTALPBCOR - HTA 0 low priority byte count operational register */
/*! @{ */

#define ENETC_GLOBAL_HTALPBCOR_LP_COUNT_MASK     (0xFFFFU)
#define ENETC_GLOBAL_HTALPBCOR_LP_COUNT_SHIFT    (0U)
#define ENETC_GLOBAL_HTALPBCOR_LP_COUNT(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTALPBCOR_LP_COUNT_SHIFT)) & ENETC_GLOBAL_HTALPBCOR_LP_COUNT_MASK)

#define ENETC_GLOBAL_HTALPBCOR_HWM_MASK          (0xFFFF0000U)
#define ENETC_GLOBAL_HTALPBCOR_HWM_SHIFT         (16U)
#define ENETC_GLOBAL_HTALPBCOR_HWM(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTALPBCOR_HWM_SHIFT)) & ENETC_GLOBAL_HTALPBCOR_HWM_MASK)
/*! @} */

