JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_MDIO_RD_ER_MASK (0x2U)
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_MDIO_RD_ER_SHIFT (1U)
/*! MDIO_RD_ER - MDIO read error */
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_MDIO_RD_ER(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_CFG_MDIO_RD_ER_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_CFG_MDIO_RD_ER_MASK)

#define ENETC_PF_EMDIO_PHY_STATUS_CFG_STATUS_INTERVAL_MASK (0xFFFF0000U)
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_STATUS_INTERVAL_SHIFT (16U)
/*! STATUS_INTERVAL - PHY status read interval */
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_STATUS_INTERVAL(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_CFG_STATUS_INTERVAL_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_CFG_STATUS_INTERVAL_MASK)
/*! @} */

/*! @name PHY_STATUS_CTL - PHY status control register */
/*! @{ */

#define ENETC_PF_EMDIO_PHY_STATUS_CTL_DEV_ADDR_MASK (0x1FU)
#define ENETC_PF_EMDIO_PHY_STATUS_CTL_DEV_ADDR_SHIFT (0U)
/*! DEV_ADDR - 5-bit MDIO device address (Clause 45) / register address (Clause 22) */
#define ENETC_PF_EMDIO_PHY_STATUS_CTL_DEV_ADDR(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_CTL_DEV_ADDR_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_CTL_DEV_ADDR_MASK)

#define ENETC_PF_EMDIO_PHY_STATUS_CTL_PORT_ADDR_MASK (0x3E0U)
#define ENETC_PF_EMDIO_PHY_STATUS_CTL_PORT_ADDR_SHIFT (5U)
/*! PORT_ADDR - 5-bit MDIO port address (Clause 45) / PHY address (Clause 22) */
#define ENETC_PF_EMDIO_PHY_STATUS_CTL_PORT_ADDR(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_CTL_PORT_ADDR_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_CTL_PORT_ADDR_MASK)
/*! @} */

/*! @name PHY_STATUS_DATA - PHY status data register */
/*! @{ */

#define ENETC_PF_EMDIO_PHY_STATUS_DATA_MDIO_DATA_MASK (0xFFFFU)
#define ENETC_PF_EMDIO_PHY_STATUS_DATA_MDIO_DATA_SHIFT (0U)
/*! MDIO_DATA - 16-bit MDIO data */
#define ENETC_PF_EMDIO_PHY_STATUS_DATA_MDIO_DATA(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_DATA_MDIO_DATA_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_DATA_MDIO_DATA_MASK)

#define ENETC_PF_EMDIO_PHY_STATUS_DATA_CURR_CNT_MASK (0xFFFF0000U)
#define ENETC_PF_EMDIO_PHY_STATUS_DATA_CURR_CNT_SHIFT (16U)
/*! CURR_CNT - Current count */
#define ENETC_PF_EMDIO_PHY_STATUS_DATA_CURR_CNT(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_DATA_CURR_CNT_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_DATA_CURR_CNT_MASK)
/*! @} */

/*! @name PHY_STATUS_ADDR - PHY status register address register */
/*! @{ */

#define ENETC_PF_EMDIO_PHY_STATUS_ADDR_REGADDR_MASK (0xFFFFU)
#define ENETC_PF_EMDIO_PHY_STATUS_ADDR_REGADDR_SHIFT (0U)
/*! REGADDR - MDIO PHY register address. Address of the register within the Clause 45 PHY device from which data is to be read. */
#define ENETC_PF_EMDIO_PHY_STATUS_ADDR_REGADDR(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_ADDR_REGADDR_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_ADDR_REGADDR_MASK)
/*! @} */

/*! @name PHY_STATUS_EVENT - PHY status event register */
/*! @{ */

#define ENETC_PF_EMDIO_PHY_STATUS_EVENT_STATUS_EVENT_HL_MASK (0xFFFFU)
#define ENETC_PF_EMDIO_PHY_STATUS_EVENT_STATUS_EVENT_HL_SHIFT (0U)
/*! STATUS_EVENT_HL - Status event high-to-low. Set to 1 if a 1->0 transition on a corresponding data bit has occurred. Write 1 to clear. */
#define ENETC_PF_EMDIO_PHY_STATUS_EVENT_STATUS_EVENT_HL(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_EVENT_STATUS_EVENT_HL_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_EVENT_STATUS_EVENT_HL_MASK)

#define ENETC_PF_EMDIO_PHY_STATUS_EVENT_STATUS_EVENT_LH_MASK (0xFFFF0000U)
#define ENETC_PF_EMDIO_PHY_STATUS_EVENT_STATUS_EVENT_LH_SHIFT (16U)
/*! STATUS_EVENT_LH - Status event low-to-high. Set to 1 if a 0->1 transition on a corresponding data bit has occurred. Write 1 to clear. */
#define ENETC_PF_EMDIO_PHY_STATUS_EVENT_STATUS_EVENT_LH(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_EVENT_STATUS_EVENT_LH_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_EVENT_STATUS_EVENT_LH_MASK)
/*! @} */

/*! @name PHY_STATUS_MASK - PHY status mask register */
/*! @{ */

#define ENETC_PF_EMDIO_PHY_STATUS_MASK_STATUS_MASK_HL_MASK (0xFFFFU)
#define ENETC_PF_EMDIO_PHY_STATUS_MASK_STATUS_MASK_HL_SHIFT (0U)
/*! STATUS_MASK_HL - Status high-to-low mask. If set to 1, assert an interrupt if the corresponding event bit is set. */
#define ENETC_PF_EMDIO_PHY_STATUS_MASK_STATUS_MASK_HL(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_MASK_STATUS_MASK_HL_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_MASK_STATUS_MASK_HL_MASK)

#define ENETC_PF_EMDIO_PHY_STATUS_MASK_STATUS_MASK_LH_MASK (0xFFFF0000U)
#define ENETC_PF_EMDIO_PHY_STATUS_MASK_STATUS_MASK_LH_SHIFT (16U)
/*! STATUS_MASK_LH - Status mask low-to-high. If set to 1, assert an interrupt if the corresponding event bit is set. */
#define ENETC_PF_EMDIO_PHY_STATUS_MASK_STATUS_MASK_LH(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_MASK_STATUS_MASK_LH_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_MASK_STATUS_MASK_LH_MASK)
/*! @} */

/*! @name MDIO_CFG - MDIO configuration register */
/*! @{ */

#define ENETC_PF_EMDIO_MDIO_CFG_MDIO_MODE_MASK   (0x10U)
#define ENETC_PF_EMDIO_MDIO_CFG_MDIO_MODE_SHIFT  (4U)
/*! MDIO_MODE - MDIO pin mode */
#define ENETC_PF_EMDIO_MDIO_CFG_MDIO_MODE(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_MDIO_CFG_MDIO_MODE_SHIFT)) & ENETC_PF_EMDIO_MDIO_CFG_MDIO_MODE_MASK)

#define ENETC_PF_EMDIO_MDIO_CFG_MDC_MODE_MASK    (0x20U)
#define ENETC_PF_EMDIO_MDIO_CFG_MDC_MODE_SHIFT   (5U)
/*! MDC_MODE - MDC pin mode */
#define ENETC_PF_EMDIO_MDIO_CFG_MDC_MODE(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_MDIO_CFG_MDC_MODE_SHIFT)) & ENETC_PF_EMDIO_MDIO_CFG_MDC_MODE_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ENETC_PF_EMDIO_Register_Masks */


/* ENETC_PF_EMDIO - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral EMDIO_BASE base address */
  #define EMDIO_BASE_BASE                          (0x70BA0000u)
  /** Peripheral EMDIO_BASE base address */
  #define EMDIO_BASE_BASE_NS                       (0x60BA0000u)
  /** Peripheral EMDIO_BASE base pointer */
  #define EMDIO_BASE                               ((ENETC_PF_EMDIO_Type *)EMDIO_BASE_BASE)
  /** Peripheral EMDIO_BASE base pointer */
  #define EMDIO_BASE_NS                            ((ENETC_PF_EMDIO_Type *)EMDIO_BASE_BASE_NS)
  /** Array initializer of ENETC_PF_EMDIO peripheral base addresses */
  #define ENETC_PF_EMDIO_BASE_ADDRS                { EMDIO_BASE_BASE }
  /** Array initializer of ENETC_PF_EMDIO peripheral base pointers */
  #define ENETC_PF_EMDIO_BASE_PTRS                 { EMDIO_BASE }
  /** Array initializer of ENETC_PF_EMDIO peripheral base addresses */
  #define ENETC_PF_EMDIO_BASE_ADDRS_NS             { EMDIO_BASE_BASE_NS }
  /** Array initializer of ENETC_PF_EMDIO peripheral base pointers */
  #define ENETC_PF_EMDIO_BASE_PTRS_NS              { EMDIO_BASE_NS }
#else
  /** Peripheral EMDIO_BASE base address */
  #define EMDIO_BASE_BASE                          (0x60BA0000u)
  /** Peripheral EMDIO_BASE base pointer */
  #define EMDIO_BASE                               ((ENETC_PF_EMDIO_Type *)EMDIO_BASE_BASE)
  /** Array initializer of ENETC_PF_EMDIO peripheral base addresses */
  #define ENETC_PF_EMDIO_BASE_ADDRS                { EMDIO_BASE_BASE }
  /** Array initializer of ENETC_PF_EMDIO peripheral base pointers */
  #define ENETC_PF_EMDIO_BASE_PTRS                 { EMDIO_BASE }
#endif

/*!
 * @}
 */ /* end of group ENETC_PF_EMDIO_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- ENETC_PF_TMR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_PF_TMR_Peripheral_Access_Layer ENETC_PF_TMR Peripheral Access Layer
 * @{
 */

/** ENETC_PF_TMR - Register Layout Typedef */
typedef struct {
  __I  uint32_t TMR_ID;                            /**< Module ID Register, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __I  uint32_t TMR_CAPR;                          /**< Timer Capability Register, offset: 0x8 */
       uint8_t RESERVED_1[20];
  __I  uint32_t TMR_FRT_L;                         /**< Timer free running time low register, offset: 0x20 */
  __I  uint32_t TMR_FRT_H;                         /**< Timer free running time high register, offset: 0x24 */
  __I  uint32_t TMR_SRT_L;                         /**< Timer synchronous time low register, offset: 0x28 */
  __I  uint32_t TMR_SRT_H;                         /**< Timer synchronous time high register., offset: 0x2C */
  __I  uint32_t TMR_DEF_CNT_L;                     /**< Default ns timer counter low register, offset: 0x30 */
  __I  uint32_t TMR_DEF_CNT_H;                     /**< Default ns timer counter high register, offset: 0x34 */
       uint8_t RESERVED_2[72];
  __IO uint32_t TMR_CTRL;                          /**< Timer Control Register, offset: 0x80 */
  __IO uint32_t TMR_TEVENT;                        /**< Timer Event Register, offset: 0x84 */
  __IO uint32_t TMR_TEMASK;                        /**< Timer event mask register, offset: 0x88 */
       uint8_t RESERVED_3[8];
  __I  uint32_t TMR_STAT;                          /**< Timer status register, offset: 0x94 */
  __IO uint32_t TMR_CNT_L;                         /**< Timer counter low register, offset: 0x98 */
  __IO uint32_t TMR_CNT_H;                         /**< Timer counter high register, offset: 0x9C */
  __IO uint32_t TMR_ADD;                           /**< Timer addend register, offset: 0xA0 */
  __I  uint32_t TMR_ACC;                           /**< Timer accumulator register, offset: 0xA4 */
  __IO uint32_t TMR_PRSC;                          /**< Timer prescale register, offset: 0xA8 */
  __IO uint32_t TMR_ECTRL;                         /**< Extended timer control register, offset: 0xAC */
  __IO uint32_t TMROFF_L;                          /**< Timer offset low register, offset: 0xB0 */
  __IO uint32_t TMROFF_H;                          /**< Timer offset high register, offset: 0xB4 */
  __IO uint32_t TMR_ALARM1_L;                      /**< Alarm 1 time comparator low register, offset: 0xB8 */
  __IO uint32_t TMR_ALARM1_H;                      /**< Alarm 1 time comparator high register, offset: 0xBC */
  __IO uint32_t TMR_ALARM2_L;                      /**< Alarm 2 time comparator low register, offset: 0xC0 */
  __IO uint32_t TMR_ALARM2_H;                      /**< Alarm 2 time comparator high register, offset: 0xC4 */
       uint8_t RESERVED_4[4];
  __IO uint32_t TMR_ALARM_CTRL;                    /**< Timer Alarm Control Register, offset: 0xCC */
  __IO uint32_t TMR_FIPER[3];                      /**< Timer 1 fixed interval period register..Timer 3 fixed interval period register, array offset: 0xD0, array step: 0x4 */
  __IO uint32_t TMR_FIPER_CTRL;                    /**< Timer FIPER Control Register, offset: 0xDC */
  __I  uint32_t TMR_ETTS1_L;                       /**< External trigger stamp register, offset: 0xE0 */
  __I  uint32_t TMR_ETTS1_H;                       /**< External trigger stamp register, offset: 0xE4 */
  __I  uint32_t TMR_ETTS2_L;                       /**< External trigger stamp register, offset: 0xE8 */
  __I  uint32_t TMR_ETTS2_H;                       /**< External trigger stamp register, offset: 0xEC */
  __I  uint32_t TMR_CUR_TIME_L;                    /**< Timer current time low register, offset: 0xF0 */
  __I  uint32_t TMR_CUR_TIME_H;                    /**< Timer current time high register, offset: 0xF4 */
  __IO uint32_t TMR_PARAM;                         /**< Timer parameter register, offset: 0xF8 */
} ENETC_PF_TMR_Type;

/* ----------------------------------------------------------------------------
   -- ENETC_PF_TMR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_PF_TMR_Register_Masks ENETC_PF_TMR Register Masks
 * @{
 */

/*! @name TMR_ID - Module ID Register */
/*! @{ */

#define ENETC_PF_TMR_TMR_ID_REV_MN_MASK          (0xFFU)
#define ENETC_PF_TMR_TMR_ID_REV_MN_SHIFT         (0U)
/*! REV_MN - Minor revision */
#define ENETC_PF_TMR_TMR_ID_REV_MN(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ID_REV_MN_SHIFT)) & ENETC_PF_TMR_TMR_ID_REV_MN_MASK)

#define ENETC_PF_TMR_TMR_ID_REV_MJ_MASK          (0xFF00U)
#define ENETC_PF_TMR_TMR_ID_REV_MJ_SHIFT         (8U)
/*! REV_MJ - Major revision */
#define ENETC_PF_TMR_TMR_ID_REV_MJ(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ID_REV_MJ_SHIFT)) & ENETC_PF_TMR_TMR_ID_REV_MJ_MASK)

#define ENETC_PF_TMR_TMR_ID_TMR_ID_MASK          (0xFFFF0000U)
#define ENETC_PF_TMR_TMR_ID_TMR_ID_SHIFT         (16U)
/*! TMR_ID - Timer IP ID */
#define ENETC_PF_TMR_TMR_ID_TMR_ID(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_ID_TMR_ID_SHIFT)) & ENETC_PF_TMR_TMR_ID_TMR_ID_MASK)
/*! @} */

/*! @name TMR_CAPR - Timer Capability Register */
/*! @{ */

