JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name TMR_PARAM - Timer parameter register */
/*! @{ */

#define ENETC_PF_TMR_TMR_PARAM_SYNC_MASK         (0x1U)
#define ENETC_PF_TMR_TMR_PARAM_SYNC_SHIFT        (0U)
/*! SYNC - Timer synchronization */
#define ENETC_PF_TMR_TMR_PARAM_SYNC(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_PARAM_SYNC_SHIFT)) & ENETC_PF_TMR_TMR_PARAM_SYNC_MASK)

#define ENETC_PF_TMR_TMR_PARAM_PARAM_VAL_MASK    (0xFFFFFFFEU)
#define ENETC_PF_TMR_TMR_PARAM_PARAM_VAL_SHIFT   (1U)
/*! PARAM_VAL - User specific parameter values */
#define ENETC_PF_TMR_TMR_PARAM_PARAM_VAL(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_PARAM_PARAM_VAL_SHIFT)) & ENETC_PF_TMR_TMR_PARAM_PARAM_VAL_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ENETC_PF_TMR_Register_Masks */


/* ENETC_PF_TMR - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral TMR0_BASE base address */
  #define TMR0_BASE_BASE                           (0x70B80000u)
  /** Peripheral TMR0_BASE base address */
  #define TMR0_BASE_BASE_NS                        (0x60B80000u)
  /** Peripheral TMR0_BASE base pointer */
  #define TMR0_BASE                                ((ENETC_PF_TMR_Type *)TMR0_BASE_BASE)
  /** Peripheral TMR0_BASE base pointer */
  #define TMR0_BASE_NS                             ((ENETC_PF_TMR_Type *)TMR0_BASE_BASE_NS)
  /** Array initializer of ENETC_PF_TMR peripheral base addresses */
  #define ENETC_PF_TMR_BASE_ADDRS                  { TMR0_BASE_BASE }
  /** Array initializer of ENETC_PF_TMR peripheral base pointers */
  #define ENETC_PF_TMR_BASE_PTRS                   { TMR0_BASE }
  /** Array initializer of ENETC_PF_TMR peripheral base addresses */
  #define ENETC_PF_TMR_BASE_ADDRS_NS               { TMR0_BASE_BASE_NS }
  /** Array initializer of ENETC_PF_TMR peripheral base pointers */
  #define ENETC_PF_TMR_BASE_PTRS_NS                { TMR0_BASE_NS }
#else
  /** Peripheral TMR0_BASE base address */
  #define TMR0_BASE_BASE                           (0x60B80000u)
  /** Peripheral TMR0_BASE base pointer */
  #define TMR0_BASE                                ((ENETC_PF_TMR_Type *)TMR0_BASE_BASE)
  /** Array initializer of ENETC_PF_TMR peripheral base addresses */
  #define ENETC_PF_TMR_BASE_ADDRS                  { TMR0_BASE_BASE }
  /** Array initializer of ENETC_PF_TMR peripheral base pointers */
  #define ENETC_PF_TMR_BASE_PTRS                   { TMR0_BASE }
#endif

/*!
 * @}
 */ /* end of group ENETC_PF_TMR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- ENETC_SI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_SI_Peripheral_Access_Layer ENETC_SI Peripheral Access Layer
 * @{
 */

/** ENETC_SI - Register Layout Typedef */
typedef struct {
  __IO uint32_t SIMR;                              /**< Station interface mode register, offset: 0x0 */
  __I  uint32_t SISR;                              /**< Station interface status register, offset: 0x4 */
       uint8_t RESERVED_0[16];
  __I  uint32_t SICTR[2];                          /**< Station interface current time register 0..Station interface current time register 1, array offset: 0x18, array step: 0x4 */
  __I  uint32_t SIPCAPR0;                          /**< Station interface port capability register 0, offset: 0x20 */
  __I  uint32_t SIPCAPR1;                          /**< Station interface port capability register 1, offset: 0x24 */
       uint8_t RESERVED_1[8];
  __I  uint32_t SITSR;                             /**< Station interface timer status register, offset: 0x30, available only on: ENETC0_SI0, ENETC1_SI0 (missing on ENETC1_SI1) */
       uint8_t RESERVED_2[4];
  __IO uint32_t SIRBGCR;                           /**< Station interface receive BDR group control register, offset: 0x38 */
       uint8_t RESERVED_3[4];
  __IO uint32_t SIBCAR;                            /**< Station interface buffer cache attribute register, offset: 0x40 */
  __IO uint32_t SIMCAR;                            /**< Station interface message cache attribute register, offset: 0x44, available only on: ENETC1_SI0 (missing on ENETC0_SI0, ENETC1_SI1) */
  __IO uint32_t SICCAR;                            /**< Station interface command cache attribute register, offset: 0x48 */
       uint8_t RESERVED_4[52];
  __I  uint32_t SIPMAR0;                           /**< Station interface primary MAC address register 0, offset: 0x80 */
  __I  uint32_t SIPMAR1;                           /**< Station interface primary MAC address register 1, offset: 0x84 */
       uint8_t RESERVED_5[8];
  __I  uint32_t SICVLANR1;                         /**< Station interface custom VLAN register 1, offset: 0x90 */
  __I  uint32_t SICVLANR2;                         /**< Station interface custom VLAN register 2, offset: 0x94 */
       uint8_t RESERVED_6[104];
  __IO uint32_t SIVLANIPVMR0;                      /**< Station interface VLAN to IPV mapping register 0, offset: 0x100 */
  __IO uint32_t SIVLANIPVMR1;                      /**< Station interface VLAN to IPV mapping register 1, offset: 0x104 */
       uint8_t RESERVED_7[72];
  __IO uint32_t SIIPVBDRMR0;                       /**< Station interface IPV to ring mapping register, offset: 0x150 */
       uint8_t RESERVED_8[176];
  union {                                          /* offset: 0x204 */
    struct {                                         /* offset: 0x204 */
      __IO uint32_t PSIMSGRR;                          /**< Physical station interface message receive register, offset: 0x204, available only on: ENETC1_SI0 (missing on ENETC0_SI0, ENETC1_SI1) */
      __IO uint32_t PSIMSGSR;                          /**< Physical station interface message send register, offset: 0x208, available only on: ENETC1_SI0 (missing on ENETC0_SI0, ENETC1_SI1) */
           uint8_t RESERVED_0[4];
      struct {                                         /* offset: 0x210, array step: 0x8 */
        __IO uint32_t PSIVMSGRCVAR0;                     /**< PSI VSI 1 message receive address register 0, array offset: 0x210, array step: 0x8, available only on: ENETC1_SI0 (missing on ENETC0_SI0, ENETC1_SI1) */
        __IO uint32_t PSIVMSGRCVAR1;                     /**< PSI VSI 1 message receive address register 1, array offset: 0x214, array step: 0x8, available only on: ENETC1_SI0 (missing on ENETC0_SI0, ENETC1_SI1) */
      } VSI_NUM[1];
    } PSI_A;
    struct {                                         /* offset: 0x204 */
      __I  uint32_t VSIMSGSR;                          /**< Virtual station interface message send register, offset: 0x204, available only on: ENETC1_SI1 (missing on ENETC0_SI0, ENETC1_SI0) */
      __I  uint32_t VSIMSGRR;                          /**< Virtual station interface message receive register, offset: 0x208, available only on: ENETC1_SI1 (missing on ENETC0_SI0, ENETC1_SI0) */
           uint8_t RESERVED_0[4];
      __IO uint32_t VSIMSGSNDAR0;                      /**< Virtual station interface message send register 0, offset: 0x210, available only on: ENETC1_SI1 (missing on ENETC0_SI0, ENETC1_SI0) */
      __IO uint32_t VSIMSGSNDAR1;                      /**< Virtual station interface message send address register 1, offset: 0x214, available only on: ENETC1_SI1 (missing on ENETC0_SI0, ENETC1_SI0) */
    } VSI_A;
  };
       uint8_t RESERVED_9[232];
  __I  uint32_t SIROCT0;                           /**< Station interface receive octets counter (ifInOctets) 0, offset: 0x300 */
  __I  uint32_t SIROCT1;                           /**< Station interface receive octets counter (ifInOctets) 1, offset: 0x304 */
  __I  uint32_t SIRFRM0;                           /**< Station interface receive frame counter (aFrameReceivedOK) 0, offset: 0x308 */
  __I  uint32_t SIRFRM1;                           /**< Station interface receive frame counter (aFrameReceivedOK) 1, offset: 0x30C */
  __I  uint32_t SIRUCA0;                           /**< Station interface receive unicast frame counter (ifInUcastPkts) 0, offset: 0x310 */
  __I  uint32_t SIRUCA1;                           /**< Station interface receive unicast frame counter (ifInUcastPkts) 1, offset: 0x314 */
  __I  uint32_t SIRMCA0;                           /**< Station interface receive multicast frame counter (ifInMulticastPkts) 0, offset: 0x318 */
  __I  uint32_t SIRMCA1;                           /**< Station interface receive multicast frame counter (ifInMulticastPkts) 1, offset: 0x31C */
  __I  uint32_t SITOCT0;                           /**< Station interface transmit octets counter (ifOutOctets) 0, offset: 0x320 */
  __I  uint32_t SITOCT1;                           /**< Station interface transmit octets counter (ifOutOctets) 1, offset: 0x324 */
  __I  uint32_t SITFRM0;                           /**< Station interface transmit frame counter (aFrameTransmittedOK) 0, offset: 0x328 */
  __I  uint32_t SITFRM1;                           /**< Station interface transmit frame counter (aFrameTransmittedOK) 1, offset: 0x32C */
  __I  uint32_t SITUCA0;                           /**< Station interface transmit unicast frame counter (ifOutUcastPkts) 0, offset: 0x330 */
  __I  uint32_t SITUCA1;                           /**< Station interface transmit unicast frame counter (ifOutUcastPkts) 1, offset: 0x334 */
  __I  uint32_t SITMCA0;                           /**< Station interface transmit multicast frame counter (ifOutMulticastPkts) 0, offset: 0x338 */
  __I  uint32_t SITMCA1;                           /**< Station interface transmit multicast frame counter (ifOutMulticastPkts) 1, offset: 0x33C */
       uint8_t RESERVED_10[176];
  __I  uint32_t SIBLPR[2];                         /**< Station interface boot loader parameter register 0..Station interface boot loader parameter register 1, array offset: 0x3F0, array step: 0x4, available only on: ENETC1_SI1 (missing on ENETC0_SI0, ENETC1_SI0) */
       uint8_t RESERVED_11[1032];
  __IO uint32_t SICBDRMR;                          /**< Station interface command BDR mode register, offset: 0x800 */
  __I  uint32_t SICBDRSR;                          /**< Station interface command BDR status register, offset: 0x804 */
       uint8_t RESERVED_12[8];
  __IO uint32_t SICBDRBAR0;                        /**< Station interface command BDR base address register 0, offset: 0x810 */
  __IO uint32_t SICBDRBAR1;                        /**< Station interface command BDR base address register 1, offset: 0x814 */
  __IO uint32_t SICBDRPIR;                         /**< Station interface command BDR producer index register, offset: 0x818 */
  __IO uint32_t SICBDRCIR;                         /**< Station interface command BDR consumer index register, offset: 0x81C */
  __IO uint32_t SICBDRLENR;                        /**< Station interface command BDR length register, offset: 0x820 */
       uint8_t RESERVED_13[124];
  __IO uint32_t SICBDRIER;                         /**< Station interface command BDR interrupt enable register, offset: 0x8A0 */
  __IO uint32_t SICBDRIDR;                         /**< Station interface command BDR interrupt detect register, offset: 0x8A4 */
       uint8_t RESERVED_14[88];
  __I  uint32_t SICAPR0;                           /**< Station interface capability register 0, offset: 0x900 */
  __I  uint32_t SICAPR1;                           /**< Station interface capability register 1, offset: 0x904 */
  __I  uint32_t SICAPR2;                           /**< Station interface capability register 2, offset: 0x908 */
       uint8_t RESERVED_15[244];
  union {                                          /* offset: 0xA00 */
    struct {                                         /* offset: 0xA00 */
      __IO uint32_t PSIIER;                            /**< Physical station interface interrupt enable register, offset: 0xA00, available only on: ENETC1_SI0 (missing on ENETC0_SI0, ENETC1_SI1) */
           uint8_t RESERVED_0[4];
      __IO uint32_t PSIIDR;                            /**< Physical station interface interrupt detect register, offset: 0xA08, available only on: ENETC1_SI0 (missing on ENETC0_SI0, ENETC1_SI1) */
    } PSI;
    struct {                                         /* offset: 0xA00 */
      __IO uint32_t VSIIER;                            /**< Virtual station interface interrupt enable register, offset: 0xA00, available only on: ENETC1_SI1 (missing on ENETC0_SI0, ENETC1_SI0) */
           uint8_t RESERVED_0[4];
      __IO uint32_t VSIIDR;                            /**< Virtual station interface interrupt detect register, offset: 0xA08, available only on: ENETC1_SI1 (missing on ENETC0_SI0, ENETC1_SI0) */
    } VSI;
  };
       uint8_t RESERVED_16[12];
  __IO uint32_t SITXIDR0;                          /**< Station interface transmit interrupt detect register 0, offset: 0xA18 */
       uint8_t RESERVED_17[12];
  __IO uint32_t SIRXIDR0;                          /**< Station interface receive interrupt detect register 0, offset: 0xA28 */
       uint8_t RESERVED_18[4];
  __IO uint32_t SIMSIVR;                           /**< Station interface MSI-X vector register, offset: 0xA30, available only on: ENETC1_SI0, ENETC1_SI1 (missing on ENETC0_SI0) */
  __IO uint32_t SICMSIVR;                          /**< Station interface command MSI-X vector register, offset: 0xA34 */
       uint8_t RESERVED_19[8];
  __IO uint32_t SITMRIER;                          /**< Station interface timer interrupt enable register, offset: 0xA40 */
  __IO uint32_t SITMRIDR;                          /**< Station interface timer interrupt detect register, offset: 0xA44 */
       uint8_t RESERVED_20[4];
  __IO uint32_t SITMRMSIVR;                        /**< Station interface timer MSI-X vector register, offset: 0xA4C */
       uint8_t RESERVED_21[176];
  __IO uint32_t SIMSITRVR[10];                     /**< Station interface MSI-X transmit ring 0 vector register..Station interface MSI-X transmit ring 9 vector register, array offset: 0xB00, array step: 0x4, irregular array, not all indices are valid */
       uint8_t RESERVED_22[88];
  __IO uint32_t SIMSIRRVR[10];                     /**< Station interface MSI-X receive ring 0 vector register..Station interface MSI-X receive ring 9 vector register, array offset: 0xB80, array step: 0x4, irregular array, not all indices are valid */
       uint8_t RESERVED_23[600];
  __IO uint32_t SICMECR;                           /**< Station interface correctable memory error configuration register, offset: 0xE00 */
  __IO uint32_t SICMESR;                           /**< Station interface correctable memory error status register, offset: 0xE04 */
       uint8_t RESERVED_24[4];
  __I  uint32_t SICMECTR;                          /**< Station interface correctable memory error count register, offset: 0xE0C */
  __IO uint32_t SIUPECR;                           /**< Station interface uncorrectable programming error configuration register, offset: 0xE10 */
  __IO uint32_t SIUPESR;                           /**< Station interface uncorrectable programming error status register, offset: 0xE14 */
       uint8_t RESERVED_25[4];
  __I  uint32_t SIUPECTR;                          /**< Station interface uncorrectable programming error count register, offset: 0xE1C */
  __IO uint32_t SIUNSBECR;                         /**< Station interface uncorrectable non-fatal system bus error configuration register, offset: 0xE20 */
  __IO uint32_t SIUNSBESR;                         /**< Station interface uncorrectable non-fatal system bus error status register, offset: 0xE24 */
       uint8_t RESERVED_26[4];
  __I  uint32_t SIUNSBECTR;                        /**< Station interface uncorrectable non-fatal system bus error count register, offset: 0xE2C */
  __IO uint32_t SIUFSBECR;                         /**< Station interface uncorrectable fatal system bus error configuration register, offset: 0xE30 */
  __IO uint32_t SIUFSBESR;                         /**< Station interface uncorrectable fatal system bus error status register, offset: 0xE34 */
       uint8_t RESERVED_27[8];
  __IO uint32_t SIUNMECR;                          /**< Station interface uncorrectable non-fatal memory error configuration register, offset: 0xE40 */
  __IO uint32_t SIUNMESR0;                         /**< Station interface uncorrectable non-fatal memory error status register 0, offset: 0xE44 */
  __I  uint32_t SIUNMESR1;                         /**< Station interface uncorrectable non-fatal memory error status register 1, offset: 0xE48 */
  __I  uint32_t SIUNMECTR;                         /**< Station interface uncorrectable non-fatal memory error count register, offset: 0xE4C */
  __IO uint32_t SIUFMECR;                          /**< Station interface uncorrectable fatal memory error configuration register, offset: 0xE50 */
  __IO uint32_t SIUFMESR0;                         /**< Station interface uncorrectable fatal memory error status register 0, offset: 0xE54 */
  __I  uint32_t SIUFMESR1;                         /**< Station interface uncorrectable fatal memory error status register 1, offset: 0xE58 */
       uint8_t RESERVED_28[420];
  __I  uint32_t SIMAFTCAPR;                        /**< Station interface MAC address filter table capability register, offset: 0x1000 */
       uint8_t RESERVED_29[252];
  __I  uint32_t SIVFTCAPR;                         /**< Station interface VLAN filter table capability register, offset: 0x1100 */
       uint8_t RESERVED_30[28412];
  struct {                                         /* offset: 0x8000, array step: 0x200 */
    __IO uint32_t TBMR;                              /**< Tx BDR 0 mode register..Tx BDR 9 mode register, array offset: 0x8000, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t TBSR;                              /**< Tx BDR 0 status register..Tx BDR 9 status register, array offset: 0x8004, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_0[8];
    __IO uint32_t TBBAR0;                            /**< Tx BDR 0 base address register 0..Tx BDR 9 base address register 0, array offset: 0x8010, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t TBBAR1;                            /**< Tx BDR 0 base address register 1..Tx BDR 9 base address register 1, array offset: 0x8014, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t TBPIR;                             /**< Tx BDR 0 producer index register..Tx BDR 9 producer index register, array offset: 0x8018, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t TBCIR;                             /**< Tx BDR 0 consumer index register..Tx BDR 9 consumer index register, array offset: 0x801C, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t TBLENR;                            /**< Tx BDR 0 length register..Tx BDR 9 length register, array offset: 0x8020, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_1[124];
    __IO uint32_t TBIER;                             /**< Tx BDR 0 interrupt enable register..Tx BDR 9 interrupt enable register, array offset: 0x80A0, array step: 0x200, irregular array, not all indices are valid */
    __I  uint32_t TBIDR;                             /**< Tx BDR 0 interrupt detect register..Tx BDR 9 interrupt detect register, array offset: 0x80A4, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t TBICR0;                            /**< Tx BDR 0 interrupt coalescing register 0..Tx BDR 9 interrupt coalescing register 0, array offset: 0x80A8, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t TBICR1;                            /**< Tx BDR 0 interrupt coalescing register 1..Tx BDR 9 interrupt coalescing register 1, array offset: 0x80AC, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_2[80];
    __IO uint32_t RBMR;                              /**< Rx BDR 0 mode register..Rx BDR 9 mode register, array offset: 0x8100, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBSR;                              /**< Rx BDR 0 status register..Rx BDR 9 status register, array offset: 0x8104, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBBSR;                             /**< Rx BDR 0 buffer size register..Rx BDR 9 buffer size register, array offset: 0x8108, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBCIR;                             /**< Rx BDR 0 consumer index register..Rx BDR 9 consumer index register, array offset: 0x810C, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBBAR0;                            /**< Rx BDR 0 base address register 0..Rx BDR 9 base address register 0, array offset: 0x8110, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBBAR1;                            /**< Rx BDR 0 base address register 1..Rx BDR 9 base address register 1, array offset: 0x8114, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBPIR;                             /**< Rx BDR 0 producer index register..Rx BDR 9 producer index register, array offset: 0x8118, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_3[4];
    __IO uint32_t RBLENR;                            /**< Rx BDR 0 length register..Rx BDR 9 length register, array offset: 0x8120, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_4[92];
    __I  uint32_t RBDCR;                             /**< Rx BDR 0 drop count register..Rx BDR 9 drop count register, array offset: 0x8180, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_5[28];
    __IO uint32_t RBIER;                             /**< Rx BDR 0 interrupt enable register..Rx BDR 9 interrupt enable register, array offset: 0x81A0, array step: 0x200, irregular array, not all indices are valid */
    __I  uint32_t RBIDR;                             /**< Rx BDR 0 interrupt detect register..Rx BDR 9 interrupt detect register, array offset: 0x81A4, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBICR0;                            /**< Rx BDR 0 interrupt coalescing register 0..Rx BDR 9 interrupt coalescing register 0, array offset: 0x81A8, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBICR1;                            /**< Rx BDR 0 interrupt coalescing register 1..Rx BDR 9 interrupt coalescing register 1, array offset: 0x81AC, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_6[80];
  } BDR[10];
} ENETC_SI_Type;

/* ----------------------------------------------------------------------------
   -- ENETC_SI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_SI_Register_Masks ENETC_SI Register Masks
 * @{
 */

/*! @name SIMR - Station interface mode register */
/*! @{ */

#define ENETC_SI_SIMR_RSSE_MASK                  (0x1U)
#define ENETC_SI_SIMR_RSSE_SHIFT                 (0U)
#define ENETC_SI_SIMR_RSSE(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_RSSE_SHIFT)) & ENETC_SI_SIMR_RSSE_MASK)

