JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define ENETC_SI_SIMR_RNUM_MASK                  (0x2U)
#define ENETC_SI_SIMR_RNUM_SHIFT                 (1U)
#define ENETC_SI_SIMR_RNUM(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_RNUM_SHIFT)) & ENETC_SI_SIMR_RNUM_MASK)

#define ENETC_SI_SIMR_RNMM_MASK                  (0x4U)
#define ENETC_SI_SIMR_RNMM_SHIFT                 (2U)
#define ENETC_SI_SIMR_RNMM(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_RNMM_SHIFT)) & ENETC_SI_SIMR_RNMM_MASK)

#define ENETC_SI_SIMR_RNBM_MASK                  (0x8U)
#define ENETC_SI_SIMR_RNBM_SHIFT                 (3U)
#define ENETC_SI_SIMR_RNBM(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_RNBM_SHIFT)) & ENETC_SI_SIMR_RNBM_MASK)

#define ENETC_SI_SIMR_V2IPVE_MASK                (0x10U)
#define ENETC_SI_SIMR_V2IPVE_SHIFT               (4U)
#define ENETC_SI_SIMR_V2IPVE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_V2IPVE_SHIFT)) & ENETC_SI_SIMR_V2IPVE_MASK)

#define ENETC_SI_SIMR_DEFAULT_RX_GROUP_MASK      (0x10000U)
#define ENETC_SI_SIMR_DEFAULT_RX_GROUP_SHIFT     (16U)
#define ENETC_SI_SIMR_DEFAULT_RX_GROUP(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_DEFAULT_RX_GROUP_SHIFT)) & ENETC_SI_SIMR_DEFAULT_RX_GROUP_MASK)

#define ENETC_SI_SIMR_EN_MASK                    (0x80000000U)
#define ENETC_SI_SIMR_EN_SHIFT                   (31U)
#define ENETC_SI_SIMR_EN(x)                      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_EN_SHIFT)) & ENETC_SI_SIMR_EN_MASK)
/*! @} */

/*! @name SISR - Station interface status register */
/*! @{ */

#define ENETC_SI_SISR_TX_BUSY_MASK               (0x1U)
#define ENETC_SI_SISR_TX_BUSY_SHIFT              (0U)
#define ENETC_SI_SISR_TX_BUSY(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SISR_TX_BUSY_SHIFT)) & ENETC_SI_SISR_TX_BUSY_MASK)

#define ENETC_SI_SISR_MAC_UP_MASK                (0x2U)
#define ENETC_SI_SISR_MAC_UP_SHIFT               (1U)
#define ENETC_SI_SISR_MAC_UP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SISR_MAC_UP_SHIFT)) & ENETC_SI_SISR_MAC_UP_MASK)

#define ENETC_SI_SISR_MAC_MP_MASK                (0x4U)
#define ENETC_SI_SISR_MAC_MP_SHIFT               (2U)
#define ENETC_SI_SISR_MAC_MP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SISR_MAC_MP_SHIFT)) & ENETC_SI_SISR_MAC_MP_MASK)

#define ENETC_SI_SISR_VLAN_P_MASK                (0x8U)
#define ENETC_SI_SISR_VLAN_P_SHIFT               (3U)
#define ENETC_SI_SISR_VLAN_P(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SISR_VLAN_P_SHIFT)) & ENETC_SI_SISR_VLAN_P_MASK)

#define ENETC_SI_SISR_VLAN_UTA_MASK              (0x10U)
#define ENETC_SI_SISR_VLAN_UTA_SHIFT             (4U)
#define ENETC_SI_SISR_VLAN_UTA(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SISR_VLAN_UTA_SHIFT)) & ENETC_SI_SISR_VLAN_UTA_MASK)
/*! @} */

/*! @name SICTR - Station interface current time register 0..Station interface current time register 1 */
/*! @{ */

#define ENETC_SI_SICTR_CURR_TIME_MASK            (0xFFFFFFFFU)
#define ENETC_SI_SICTR_CURR_TIME_SHIFT           (0U)
#define ENETC_SI_SICTR_CURR_TIME(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICTR_CURR_TIME_SHIFT)) & ENETC_SI_SICTR_CURR_TIME_MASK)
/*! @} */

/* The count of ENETC_SI_SICTR */
#define ENETC_SI_SICTR_COUNT                     (2U)

/*! @name SIPCAPR0 - Station interface port capability register 0 */
/*! @{ */

#define ENETC_SI_SIPCAPR0_RFS_MASK               (0x4U)
#define ENETC_SI_SIPCAPR0_RFS_SHIFT              (2U)
/*! RFS - Receive Flow Steering
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_RFS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_RFS_SHIFT)) & ENETC_SI_SIPCAPR0_RFS_MASK)

#define ENETC_SI_SIPCAPR0_FP_MASK                (0x8U)
#define ENETC_SI_SIPCAPR0_FP_SHIFT               (3U)
/*! FP - Frame Preemption
 *  0b0..Not Supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_FP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_FP_SHIFT)) & ENETC_SI_SIPCAPR0_FP_MASK)

#define ENETC_SI_SIPCAPR0_TGS_MASK               (0x10U)
#define ENETC_SI_SIPCAPR0_TGS_SHIFT              (4U)
/*! TGS - Time Gate Scheduling
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_TGS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_TGS_SHIFT)) & ENETC_SI_SIPCAPR0_TGS_MASK)

#define ENETC_SI_SIPCAPR0_TSD_MASK               (0x20U)
#define ENETC_SI_SIPCAPR0_TSD_SHIFT              (5U)
/*! TSD - Time Specific Departure
 *  0b0..Not Supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_TSD(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_TSD_SHIFT)) & ENETC_SI_SIPCAPR0_TSD_MASK)

#define ENETC_SI_SIPCAPR0_CBS_MASK               (0x40U)
#define ENETC_SI_SIPCAPR0_CBS_SHIFT              (6U)
/*! CBS - Credit Based Shaping (CBS)
 *  0b0..Not Supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_CBS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_CBS_SHIFT)) & ENETC_SI_SIPCAPR0_CBS_MASK)

#define ENETC_SI_SIPCAPR0_RSS_MASK               (0x100U)
#define ENETC_SI_SIPCAPR0_RSS_SHIFT              (8U)
/*! RSS - Receive Side Scaling
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_RSS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_RSS_SHIFT)) & ENETC_SI_SIPCAPR0_RSS_MASK)

#define ENETC_SI_SIPCAPR0_PSFP_MASK              (0x200U)
#define ENETC_SI_SIPCAPR0_PSFP_SHIFT             (9U)
/*! PSFP - Per-Stream Filtering and Policing (IEEE 802.1Qci)
 *  0b0..Not Supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_PSFP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_PSFP_SHIFT)) & ENETC_SI_SIPCAPR0_PSFP_MASK)

#define ENETC_SI_SIPCAPR0_IPFLT_MASK             (0x400U)
#define ENETC_SI_SIPCAPR0_IPFLT_SHIFT            (10U)
/*! IPFLT - Ingress Port Filtering
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_IPFLT(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_IPFLT_SHIFT)) & ENETC_SI_SIPCAPR0_IPFLT_MASK)

#define ENETC_SI_SIPCAPR0_RP_MASK                (0x800U)
#define ENETC_SI_SIPCAPR0_RP_SHIFT               (11U)
/*! RP - Rate Policing
 *  0b0..Not Supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_RP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_RP_SHIFT)) & ENETC_SI_SIPCAPR0_RP_MASK)

#define ENETC_SI_SIPCAPR0_WO_MASK                (0x2000U)
#define ENETC_SI_SIPCAPR0_WO_SHIFT               (13U)
/*! WO - Wake-on-LAN
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_WO(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_WO_SHIFT)) & ENETC_SI_SIPCAPR0_WO_MASK)

#define ENETC_SI_SIPCAPR0_FS_MASK                (0x10000U)
#define ENETC_SI_SIPCAPR0_FS_SHIFT               (16U)
/*! FS - Functional Safety
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_FS(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_FS_SHIFT)) & ENETC_SI_SIPCAPR0_FS_MASK)
/*! @} */

/*! @name SIPCAPR1 - Station interface port capability register 1 */
/*! @{ */

