JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name SIRFRM1 - Station interface receive frame counter (aFrameReceivedOK) 1 */
/*! @{ */

#define ENETC_SI_SIRFRM1_RFRM_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SIRFRM1_RFRM_HIGH_SHIFT         (0U)
#define ENETC_SI_SIRFRM1_RFRM_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRFRM1_RFRM_HIGH_SHIFT)) & ENETC_SI_SIRFRM1_RFRM_HIGH_MASK)
/*! @} */

/*! @name SIRUCA0 - Station interface receive unicast frame counter (ifInUcastPkts) 0 */
/*! @{ */

#define ENETC_SI_SIRUCA0_RUCA_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SIRUCA0_RUCA_LOW_SHIFT          (0U)
#define ENETC_SI_SIRUCA0_RUCA_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRUCA0_RUCA_LOW_SHIFT)) & ENETC_SI_SIRUCA0_RUCA_LOW_MASK)
/*! @} */

/*! @name SIRUCA1 - Station interface receive unicast frame counter (ifInUcastPkts) 1 */
/*! @{ */

#define ENETC_SI_SIRUCA1_RUCA_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SIRUCA1_RUCA_HIGH_SHIFT         (0U)
#define ENETC_SI_SIRUCA1_RUCA_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRUCA1_RUCA_HIGH_SHIFT)) & ENETC_SI_SIRUCA1_RUCA_HIGH_MASK)
/*! @} */

/*! @name SIRMCA0 - Station interface receive multicast frame counter (ifInMulticastPkts) 0 */
/*! @{ */

#define ENETC_SI_SIRMCA0_RMCA_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SIRMCA0_RMCA_LOW_SHIFT          (0U)
#define ENETC_SI_SIRMCA0_RMCA_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRMCA0_RMCA_LOW_SHIFT)) & ENETC_SI_SIRMCA0_RMCA_LOW_MASK)
/*! @} */

/*! @name SIRMCA1 - Station interface receive multicast frame counter (ifInMulticastPkts) 1 */
/*! @{ */

#define ENETC_SI_SIRMCA1_RMCA_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SIRMCA1_RMCA_HIGH_SHIFT         (0U)
#define ENETC_SI_SIRMCA1_RMCA_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRMCA1_RMCA_HIGH_SHIFT)) & ENETC_SI_SIRMCA1_RMCA_HIGH_MASK)
/*! @} */

/*! @name SITOCT0 - Station interface transmit octets counter (ifOutOctets) 0 */
/*! @{ */

#define ENETC_SI_SITOCT0_TOCT_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SITOCT0_TOCT_LOW_SHIFT          (0U)
#define ENETC_SI_SITOCT0_TOCT_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITOCT0_TOCT_LOW_SHIFT)) & ENETC_SI_SITOCT0_TOCT_LOW_MASK)
/*! @} */

/*! @name SITOCT1 - Station interface transmit octets counter (ifOutOctets) 1 */
/*! @{ */

#define ENETC_SI_SITOCT1_TOCT_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SITOCT1_TOCT_HIGH_SHIFT         (0U)
#define ENETC_SI_SITOCT1_TOCT_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITOCT1_TOCT_HIGH_SHIFT)) & ENETC_SI_SITOCT1_TOCT_HIGH_MASK)
/*! @} */

/*! @name SITFRM0 - Station interface transmit frame counter (aFrameTransmittedOK) 0 */
/*! @{ */

#define ENETC_SI_SITFRM0_TFRM_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SITFRM0_TFRM_LOW_SHIFT          (0U)
#define ENETC_SI_SITFRM0_TFRM_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITFRM0_TFRM_LOW_SHIFT)) & ENETC_SI_SITFRM0_TFRM_LOW_MASK)
/*! @} */

/*! @name SITFRM1 - Station interface transmit frame counter (aFrameTransmittedOK) 1 */
/*! @{ */

#define ENETC_SI_SITFRM1_TFRM_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SITFRM1_TFRM_HIGH_SHIFT         (0U)
#define ENETC_SI_SITFRM1_TFRM_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITFRM1_TFRM_HIGH_SHIFT)) & ENETC_SI_SITFRM1_TFRM_HIGH_MASK)
/*! @} */

/*! @name SITUCA0 - Station interface transmit unicast frame counter (ifOutUcastPkts) 0 */
/*! @{ */

#define ENETC_SI_SITUCA0_TUCA_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SITUCA0_TUCA_LOW_SHIFT          (0U)
#define ENETC_SI_SITUCA0_TUCA_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITUCA0_TUCA_LOW_SHIFT)) & ENETC_SI_SITUCA0_TUCA_LOW_MASK)
/*! @} */

/*! @name SITUCA1 - Station interface transmit unicast frame counter (ifOutUcastPkts) 1 */
/*! @{ */

#define ENETC_SI_SITUCA1_TUCA_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SITUCA1_TUCA_HIGH_SHIFT         (0U)
#define ENETC_SI_SITUCA1_TUCA_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITUCA1_TUCA_HIGH_SHIFT)) & ENETC_SI_SITUCA1_TUCA_HIGH_MASK)
/*! @} */

/*! @name SITMCA0 - Station interface transmit multicast frame counter (ifOutMulticastPkts) 0 */
/*! @{ */

#define ENETC_SI_SITMCA0_TMCA_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SITMCA0_TMCA_LOW_SHIFT          (0U)
#define ENETC_SI_SITMCA0_TMCA_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITMCA0_TMCA_LOW_SHIFT)) & ENETC_SI_SITMCA0_TMCA_LOW_MASK)
/*! @} */

/*! @name SITMCA1 - Station interface transmit multicast frame counter (ifOutMulticastPkts) 1 */
/*! @{ */

#define ENETC_SI_SITMCA1_TMCA_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SITMCA1_TMCA_HIGH_SHIFT         (0U)
#define ENETC_SI_SITMCA1_TMCA_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITMCA1_TMCA_HIGH_SHIFT)) & ENETC_SI_SITMCA1_TMCA_HIGH_MASK)
/*! @} */

/*! @name SIBLPR - Station interface boot loader parameter register 0..Station interface boot loader parameter register 1 */
/*! @{ */

#define ENETC_SI_SIBLPR_PARAM_VAL_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SIBLPR_PARAM_VAL_SHIFT          (0U)
#define ENETC_SI_SIBLPR_PARAM_VAL(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBLPR_PARAM_VAL_SHIFT)) & ENETC_SI_SIBLPR_PARAM_VAL_MASK)
/*! @} */

/* The count of ENETC_SI_SIBLPR */
#define ENETC_SI_SIBLPR_COUNT                    (2U)

/*! @name SICBDRMR - Station interface command BDR mode register */
/*! @{ */

#define ENETC_SI_SICBDRMR_EN_MASK                (0x80000000U)
#define ENETC_SI_SICBDRMR_EN_SHIFT               (31U)
#define ENETC_SI_SICBDRMR_EN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRMR_EN_SHIFT)) & ENETC_SI_SICBDRMR_EN_MASK)
/*! @} */

/*! @name SICBDRSR - Station interface command BDR status register */
/*! @{ */

#define ENETC_SI_SICBDRSR_BUSY_MASK              (0x1U)
#define ENETC_SI_SICBDRSR_BUSY_SHIFT             (0U)
#define ENETC_SI_SICBDRSR_BUSY(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRSR_BUSY_SHIFT)) & ENETC_SI_SICBDRSR_BUSY_MASK)
/*! @} */

/*! @name SICBDRBAR0 - Station interface command BDR base address register 0 */
/*! @{ */

#define ENETC_SI_SICBDRBAR0_ADDRL_MASK           (0xFFFFFF80U)
#define ENETC_SI_SICBDRBAR0_ADDRL_SHIFT          (7U)
#define ENETC_SI_SICBDRBAR0_ADDRL(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRBAR0_ADDRL_SHIFT)) & ENETC_SI_SICBDRBAR0_ADDRL_MASK)
/*! @} */

