JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define ENETC_SI_TBIDR_TXF_MASK                  (0x2U)
#define ENETC_SI_TBIDR_TXF_SHIFT                 (1U)
#define ENETC_SI_TBIDR_TXF(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBIDR_TXF_SHIFT)) & ENETC_SI_TBIDR_TXF_MASK)
/*! @} */

/* The count of ENETC_SI_TBIDR */
#define ENETC_SI_TBIDR_COUNT                     (10U)

/*! @name TBICR0 - Tx BDR 0 interrupt coalescing register 0..Tx BDR 9 interrupt coalescing register 0 */
/*! @{ */

#define ENETC_SI_TBICR0_ICPT_MASK                (0xFU)
#define ENETC_SI_TBICR0_ICPT_SHIFT               (0U)
#define ENETC_SI_TBICR0_ICPT(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBICR0_ICPT_SHIFT)) & ENETC_SI_TBICR0_ICPT_MASK)

#define ENETC_SI_TBICR0_ICEN_MASK                (0x80000000U)
#define ENETC_SI_TBICR0_ICEN_SHIFT               (31U)
#define ENETC_SI_TBICR0_ICEN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBICR0_ICEN_SHIFT)) & ENETC_SI_TBICR0_ICEN_MASK)
/*! @} */

/* The count of ENETC_SI_TBICR0 */
#define ENETC_SI_TBICR0_COUNT                    (10U)

/*! @name TBICR1 - Tx BDR 0 interrupt coalescing register 1..Tx BDR 9 interrupt coalescing register 1 */
/*! @{ */

#define ENETC_SI_TBICR1_ICTT_MASK                (0xFFFFFFFFU)
#define ENETC_SI_TBICR1_ICTT_SHIFT               (0U)
#define ENETC_SI_TBICR1_ICTT(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBICR1_ICTT_SHIFT)) & ENETC_SI_TBICR1_ICTT_MASK)
/*! @} */

/* The count of ENETC_SI_TBICR1 */
#define ENETC_SI_TBICR1_COUNT                    (10U)

/*! @name RBMR - Rx BDR 0 mode register..Rx BDR 9 mode register */
/*! @{ */

#define ENETC_SI_RBMR_AL_MASK                    (0x1U)
#define ENETC_SI_RBMR_AL_SHIFT                   (0U)
#define ENETC_SI_RBMR_AL(x)                      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBMR_AL_SHIFT)) & ENETC_SI_RBMR_AL_MASK)

#define ENETC_SI_RBMR_BDS_MASK                   (0x4U)
#define ENETC_SI_RBMR_BDS_SHIFT                  (2U)
#define ENETC_SI_RBMR_BDS(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBMR_BDS_SHIFT)) & ENETC_SI_RBMR_BDS_MASK)

#define ENETC_SI_RBMR_CM_MASK                    (0x10U)
#define ENETC_SI_RBMR_CM_SHIFT                   (4U)
#define ENETC_SI_RBMR_CM(x)                      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBMR_CM_SHIFT)) & ENETC_SI_RBMR_CM_MASK)

#define ENETC_SI_RBMR_VTE_MASK                   (0x20U)
#define ENETC_SI_RBMR_VTE_SHIFT                  (5U)
#define ENETC_SI_RBMR_VTE(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBMR_VTE_SHIFT)) & ENETC_SI_RBMR_VTE_MASK)

#define ENETC_SI_RBMR_VTPD_MASK                  (0x40U)
#define ENETC_SI_RBMR_VTPD_SHIFT                 (6U)
#define ENETC_SI_RBMR_VTPD(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBMR_VTPD_SHIFT)) & ENETC_SI_RBMR_VTPD_MASK)

#define ENETC_SI_RBMR_CRC_MASK                   (0x100U)
#define ENETC_SI_RBMR_CRC_SHIFT                  (8U)
#define ENETC_SI_RBMR_CRC(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBMR_CRC_SHIFT)) & ENETC_SI_RBMR_CRC_MASK)

#define ENETC_SI_RBMR_EN_MASK                    (0x80000000U)
#define ENETC_SI_RBMR_EN_SHIFT                   (31U)
#define ENETC_SI_RBMR_EN(x)                      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBMR_EN_SHIFT)) & ENETC_SI_RBMR_EN_MASK)
/*! @} */

/* The count of ENETC_SI_RBMR */
#define ENETC_SI_RBMR_COUNT                      (10U)

/*! @name RBSR - Rx BDR 0 status register..Rx BDR 9 status register */
/*! @{ */

#define ENETC_SI_RBSR_EMPTY_MASK                 (0x1U)
#define ENETC_SI_RBSR_EMPTY_SHIFT                (0U)
#define ENETC_SI_RBSR_EMPTY(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBSR_EMPTY_SHIFT)) & ENETC_SI_RBSR_EMPTY_MASK)

#define ENETC_SI_RBSR_SBE_MASK                   (0x10000U)
#define ENETC_SI_RBSR_SBE_SHIFT                  (16U)
#define ENETC_SI_RBSR_SBE(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBSR_SBE_SHIFT)) & ENETC_SI_RBSR_SBE_MASK)
/*! @} */

/* The count of ENETC_SI_RBSR */
#define ENETC_SI_RBSR_COUNT                      (10U)

/*! @name RBBSR - Rx BDR 0 buffer size register..Rx BDR 9 buffer size register */
/*! @{ */

#define ENETC_SI_RBBSR_BSIZE_MASK                (0xFFFFU)
#define ENETC_SI_RBBSR_BSIZE_SHIFT               (0U)
#define ENETC_SI_RBBSR_BSIZE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBBSR_BSIZE_SHIFT)) & ENETC_SI_RBBSR_BSIZE_MASK)
/*! @} */

/* The count of ENETC_SI_RBBSR */
#define ENETC_SI_RBBSR_COUNT                     (10U)

/*! @name RBCIR - Rx BDR 0 consumer index register..Rx BDR 9 consumer index register */
/*! @{ */

#define ENETC_SI_RBCIR_BDR_INDEX_MASK            (0xFFFFU)
#define ENETC_SI_RBCIR_BDR_INDEX_SHIFT           (0U)
#define ENETC_SI_RBCIR_BDR_INDEX(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBCIR_BDR_INDEX_SHIFT)) & ENETC_SI_RBCIR_BDR_INDEX_MASK)
/*! @} */

/* The count of ENETC_SI_RBCIR */
#define ENETC_SI_RBCIR_COUNT                     (10U)

/*! @name RBBAR0 - Rx BDR 0 base address register 0..Rx BDR 9 base address register 0 */
/*! @{ */

#define ENETC_SI_RBBAR0_ADDRL_MASK               (0xFFFFFF80U)
#define ENETC_SI_RBBAR0_ADDRL_SHIFT              (7U)
#define ENETC_SI_RBBAR0_ADDRL(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBBAR0_ADDRL_SHIFT)) & ENETC_SI_RBBAR0_ADDRL_MASK)
/*! @} */

/* The count of ENETC_SI_RBBAR0 */
#define ENETC_SI_RBBAR0_COUNT                    (10U)

/*! @name RBBAR1 - Rx BDR 0 base address register 1..Rx BDR 9 base address register 1 */
/*! @{ */

#define ENETC_SI_RBBAR1_ADDRH_MASK               (0xFFFFFFFFU)
#define ENETC_SI_RBBAR1_ADDRH_SHIFT              (0U)
#define ENETC_SI_RBBAR1_ADDRH(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBBAR1_ADDRH_SHIFT)) & ENETC_SI_RBBAR1_ADDRH_MASK)
/*! @} */

/* The count of ENETC_SI_RBBAR1 */
#define ENETC_SI_RBBAR1_COUNT                    (10U)

/*! @name RBPIR - Rx BDR 0 producer index register..Rx BDR 9 producer index register */
/*! @{ */

#define ENETC_SI_RBPIR_BDR_INDEX_MASK            (0xFFFFU)
#define ENETC_SI_RBPIR_BDR_INDEX_SHIFT           (0U)
#define ENETC_SI_RBPIR_BDR_INDEX(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBPIR_BDR_INDEX_SHIFT)) & ENETC_SI_RBPIR_BDR_INDEX_MASK)
/*! @} */

/* The count of ENETC_SI_RBPIR */
#define ENETC_SI_RBPIR_COUNT                     (10U)

