JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name RBLENR - Rx BDR 0 length register..Rx BDR 9 length register */
/*! @{ */

#define ENETC_SI_RBLENR_LENGTH_MASK              (0x1FFF8U)
#define ENETC_SI_RBLENR_LENGTH_SHIFT             (3U)
#define ENETC_SI_RBLENR_LENGTH(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBLENR_LENGTH_SHIFT)) & ENETC_SI_RBLENR_LENGTH_MASK)
/*! @} */

/* The count of ENETC_SI_RBLENR */
#define ENETC_SI_RBLENR_COUNT                    (10U)

/*! @name RBDCR - Rx BDR 0 drop count register..Rx BDR 9 drop count register */
/*! @{ */

#define ENETC_SI_RBDCR_COUNT_MASK                (0xFFFFFFFFU)
#define ENETC_SI_RBDCR_COUNT_SHIFT               (0U)
#define ENETC_SI_RBDCR_COUNT(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBDCR_COUNT_SHIFT)) & ENETC_SI_RBDCR_COUNT_MASK)
/*! @} */

/* The count of ENETC_SI_RBDCR */
#define ENETC_SI_BDR_RBDCR_COUNT                 (10U)

/*! @name RBIER - Rx BDR 0 interrupt enable register..Rx BDR 9 interrupt enable register */
/*! @{ */

#define ENETC_SI_RBIER_RXTIE_MASK                (0x1U)
#define ENETC_SI_RBIER_RXTIE_SHIFT               (0U)
#define ENETC_SI_RBIER_RXTIE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBIER_RXTIE_SHIFT)) & ENETC_SI_RBIER_RXTIE_MASK)
/*! @} */

/* The count of ENETC_SI_RBIER */
#define ENETC_SI_RBIER_COUNT                     (10U)

/*! @name RBIDR - Rx BDR 0 interrupt detect register..Rx BDR 9 interrupt detect register */
/*! @{ */

#define ENETC_SI_RBIDR_RXT_MASK                  (0x1U)
#define ENETC_SI_RBIDR_RXT_SHIFT                 (0U)
#define ENETC_SI_RBIDR_RXT(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBIDR_RXT_SHIFT)) & ENETC_SI_RBIDR_RXT_MASK)
/*! @} */

/* The count of ENETC_SI_RBIDR */
#define ENETC_SI_RBIDR_COUNT                     (10U)

/*! @name RBICR0 - Rx BDR 0 interrupt coalescing register 0..Rx BDR 9 interrupt coalescing register 0 */
/*! @{ */

#define ENETC_SI_RBICR0_ICPT_MASK                (0x1FFU)
#define ENETC_SI_RBICR0_ICPT_SHIFT               (0U)
#define ENETC_SI_RBICR0_ICPT(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBICR0_ICPT_SHIFT)) & ENETC_SI_RBICR0_ICPT_MASK)

#define ENETC_SI_RBICR0_ICEN_MASK                (0x80000000U)
#define ENETC_SI_RBICR0_ICEN_SHIFT               (31U)
#define ENETC_SI_RBICR0_ICEN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBICR0_ICEN_SHIFT)) & ENETC_SI_RBICR0_ICEN_MASK)
/*! @} */

/* The count of ENETC_SI_RBICR0 */
#define ENETC_SI_RBICR0_COUNT                    (10U)

/*! @name RBICR1 - Rx BDR 0 interrupt coalescing register 1..Rx BDR 9 interrupt coalescing register 1 */
/*! @{ */

#define ENETC_SI_RBICR1_ICTT_MASK                (0xFFFFFFFFU)
#define ENETC_SI_RBICR1_ICTT_SHIFT               (0U)
#define ENETC_SI_RBICR1_ICTT(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBICR1_ICTT_SHIFT)) & ENETC_SI_RBICR1_ICTT_MASK)
/*! @} */

/* The count of ENETC_SI_RBICR1 */
#define ENETC_SI_RBICR1_COUNT                    (10U)


/*!
 * @}
 */ /* end of group ENETC_SI_Register_Masks */


/* ENETC_SI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral ENETC0_SI0 base address */
  #define ENETC0_SI0_BASE                          (0x70B00000u)
  /** Peripheral ENETC0_SI0 base address */
  #define ENETC0_SI0_BASE_NS                       (0x60B00000u)
  /** Peripheral ENETC0_SI0 base pointer */
  #define ENETC0_SI0                               ((ENETC_SI_Type *)ENETC0_SI0_BASE)
  /** Peripheral ENETC0_SI0 base pointer */
  #define ENETC0_SI0_NS                            ((ENETC_SI_Type *)ENETC0_SI0_BASE_NS)
  /** Peripheral ENETC1_SI0 base address */
  #define ENETC1_SI0_BASE                          (0x70B40000u)
  /** Peripheral ENETC1_SI0 base address */
  #define ENETC1_SI0_BASE_NS                       (0x60B40000u)
  /** Peripheral ENETC1_SI0 base pointer */
  #define ENETC1_SI0                               ((ENETC_SI_Type *)ENETC1_SI0_BASE)
  /** Peripheral ENETC1_SI0 base pointer */
  #define ENETC1_SI0_NS                            ((ENETC_SI_Type *)ENETC1_SI0_BASE_NS)
  /** Peripheral ENETC1_SI1 base address */
  #define ENETC1_SI1_BASE                          (0x70C10000u)
  /** Peripheral ENETC1_SI1 base address */
  #define ENETC1_SI1_BASE_NS                       (0x60C10000u)
  /** Peripheral ENETC1_SI1 base pointer */
  #define ENETC1_SI1                               ((ENETC_SI_Type *)ENETC1_SI1_BASE)
  /** Peripheral ENETC1_SI1 base pointer */
  #define ENETC1_SI1_NS                            ((ENETC_SI_Type *)ENETC1_SI1_BASE_NS)
  /** Array initializer of ENETC_SI peripheral base addresses */
  #define ENETC_SI_BASE_ADDRS                      { ENETC0_SI0_BASE, ENETC1_SI0_BASE, ENETC1_SI1_BASE }
  /** Array initializer of ENETC_SI peripheral base pointers */
  #define ENETC_SI_BASE_PTRS                       { ENETC0_SI0, ENETC1_SI0, ENETC1_SI1 }
  /** Array initializer of ENETC_SI peripheral base addresses */
  #define ENETC_SI_BASE_ADDRS_NS                   { ENETC0_SI0_BASE_NS, ENETC1_SI0_BASE_NS, ENETC1_SI1_BASE_NS }
  /** Array initializer of ENETC_SI peripheral base pointers */
  #define ENETC_SI_BASE_PTRS_NS                    { ENETC0_SI0_NS, ENETC1_SI0_NS, ENETC1_SI1_NS }
#else
  /** Peripheral ENETC0_SI0 base address */
  #define ENETC0_SI0_BASE                          (0x60B00000u)
  /** Peripheral ENETC0_SI0 base pointer */
  #define ENETC0_SI0                               ((ENETC_SI_Type *)ENETC0_SI0_BASE)
  /** Peripheral ENETC1_SI0 base address */
  #define ENETC1_SI0_BASE                          (0x60B40000u)
  /** Peripheral ENETC1_SI0 base pointer */
  #define ENETC1_SI0                               ((ENETC_SI_Type *)ENETC1_SI0_BASE)
  /** Peripheral ENETC1_SI1 base address */
  #define ENETC1_SI1_BASE                          (0x60C10000u)
  /** Peripheral ENETC1_SI1 base pointer */
  #define ENETC1_SI1                               ((ENETC_SI_Type *)ENETC1_SI1_BASE)
  /** Array initializer of ENETC_SI peripheral base addresses */
  #define ENETC_SI_BASE_ADDRS                      { ENETC0_SI0_BASE, ENETC1_SI0_BASE, ENETC1_SI1_BASE }
  /** Array initializer of ENETC_SI peripheral base pointers */
  #define ENETC_SI_BASE_PTRS                       { ENETC0_SI0, ENETC1_SI0, ENETC1_SI1 }
#endif

/*!
 * @}
 */ /* end of group ENETC_SI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- ENETC_VF_PCI_TYPE0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_VF_PCI_TYPE0_Peripheral_Access_Layer ENETC_VF_PCI_TYPE0 Peripheral Access Layer
 * @{
 */

/** ENETC_VF_PCI_TYPE0 - Register Layout Typedef */
typedef struct {
  __I  uint32_t PCI_CFH_DID_VID;                   /**< PCI device ID and vendor ID register, offset: 0x0 */
  __IO uint16_t PCI_CFH_CMD;                       /**< PCI command register, offset: 0x4 */
  __I  uint16_t PCI_CFH_STAT;                      /**< PCI status register, offset: 0x6 */
  __I  uint32_t PCI_CFH_REVID_CLASSCODE;           /**< PCI revision ID and classcode register, offset: 0x8 */
  __I  uint8_t PCI_CFH_CL_SIZE;                    /**< PCI cache line size register, offset: 0xC */
  __I  uint8_t PCI_CFH_LAT_TIMER;                  /**< PCI latency timer register, offset: 0xD */
  __I  uint8_t PCI_CFH_HDR_TYPE;                   /**< PCI header type register, offset: 0xE */
  __I  uint8_t PCI_CFH_BIST;                       /**< PCI BIST register, offset: 0xF */
  __I  uint32_t PCI_CFH_BAR0;                      /**< PCI base address register 0, offset: 0x10 */
  __I  uint32_t PCI_CFH_BAR1;                      /**< PCI base address register 1, offset: 0x14 */
  __I  uint32_t PCI_CFH_BAR2;                      /**< PCI base address register 2, offset: 0x18 */
  __I  uint32_t PCI_CFH_BAR3;                      /**< PCI base address register 3, offset: 0x1C */
  __I  uint32_t PCI_CFH_BAR4;                      /**< PCI base address register 4, offset: 0x20 */
  __I  uint32_t PCI_CFH_BAR5;                      /**< PCI base address register 5, offset: 0x24 */
  __I  uint32_t PCI_CFH_CARDBUS_CIS;               /**< PCI cardbus CIS register, offset: 0x28 */
  __I  uint16_t PCI_CFH_SUBSYS_VID;                /**< PCI subsystem vendor ID register, offset: 0x2C */
  __I  uint16_t PCI_CFH_SUBSYS_ID;                 /**< PCI subsystem ID register, offset: 0x2E */
  __I  uint32_t PCI_CFH_EXP_ROM_BA;                /**< PCI expansion ROM base address register, offset: 0x30 */
  __I  uint8_t PCI_CFH_CAP_PTR;                    /**< PCI capabilities pointer register, offset: 0x34 */
       uint8_t RESERVED_0[11];
  __I  uint16_t PCI_CFC_PCIE_CAP_LIST;             /**< PCI PCIe capabilities list register, offset: 0x40 */
  __I  uint16_t PCI_CFC_PCIE_CAP;                  /**< PCI PCIe capabilities register, offset: 0x42 */
  __I  uint32_t PCI_CFC_PCIE_DEV_CAP;              /**< PCI PCIe device capabilities register, offset: 0x44 */
  __IO uint16_t PCI_CFC_PCIE_DEV_CTL;              /**< PCI PCIe device control register, offset: 0x48 */
  __I  uint16_t PCI_CFC_PCIE_DEV_STAT;             /**< PCI PCIe device status register, offset: 0x4A */
       uint8_t RESERVED_1[24];
  __I  uint32_t PCI_CFC_PCIE_DEV_CAP2;             /**< PCI PCIe device capabilities 2 register, offset: 0x64 */
  __I  uint16_t PCI_CFC_PCIE_DEV_CTL2;             /**< PCI PCIe device control 2 register, offset: 0x68 */
       uint8_t RESERVED_2[22];
  __I  uint16_t PCI_CFC_MSIX_CAP_LIST;             /**< PCI MSI-X capabilities list register, offset: 0x80 */
  __IO uint16_t PCI_CFC_MSIX_MSG_CTL;              /**< PCI MSI-X message control register, offset: 0x82 */
  __I  uint32_t PCI_CFC_MSIX_TABLE_OFF_BIR;        /**< PCI MSI-X table offset/BIR register, offset: 0x84 */
  __I  uint32_t PCI_CFC_MSIX_PBA_OFF_BIR;          /**< PCI MSI-X PBA offset/BIR register, offset: 0x88 */
       uint8_t RESERVED_3[116];
  __I  uint32_t PCIE_CFC_AER_EXT_CAP_HDR;          /**< PCIe AER extended capability header, offset: 0x100 */
  __IO uint32_t PCIE_CFC_AER_UCORR_ERR_STAT;       /**< PCIe AER uncorrectable error status register, offset: 0x104 */
  __IO uint32_t PCIE_CFC_AER_UCORR_ERR_MASK;       /**< PCIe AER uncorrectable error mask register, offset: 0x108 */
  __IO uint32_t PCIE_CFC_AER_UCORR_ERR_SEV;        /**< PCIe AER uncorrectable error severity register, offset: 0x10C */
  __IO uint32_t PCIE_CFC_AER_CORR_ERR_STAT;        /**< PCIe AER correctable error status register, offset: 0x110 */
  __IO uint32_t PCIE_CFC_AER_CORR_ERR_MASK;        /**< PCIe AER correctable error mask register, offset: 0x114 */
  __I  uint32_t PCIE_CFC_AER_CAP_CTL;              /**< PCIe AER capabilities and control register, offset: 0x118 */
       uint8_t RESERVED_4[20];
  __I  uint32_t PCIE_CFC_ACS_CAP_HDR;              /**< PCIe ACS capability header, offset: 0x130 */
  __I  uint16_t PCIE_CFC_ACS_CAP;                  /**< PCIe ACS capability register, offset: 0x134 */
  __I  uint16_t PCIE_CFC_ACS_CTL;                  /**< PCIe ACS control register, offset: 0x136 */
       uint8_t RESERVED_5[8];
  __I  uint32_t PCIE_CFC_RTR_CAP_HDR;              /**< PCIe readiness time reporting capability header, offset: 0x140 */
  __I  uint32_t PCIE_CFC_RTR_RTR1;                 /**< PCIe RTR readiness time reporting 1 register, offset: 0x144 */
  __I  uint32_t PCIE_CFC_RTR_RTR2;                 /**< PCIe RTR readiness time reporting 2 register, offset: 0x148 */
} ENETC_VF_PCI_TYPE0_Type;

/* ----------------------------------------------------------------------------
   -- ENETC_VF_PCI_TYPE0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_VF_PCI_TYPE0_Register_Masks ENETC_VF_PCI_TYPE0 Register Masks
 * @{
 */

/*! @name PCI_CFH_DID_VID - PCI device ID and vendor ID register */
/*! @{ */

