JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR1_PF_MEM_MASK (0x8U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR1_PF_MEM_SHIFT (3U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR1_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR1_PF_MEM_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR1_PF_MEM_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR1_ADDR_MASK (0xFFFFFFF0U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR1_ADDR_SHIFT (4U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR1_ADDR(x)  (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR1_ADDR_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR1_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR2 - PCI base address register 2 */
/*! @{ */

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_MASK (0x1U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_SHIFT (0U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_MEM_TYPE_MASK (0x6U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_MEM_TYPE_SHIFT (1U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_MEM_TYPE_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_MEM_TYPE_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_PF_MEM_MASK (0x8U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_PF_MEM_SHIFT (3U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_PF_MEM_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_PF_MEM_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_ADDR_MASK (0xFFFFFFF0U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_ADDR_SHIFT (4U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_ADDR(x)  (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_ADDR_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR2_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR3 - PCI base address register 3 */
/*! @{ */

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_MASK (0x1U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_SHIFT (0U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_MEM_TYPE_MASK (0x6U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_MEM_TYPE_SHIFT (1U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_MEM_TYPE_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_MEM_TYPE_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_PF_MEM_MASK (0x8U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_PF_MEM_SHIFT (3U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_PF_MEM_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_PF_MEM_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_ADDR_MASK (0xFFFFFFF0U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_ADDR_SHIFT (4U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_ADDR(x)  (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_ADDR_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR3_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR4 - PCI base address register 4 */
/*! @{ */

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_MASK (0x1U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_SHIFT (0U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_MEM_TYPE_MASK (0x6U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_MEM_TYPE_SHIFT (1U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_MEM_TYPE_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_MEM_TYPE_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_PF_MEM_MASK (0x8U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_PF_MEM_SHIFT (3U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_PF_MEM_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_PF_MEM_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_ADDR_MASK (0xFFFFFFF0U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_ADDR_SHIFT (4U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_ADDR(x)  (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_ADDR_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR4_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR5 - PCI base address register 5 */
/*! @{ */

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_MASK (0x1U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_SHIFT (0U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_MEM_TYPE_MASK (0x6U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_MEM_TYPE_SHIFT (1U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_MEM_TYPE_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_MEM_TYPE_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_PF_MEM_MASK (0x8U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_PF_MEM_SHIFT (3U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_PF_MEM_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_PF_MEM_MASK)

#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_ADDR_MASK (0xFFFFFFF0U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_ADDR_SHIFT (4U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_ADDR(x)  (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_ADDR_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_BAR5_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_CARDBUS_CIS - PCI cardbus CIS register */
/*! @{ */

#define ENETC_VF_PCI_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR_MASK (0xFFFFFFFFU)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR_SHIFT (0U)
#define ENETC_VF_PCI_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR(x) (((uint32_t)(((uint32_t)(x)) << ENETC_VF_PCI_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR_SHIFT)) & ENETC_VF_PCI_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR_MASK)
/*! @} */

