JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define FLEXSPI_SLV_MODULE_INTEN_WOFEN_MASK      (0x1U)
#define FLEXSPI_SLV_MODULE_INTEN_WOFEN_SHIFT     (0U)
/*! WOFEN - Write Overflow Interrupt Enable
 *  0b1..Enable
 *  0b0..Disable
 */
#define FLEXSPI_SLV_MODULE_INTEN_WOFEN(x)        (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_INTEN_WOFEN_SHIFT)) & FLEXSPI_SLV_MODULE_INTEN_WOFEN_MASK)

#define FLEXSPI_SLV_MODULE_INTEN_RUFEN_MASK      (0x2U)
#define FLEXSPI_SLV_MODULE_INTEN_RUFEN_SHIFT     (1U)
/*! RUFEN - Read Underflow Interrupt Enable
 *  0b1..Enable
 *  0b0..Disable
 */
#define FLEXSPI_SLV_MODULE_INTEN_RUFEN(x)        (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_INTEN_RUFEN_SHIFT)) & FLEXSPI_SLV_MODULE_INTEN_RUFEN_MASK)

#define FLEXSPI_SLV_MODULE_INTEN_ERRCMDEN_MASK   (0x4U)
#define FLEXSPI_SLV_MODULE_INTEN_ERRCMDEN_SHIFT  (2U)
/*! ERRCMDEN - Error Command Interrupt Enable
 *  0b1..Enable
 *  0b0..Disable
 */
#define FLEXSPI_SLV_MODULE_INTEN_ERRCMDEN(x)     (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_INTEN_ERRCMDEN_SHIFT)) & FLEXSPI_SLV_MODULE_INTEN_ERRCMDEN_MASK)
/*! @} */

/*! @name SPI_MAIL_CTRL - SPI Mailbox control */
/*! @{ */

#define FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT_MASK    (0x1U)
#define FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT_SHIFT   (0U)
/*! CLRINT - Clear Interrupt
 *  0b1..Clear
 *  0b0..Do not clear
 */
#define FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT(x)      (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT_SHIFT)) & FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT_MASK)

#define FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN_MASK  (0x2U)
#define FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN_SHIFT (1U)
/*! SPIINTEN - SPI Leader Interrupt Enable
 *  0b1..Enable
 *  0b0..Disable
 */
#define FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN(x)    (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN_SHIFT)) & FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN_MASK)
/*! @} */

/*! @name SPIMAIL - SPI Mail Interrupt */
/*! @{ */

#define FLEXSPI_SLV_SPIMAIL_MAILn_MASK           (0xFFFFFFFFU)
#define FLEXSPI_SLV_SPIMAIL_MAILn_SHIFT          (0U)
#define FLEXSPI_SLV_SPIMAIL_MAILn(x)             (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_SPIMAIL_MAILn_SHIFT)) & FLEXSPI_SLV_SPIMAIL_MAILn_MASK)
/*! @} */

/* The count of FLEXSPI_SLV_SPIMAIL */
#define FLEXSPI_SLV_SPIMAIL_COUNT                (9U)


/*!
 * @}
 */ /* end of group FLEXSPI_SLV_Register_Masks */


/* FLEXSPI_SLV - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FLEXSPI_SLV base address */
  #define FLEXSPI_SLV_BASE                         (0x52900000u)
  /** Peripheral FLEXSPI_SLV base address */
  #define FLEXSPI_SLV_BASE_NS                      (0x42900000u)
  /** Peripheral FLEXSPI_SLV base pointer */
  #define FLEXSPI_SLV                              ((FLEXSPI_SLV_Type *)FLEXSPI_SLV_BASE)
  /** Peripheral FLEXSPI_SLV base pointer */
  #define FLEXSPI_SLV_NS                           ((FLEXSPI_SLV_Type *)FLEXSPI_SLV_BASE_NS)
  /** Array initializer of FLEXSPI_SLV peripheral base addresses */
  #define FLEXSPI_SLV_BASE_ADDRS                   { FLEXSPI_SLV_BASE }
  /** Array initializer of FLEXSPI_SLV peripheral base pointers */
  #define FLEXSPI_SLV_BASE_PTRS                    { FLEXSPI_SLV }
  /** Array initializer of FLEXSPI_SLV peripheral base addresses */
  #define FLEXSPI_SLV_BASE_ADDRS_NS                { FLEXSPI_SLV_BASE_NS }
  /** Array initializer of FLEXSPI_SLV peripheral base pointers */
  #define FLEXSPI_SLV_BASE_PTRS_NS                 { FLEXSPI_SLV_NS }
#else
  /** Peripheral FLEXSPI_SLV base address */
  #define FLEXSPI_SLV_BASE                         (0x42900000u)
  /** Peripheral FLEXSPI_SLV base pointer */
  #define FLEXSPI_SLV                              ((FLEXSPI_SLV_Type *)FLEXSPI_SLV_BASE)
  /** Array initializer of FLEXSPI_SLV peripheral base addresses */
  #define FLEXSPI_SLV_BASE_ADDRS                   { FLEXSPI_SLV_BASE }
  /** Array initializer of FLEXSPI_SLV peripheral base pointers */
  #define FLEXSPI_SLV_BASE_PTRS                    { FLEXSPI_SLV }
#endif

/*!
 * @}
 */ /* end of group FLEXSPI_SLV_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- GPC_CPU_CTRL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GPC_CPU_CTRL_Peripheral_Access_Layer GPC_CPU_CTRL Peripheral Access Layer
 * @{
 */

/** GPC_CPU_CTRL - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0, array step: 0x800 */
         uint8_t RESERVED_0[4];
    __IO uint32_t CM_AUTHEN_CTRL;                    /**< CM Authentication Control, array offset: 0x4, array step: 0x800 */
         uint8_t RESERVED_1[4];
    __IO uint32_t CM_MISC;                           /**< Miscellaneous, array offset: 0xC, array step: 0x800 */
    __IO uint32_t CM_MODE_CTRL;                      /**< CPU mode control, array offset: 0x10, array step: 0x800 */
    __I  uint32_t CM_MODE_STAT;                      /**< CM CPU mode Status, array offset: 0x14, array step: 0x800 */
         uint8_t RESERVED_2[232];
    __IO uint32_t CM_IRQ_WAKEUP_MASK[8];             /**< CM IRQ0~31 wakeup mask..CM IRQ224~255 wakeup mask, array offset: 0x100, array step: index*0x800, index2*0x4 */
         uint8_t RESERVED_3[32];
    __IO uint32_t CM_NON_IRQ_WAKEUP_MASK;            /**< CM non-IRQ wakeup mask, array offset: 0x140, array step: 0x800 */
         uint8_t RESERVED_4[12];
    __I  uint32_t CM_IRQ_WAKEUP_STAT[8];             /**< CM IRQ0~31 wakeup status..CM IRQ224~255 wakeup status, array offset: 0x150, array step: index*0x800, index2*0x4 */
         uint8_t RESERVED_5[32];
    __I  uint32_t CM_NON_IRQ_WAKEUP_STAT;            /**< CM non-irq wakeup status, array offset: 0x190, array step: 0x800 */
         uint8_t RESERVED_6[108];
    __IO uint32_t CM_SLEEP_SSAR_CTRL;                /**< CM sleep SSAR control, array offset: 0x200, array step: 0x800 */
         uint8_t RESERVED_7[4];
    __IO uint32_t CM_SLEEP_LPCG_CTRL;                /**< CM sleep LPCG control, array offset: 0x208, array step: 0x800 */
         uint8_t RESERVED_8[4];
    __IO uint32_t CM_SLEEP_PLL_CTRL;                 /**< CM sleep PLL control, array offset: 0x210, array step: 0x800 */
         uint8_t RESERVED_9[4];
    __IO uint32_t CM_SLEEP_ISO_CTRL;                 /**< CM sleep isolation control, array offset: 0x218, array step: 0x800 */
         uint8_t RESERVED_10[4];
    __IO uint32_t CM_SLEEP_RESET_CTRL;               /**< CM sleep reset control, array offset: 0x220, array step: 0x800 */
         uint8_t RESERVED_11[4];
    __IO uint32_t CM_SLEEP_POWER_CTRL;               /**< CM sleep power control, array offset: 0x228, array step: 0x800 */
         uint8_t RESERVED_12[100];
    __IO uint32_t CM_WAKEUP_POWER_CTRL;              /**< CM wakeup power control, array offset: 0x290, array step: 0x800 */
         uint8_t RESERVED_13[4];
    __IO uint32_t CM_WAKEUP_RESET_CTRL;              /**< CM wakeup reset control, array offset: 0x298, array step: 0x800 */
         uint8_t RESERVED_14[4];
    __IO uint32_t CM_WAKEUP_ISO_CTRL;                /**< CM wakeup isolation control, array offset: 0x2A0, array step: 0x800 */
         uint8_t RESERVED_15[4];
    __IO uint32_t CM_WAKEUP_PLL_CTRL;                /**< CM wakeup PLL control, array offset: 0x2A8, array step: 0x800 */
         uint8_t RESERVED_16[4];
    __IO uint32_t CM_WAKEUP_LPCG_CTRL;               /**< CM wakeup LPCG control, array offset: 0x2B0, array step: 0x800 */
         uint8_t RESERVED_17[12];
    __IO uint32_t CM_WAKEUP_SSAR_CTRL;               /**< CM wakeup SSAR control, array offset: 0x2C0, array step: 0x800 */
         uint8_t RESERVED_18[188];
    __IO uint32_t CM_SYS_SLEEP_CTRL;                 /**< CM system sleep control, array offset: 0x380, array step: 0x800 */
         uint8_t RESERVED_19[1148];
  } AUTHEN[2];
} GPC_CPU_CTRL_Type;

/* ----------------------------------------------------------------------------
   -- GPC_CPU_CTRL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GPC_CPU_CTRL_Register_Masks GPC_CPU_CTRL Register Masks
 * @{
 */

/*! @name CM_AUTHEN_CTRL - CM Authentication Control */
/*! @{ */

