JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/* The count of GPC_CPU_CTRL_CM_MODE_STAT */
#define GPC_CPU_CTRL_CM_MODE_STAT_COUNT          (2U)

/*! @name CM_IRQ_WAKEUP_MASK - CM IRQ0~31 wakeup mask..CM IRQ224~255 wakeup mask */
/*! @{ */

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_0_31_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_0_31_SHIFT (0U)
/*! MASK_0_31 - "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_0_31(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_0_31_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_0_31_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_32_63_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_32_63_SHIFT (0U)
/*! MASK_32_63 - "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_32_63(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_32_63_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_32_63_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_64_95_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_64_95_SHIFT (0U)
/*! MASK_64_95 - "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_64_95(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_64_95_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_64_95_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_96_127_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_96_127_SHIFT (0U)
/*! MASK_96_127 - "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_96_127(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_96_127_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_96_127_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_128_159_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_128_159_SHIFT (0U)
/*! MASK_128_159 - "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_128_159(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_128_159_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_128_159_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_160_191_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_160_191_SHIFT (0U)
/*! MASK_160_191 - "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_160_191(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_160_191_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_160_191_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_192_223_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_192_223_SHIFT (0U)
/*! MASK_192_223 - "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_192_223(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_192_223_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_192_223_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_224_255_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_224_255_SHIFT (0U)
/*! MASK_224_255 - "1" means the IRQ cannot wakeup CPU platform */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_224_255(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_224_255_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_MASK_224_255_MASK)
/*! @} */

/* The count of GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_COUNT    (2U)

/* The count of GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_MASK_COUNT2   (8U)

/*! @name CM_NON_IRQ_WAKEUP_MASK - CM non-IRQ wakeup mask */
/*! @{ */

#define GPC_CPU_CTRL_CM_NON_IRQ_WAKEUP_MASK_DEBUG_WAKEUP_MASK_MASK (0x2U)
#define GPC_CPU_CTRL_CM_NON_IRQ_WAKEUP_MASK_DEBUG_WAKEUP_MASK_SHIFT (1U)
/*! DEBUG_WAKEUP_MASK - "1" means the debug_wakeup_request cannot wakeup CPU platform */
#define GPC_CPU_CTRL_CM_NON_IRQ_WAKEUP_MASK_DEBUG_WAKEUP_MASK(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_NON_IRQ_WAKEUP_MASK_DEBUG_WAKEUP_MASK_SHIFT)) & GPC_CPU_CTRL_CM_NON_IRQ_WAKEUP_MASK_DEBUG_WAKEUP_MASK_MASK)
/*! @} */

/* The count of GPC_CPU_CTRL_CM_NON_IRQ_WAKEUP_MASK */
#define GPC_CPU_CTRL_CM_NON_IRQ_WAKEUP_MASK_COUNT (2U)

/*! @name CM_IRQ_WAKEUP_STAT - CM IRQ0~31 wakeup status..CM IRQ224~255 wakeup status */
/*! @{ */

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_0_31_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_0_31_SHIFT (0U)
/*! STAT_0_31 - IRQ status */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_0_31(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_0_31_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_0_31_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_32_63_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_32_63_SHIFT (0U)
/*! STAT_32_63 - IRQ status */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_32_63(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_32_63_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_32_63_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_64_95_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_64_95_SHIFT (0U)
/*! STAT_64_95 - IRQ status */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_64_95(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_64_95_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_64_95_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_96_127_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_96_127_SHIFT (0U)
/*! STAT_96_127 - IRQ status */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_96_127(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_96_127_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_96_127_MASK)

#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_128_159_MASK (0xFFFFFFFFU)
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_128_159_SHIFT (0U)
/*! STAT_128_159 - IRQ status */
#define GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_128_159(x) (((uint32_t)(((uint32_t)(x)) << GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_128_159_SHIFT)) & GPC_CPU_CTRL_CM_IRQ_WAKEUP_STAT_STAT_128_159_MASK)

