JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define NETC_ENETC_PINVLANR_PCP_MASK             (0xE000U)
#define NETC_ENETC_PINVLANR_PCP_SHIFT            (13U)
#define NETC_ENETC_PINVLANR_PCP(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PINVLANR_PCP_SHIFT)) & NETC_ENETC_PINVLANR_PCP_MASK)

#define NETC_ENETC_PINVLANR_TPID_MASK            (0x30000U)
#define NETC_ENETC_PINVLANR_TPID_SHIFT           (16U)
/*! TPID
 *  0b00..Standard C-VLAN 0x8100
 *  0b01..Standard S-VLAN 0x88A8
 *  0b10..Custom VLAN as defined by CVLANR1[ETYPE]
 *  0b11..Custom VLAN as defined by CVLANR2[ETYPE]
 */
#define NETC_ENETC_PINVLANR_TPID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PINVLANR_TPID_SHIFT)) & NETC_ENETC_PINVLANR_TPID_MASK)

#define NETC_ENETC_PINVLANR_PNE_MASK             (0x40000U)
#define NETC_ENETC_PINVLANR_PNE_SHIFT            (18U)
/*! PNE - Port Native VLAN Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PINVLANR_PNE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PINVLANR_PNE_SHIFT)) & NETC_ENETC_PINVLANR_PNE_MASK)

#define NETC_ENETC_PINVLANR_VZE_MASK             (0x80000U)
#define NETC_ENETC_PINVLANR_VZE_SHIFT            (19U)
/*! VZE - VID 0 Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PINVLANR_VZE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PINVLANR_VZE_SHIFT)) & NETC_ENETC_PINVLANR_VZE_MASK)
/*! @} */

/*! @name PVCLCTR - Port VLAN classification control register */
/*! @{ */

#define NETC_ENETC_PVCLCTR_OAI_MASK              (0x200U)
#define NETC_ENETC_PVCLCTR_OAI_SHIFT             (9U)
/*! OAI - Outer as Inner
 *  0b0..Indicates that the Inner is not valid if only one tag is found
 *  0b1..Indicates that the outer should be used as the Inner if only one tag is found
 */
#define NETC_ENETC_PVCLCTR_OAI(x)                (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PVCLCTR_OAI_SHIFT)) & NETC_ENETC_PVCLCTR_OAI_MASK)
/*! @} */

/*! @name PARCSCR - Parser checksum configuration register */
/*! @{ */

#define NETC_ENETC_PARCSCR_L4CD_MASK             (0x1U)
#define NETC_ENETC_PARCSCR_L4CD_SHIFT            (0U)
/*! L4CD
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define NETC_ENETC_PARCSCR_L4CD(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PARCSCR_L4CD_SHIFT)) & NETC_ENETC_PARCSCR_L4CD_MASK)

#define NETC_ENETC_PARCSCR_L3CD_MASK             (0x2U)
#define NETC_ENETC_PARCSCR_L3CD_SHIFT            (1U)
/*! L3CD
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define NETC_ENETC_PARCSCR_L3CD(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PARCSCR_L3CD_SHIFT)) & NETC_ENETC_PARCSCR_L3CD_MASK)
/*! @} */

/*! @name PARCECR - Parser custom Ethertype 0 configuration register..Parser custom Ethertype 3 configuration register */
/*! @{ */

#define NETC_ENETC_PARCECR_CP_MASK               (0xFU)
#define NETC_ENETC_PARCECR_CP_SHIFT              (0U)
/*! CP - Code Point */
#define NETC_ENETC_PARCECR_CP(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PARCECR_CP_SHIFT)) & NETC_ENETC_PARCECR_CP_MASK)

#define NETC_ENETC_PARCECR_EN_MASK               (0x20U)
#define NETC_ENETC_PARCECR_EN_SHIFT              (5U)
/*! EN - Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PARCECR_EN(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PARCECR_EN_SHIFT)) & NETC_ENETC_PARCECR_EN_MASK)

#define NETC_ENETC_PARCECR_ETYPE_MASK            (0xFFFF0000U)
#define NETC_ENETC_PARCECR_ETYPE_SHIFT           (16U)
/*! ETYPE - ETYPE */
#define NETC_ENETC_PARCECR_ETYPE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PARCECR_ETYPE_SHIFT)) & NETC_ENETC_PARCECR_ETYPE_MASK)
/*! @} */

/* The count of NETC_ENETC_PARCECR */
#define NETC_ENETC_PARCECR_COUNT                 (4U)

/*! @name PPAUONTR - Port pause ON threshold register */
/*! @{ */

#define NETC_ENETC_PPAUONTR_THRESH_MASK          (0xFFFFFFU)
#define NETC_ENETC_PPAUONTR_THRESH_SHIFT         (0U)
#define NETC_ENETC_PPAUONTR_THRESH(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PPAUONTR_THRESH_SHIFT)) & NETC_ENETC_PPAUONTR_THRESH_MASK)
/*! @} */

/*! @name PPAUOFFTR - Port pause OFF threshold register */
/*! @{ */

#define NETC_ENETC_PPAUOFFTR_THRESH_MASK         (0xFFFFFFU)
#define NETC_ENETC_PPAUOFFTR_THRESH_SHIFT        (0U)
#define NETC_ENETC_PPAUOFFTR_THRESH(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PPAUOFFTR_THRESH_SHIFT)) & NETC_ENETC_PPAUOFFTR_THRESH_MASK)
/*! @} */

/*! @name PRXMBER - Port receive memory buffer entitlement register */
/*! @{ */

#define NETC_ENETC_PRXMBER_AMOUNT_MASK           (0xFFFFFFU)
#define NETC_ENETC_PRXMBER_AMOUNT_SHIFT          (0U)
#define NETC_ENETC_PRXMBER_AMOUNT(x)             (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRXMBER_AMOUNT_SHIFT)) & NETC_ENETC_PRXMBER_AMOUNT_MASK)
/*! @} */

/*! @name PRXMBLR - Port receive memory buffer limit register */
/*! @{ */

#define NETC_ENETC_PRXMBLR_LIMIT_MASK            (0xFFFFFFU)
#define NETC_ENETC_PRXMBLR_LIMIT_SHIFT           (0U)
#define NETC_ENETC_PRXMBLR_LIMIT(x)              (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRXMBLR_LIMIT_SHIFT)) & NETC_ENETC_PRXMBLR_LIMIT_MASK)
/*! @} */

/*! @name PRXBCR - Port receive buffer count register */
/*! @{ */

#define NETC_ENETC_PRXBCR_COUNT_MASK             (0xFFFFFFU)
#define NETC_ENETC_PRXBCR_COUNT_SHIFT            (0U)
#define NETC_ENETC_PRXBCR_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRXBCR_COUNT_SHIFT)) & NETC_ENETC_PRXBCR_COUNT_MASK)
/*! @} */

/*! @name PRXBCHWMR - Port receive buffer count high watermark register */
/*! @{ */

#define NETC_ENETC_PRXBCHWMR_WATERMARK_MASK      (0xFFFFFFU)
#define NETC_ENETC_PRXBCHWMR_WATERMARK_SHIFT     (0U)
#define NETC_ENETC_PRXBCHWMR_WATERMARK(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRXBCHWMR_WATERMARK_SHIFT)) & NETC_ENETC_PRXBCHWMR_WATERMARK_MASK)
/*! @} */

/*! @name PICDRDCR - Port ingress congestion DR0 discard count register..Port ingress congestion DR3 discard count register */
/*! @{ */

#define NETC_ENETC_PICDRDCR_COUNT_MASK           (0xFFFFFFFFU)
#define NETC_ENETC_PICDRDCR_COUNT_SHIFT          (0U)
#define NETC_ENETC_PICDRDCR_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PICDRDCR_COUNT_SHIFT)) & NETC_ENETC_PICDRDCR_COUNT_MASK)
/*! @} */

/* The count of NETC_ENETC_PICDRDCR */
#define NETC_ENETC_PICDRADCR_PICDRDCR_COUNT      (4U)

/*! @name PICDRDCRRR - Port ingress congestion DR0 discard count read-reset register..Port ingress congestion DR3 discard count read-reset register */
/*! @{ */

#define NETC_ENETC_PICDRDCRRR_COUNT_MASK         (0xFFFFFFFFU)
#define NETC_ENETC_PICDRDCRRR_COUNT_SHIFT        (0U)
#define NETC_ENETC_PICDRDCRRR_COUNT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PICDRDCRRR_COUNT_SHIFT)) & NETC_ENETC_PICDRDCRRR_COUNT_MASK)
/*! @} */

/* The count of NETC_ENETC_PICDRDCRRR */
#define NETC_ENETC_PICDRADCR_PICDRDCRRR_COUNT    (4U)

