JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define NETC_ENETC_PSICFGR0_NUM_TX_BDR_MASK      (0x7FU)
#define NETC_ENETC_PSICFGR0_NUM_TX_BDR_SHIFT     (0U)
#define NETC_ENETC_PSICFGR0_NUM_TX_BDR(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_NUM_TX_BDR_SHIFT)) & NETC_ENETC_PSICFGR0_NUM_TX_BDR_MASK)

#define NETC_ENETC_PSICFGR0_SPE_MASK             (0x800U)
#define NETC_ENETC_PSICFGR0_SPE_SHIFT            (11U)
/*! SPE - Source Pruning Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PSICFGR0_SPE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_SPE_SHIFT)) & NETC_ENETC_PSICFGR0_SPE_MASK)

#define NETC_ENETC_PSICFGR0_VTE_MASK             (0x1000U)
#define NETC_ENETC_PSICFGR0_VTE_SHIFT            (12U)
/*! VTE - VLAN Tag Extract
 *  0b0..SI-based VLAN removal disabled
 *  0b1..SI-based VLAN removal enabled
 */
#define NETC_ENETC_PSICFGR0_VTE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_VTE_SHIFT)) & NETC_ENETC_PSICFGR0_VTE_MASK)

#define NETC_ENETC_PSICFGR0_SIVIE_MASK           (0x4000U)
#define NETC_ENETC_PSICFGR0_SIVIE_SHIFT          (14U)
/*! SIVIE - SI-based VLAN Insertion Enable
 *  0b0..SI-based VLAN insertion disabled
 *  0b1..SI-based VLAN insertion enabled
 */
#define NETC_ENETC_PSICFGR0_SIVIE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_SIVIE_SHIFT)) & NETC_ENETC_PSICFGR0_SIVIE_MASK)

#define NETC_ENETC_PSICFGR0_ASE_MASK             (0x8000U)
#define NETC_ENETC_PSICFGR0_ASE_SHIFT            (15U)
/*! ASE - Anti-spoofing enable */
#define NETC_ENETC_PSICFGR0_ASE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_ASE_SHIFT)) & NETC_ENETC_PSICFGR0_ASE_MASK)

#define NETC_ENETC_PSICFGR0_NUM_RX_BDR_MASK      (0x7F0000U)
#define NETC_ENETC_PSICFGR0_NUM_RX_BDR_SHIFT     (16U)
#define NETC_ENETC_PSICFGR0_NUM_RX_BDR(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_NUM_RX_BDR_SHIFT)) & NETC_ENETC_PSICFGR0_NUM_RX_BDR_MASK)

#define NETC_ENETC_PSICFGR0_SIVC_MASK            (0xF000000U)
#define NETC_ENETC_PSICFGR0_SIVC_SHIFT           (24U)
#define NETC_ENETC_PSICFGR0_SIVC(x)              (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_SIVC_SHIFT)) & NETC_ENETC_PSICFGR0_SIVC_MASK)

#define NETC_ENETC_PSICFGR0_SIBW_MASK            (0xF0000000U)
#define NETC_ENETC_PSICFGR0_SIBW_SHIFT           (28U)
#define NETC_ENETC_PSICFGR0_SIBW(x)              (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_SIBW_SHIFT)) & NETC_ENETC_PSICFGR0_SIBW_MASK)
/*! @} */

/* The count of NETC_ENETC_PSICFGR0 */
#define NETC_ENETC_PSICFGR0_COUNT                (2U)

/*! @name PSICFGR1 - Port station interface 1 configuration register 1 */
/*! @{ */

#define NETC_ENETC_PSICFGR1_TC0_MAP_MASK         (0x7U)
#define NETC_ENETC_PSICFGR1_TC0_MAP_SHIFT        (0U)
#define NETC_ENETC_PSICFGR1_TC0_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC0_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC0_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC1_MAP_MASK         (0x70U)
#define NETC_ENETC_PSICFGR1_TC1_MAP_SHIFT        (4U)
#define NETC_ENETC_PSICFGR1_TC1_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC1_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC1_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC2_MAP_MASK         (0x700U)
#define NETC_ENETC_PSICFGR1_TC2_MAP_SHIFT        (8U)
#define NETC_ENETC_PSICFGR1_TC2_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC2_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC2_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC3_MAP_MASK         (0x7000U)
#define NETC_ENETC_PSICFGR1_TC3_MAP_SHIFT        (12U)
#define NETC_ENETC_PSICFGR1_TC3_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC3_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC3_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC4_MAP_MASK         (0x70000U)
#define NETC_ENETC_PSICFGR1_TC4_MAP_SHIFT        (16U)
#define NETC_ENETC_PSICFGR1_TC4_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC4_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC4_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC5_MAP_MASK         (0x700000U)
#define NETC_ENETC_PSICFGR1_TC5_MAP_SHIFT        (20U)
#define NETC_ENETC_PSICFGR1_TC5_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC5_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC5_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC6_MAP_MASK         (0x7000000U)
#define NETC_ENETC_PSICFGR1_TC6_MAP_SHIFT        (24U)
#define NETC_ENETC_PSICFGR1_TC6_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC6_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC6_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC7_MAP_MASK         (0x70000000U)
#define NETC_ENETC_PSICFGR1_TC7_MAP_SHIFT        (28U)
#define NETC_ENETC_PSICFGR1_TC7_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC7_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC7_MAP_MASK)
/*! @} */

/* The count of NETC_ENETC_PSICFGR1 */
#define NETC_ENETC_PSICFGR1_COUNT                (2U)

/*! @name PSICFGR2 - Port station interface 0 configuration register 2..Port station interface 1 configuration register 2 */
/*! @{ */

#define NETC_ENETC_PSICFGR2_NUM_MSIX_MASK        (0x3FU)
#define NETC_ENETC_PSICFGR2_NUM_MSIX_SHIFT       (0U)
/*! NUM_MSIX - Number of MSI-X */
#define NETC_ENETC_PSICFGR2_NUM_MSIX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR2_NUM_MSIX_SHIFT)) & NETC_ENETC_PSICFGR2_NUM_MSIX_MASK)
/*! @} */

/* The count of NETC_ENETC_PSICFGR2 */
#define NETC_ENETC_PSICFGR2_COUNT                (2U)

/*! @name PSIVMAFCFGR - Port station interface 0 VSI MAC address filtering configuration register..Port station interface 1 VSI MAC address filtering configuration register */
/*! @{ */

#define NETC_ENETC_PSIVMAFCFGR_NUM_MAC_AFTE_MASK (0xFFU)
#define NETC_ENETC_PSIVMAFCFGR_NUM_MAC_AFTE_SHIFT (0U)
#define NETC_ENETC_PSIVMAFCFGR_NUM_MAC_AFTE(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVMAFCFGR_NUM_MAC_AFTE_SHIFT)) & NETC_ENETC_PSIVMAFCFGR_NUM_MAC_AFTE_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIVMAFCFGR */
#define NETC_ENETC_PSIVMAFCFGR_COUNT             (2U)

