JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name PM0_MAC_ADDR_0 - Port MAC 0 MAC Address Register 0 */
/*! @{ */

#define NETC_ETH_LINK_PM0_MAC_ADDR_0_MAC_ADDR_0_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_PM0_MAC_ADDR_0_MAC_ADDR_0_SHIFT (0U)
/*! MAC_ADDR_0 - MAC address 0 */
#define NETC_ETH_LINK_PM0_MAC_ADDR_0_MAC_ADDR_0(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MAC_ADDR_0_MAC_ADDR_0_SHIFT)) & NETC_ETH_LINK_PM0_MAC_ADDR_0_MAC_ADDR_0_MASK)
/*! @} */

/*! @name PM0_MAC_ADDR_1 - Port MAC 0 MAC Address Register 1 */
/*! @{ */

#define NETC_ETH_LINK_PM0_MAC_ADDR_1_MAC_ADDR_1_MASK (0xFFFFU)
#define NETC_ETH_LINK_PM0_MAC_ADDR_1_MAC_ADDR_1_SHIFT (0U)
/*! MAC_ADDR_1 - MAC address 1 */
#define NETC_ETH_LINK_PM0_MAC_ADDR_1_MAC_ADDR_1(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MAC_ADDR_1_MAC_ADDR_1_SHIFT)) & NETC_ETH_LINK_PM0_MAC_ADDR_1_MAC_ADDR_1_MASK)
/*! @} */

/*! @name PM0_MAXFRM - Port MAC 0 Maximum Frame Length Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_MAXFRM_MAXFRM_MASK     (0xFFFFU)
#define NETC_ETH_LINK_PM0_MAXFRM_MAXFRM_SHIFT    (0U)
/*! MAXFRM - Maximum supported received frame length. */
#define NETC_ETH_LINK_PM0_MAXFRM_MAXFRM(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MAXFRM_MAXFRM_SHIFT)) & NETC_ETH_LINK_PM0_MAXFRM_MAXFRM_MASK)

#define NETC_ETH_LINK_PM0_MAXFRM_TX_MTU_MASK     (0xFFFF0000U)
#define NETC_ETH_LINK_PM0_MAXFRM_TX_MTU_SHIFT    (16U)
/*! TX_MTU - Maximum transmit frame length */
#define NETC_ETH_LINK_PM0_MAXFRM_TX_MTU(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MAXFRM_TX_MTU_SHIFT)) & NETC_ETH_LINK_PM0_MAXFRM_TX_MTU_MASK)
/*! @} */

/*! @name PM0_MINFRM - Port MAC 0 Minimum Frame Length Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_MINFRM_NUM_BYTES_MASK  (0x7FU)
#define NETC_ETH_LINK_PM0_MINFRM_NUM_BYTES_SHIFT (0U)
/*! NUM_BYTES - Receive Minimum Frame Length size in bytes. */
#define NETC_ETH_LINK_PM0_MINFRM_NUM_BYTES(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MINFRM_NUM_BYTES_SHIFT)) & NETC_ETH_LINK_PM0_MINFRM_NUM_BYTES_MASK)
/*! @} */

/*! @name PM0_MDIO_CFG - Port MAC 0 Internal MDIO Configuration Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY2_MASK     (0x1U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY2_SHIFT    (0U)
/*! BSY2 - MDIO busy (same as bit 31) */
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY2(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_BSY2_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_BSY2_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD_MASK (0x1CU)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD_SHIFT (2U)
/*! MDIO_HOLD - MDIO hold time */
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS_MASK  (0x20U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS_SHIFT (5U)
/*! PRE_DIS - MDIO preamble disable. */
#define NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_ENC45_MASK    (0x40U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_ENC45_SHIFT   (6U)
/*! ENC45 - Enable Clause 45 support. */
#define NETC_ETH_LINK_PM0_MDIO_CFG_ENC45(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_ENC45_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_ENC45_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV_MASK (0xFF80U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV_SHIFT (7U)
/*! MDIO_CLK_DIV - MDIO clock divisor. */
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_CIM_MASK      (0x20000000U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_CIM_SHIFT     (29U)
/*! CIM - MDIO command completion interrupt mask. */
#define NETC_ETH_LINK_PM0_MDIO_CFG_CIM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_CIM_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_CIM_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_CMP_MASK      (0x40000000U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_CMP_SHIFT     (30U)
/*! CMP - MDIO command completion event. Bit is cleared by writing `1'. */
#define NETC_ETH_LINK_PM0_MDIO_CFG_CMP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_CMP_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_CMP_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY1_MASK     (0x80000000U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY1_SHIFT    (31U)
/*! BSY1 - MDIO busy */
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY1(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_BSY1_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_BSY1_MASK)
/*! @} */

/*! @name PM0_MDIO_CTL - Port MAC 0 Internal MDIO Interface Control Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR_MASK (0x1FU)
#define NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR_SHIFT (0U)
/*! DEV_ADDR - MDIO register address (Clause 22) */
#define NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR_MASK (0x3E0U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR_SHIFT (5U)
/*! PORT_ADDR - MDIO PHY address (Clause 22) */
#define NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CTL_READ_MASK     (0x8000U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_READ_SHIFT    (15U)
/*! READ - MDIO read initiation. */
#define NETC_ETH_LINK_PM0_MDIO_CTL_READ(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CTL_READ_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CTL_READ_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CTL_BSY_MASK      (0x80000000U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_BSY_SHIFT     (31U)
/*! BSY - MDIO busy */
#define NETC_ETH_LINK_PM0_MDIO_CTL_BSY(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CTL_BSY_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CTL_BSY_MASK)
/*! @} */

/*! @name PM0_MDIO_DATA - Port MAC 0 Internal MDIO Interface Data Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA_MASK (0xFFFFU)
#define NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA_SHIFT (0U)
/*! MDIO_DATA - 16-bit MDIO data. */
#define NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA_MASK)

#define NETC_ETH_LINK_PM0_MDIO_DATA_BUSY_MASK    (0x80000000U)
#define NETC_ETH_LINK_PM0_MDIO_DATA_BUSY_SHIFT   (31U)
/*! BUSY - MDIO busy bit. The state of this bit is also reflected in MDIO_CFG[BSY]. */
#define NETC_ETH_LINK_PM0_MDIO_DATA_BUSY(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_DATA_BUSY_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_DATA_BUSY_MASK)
/*! @} */

