JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define NETC_IERB_SVFHTDECR1_FID_MASK            (0xFFFU)
#define NETC_IERB_SVFHTDECR1_FID_SHIFT           (0U)
#define NETC_IERB_SVFHTDECR1_FID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR1_FID_SHIFT)) & NETC_IERB_SVFHTDECR1_FID_MASK)

#define NETC_IERB_SVFHTDECR1_VL_MODE_MASK        (0x1000U)
#define NETC_IERB_SVFHTDECR1_VL_MODE_SHIFT       (12U)
#define NETC_IERB_SVFHTDECR1_VL_MODE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR1_VL_MODE_SHIFT)) & NETC_IERB_SVFHTDECR1_VL_MODE_MASK)

#define NETC_IERB_SVFHTDECR1_BASE_ETEID_MASK     (0xFFFF0000U)
#define NETC_IERB_SVFHTDECR1_BASE_ETEID_SHIFT    (16U)
#define NETC_IERB_SVFHTDECR1_BASE_ETEID(x)       (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR1_BASE_ETEID_SHIFT)) & NETC_IERB_SVFHTDECR1_BASE_ETEID_MASK)
/*! @} */

/* The count of NETC_IERB_SVFHTDECR1 */
#define NETC_IERB_SVFHTDECR1_COUNT               (1U)

/*! @name SVFHTDECR2 - Switch 0 VLAN filter hash table default entry configuration registers 2 */
/*! @{ */

#define NETC_IERB_SVFHTDECR2_ES_PORT0_MASK       (0x1U)
#define NETC_IERB_SVFHTDECR2_ES_PORT0_SHIFT      (0U)
#define NETC_IERB_SVFHTDECR2_ES_PORT0(x)         (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ES_PORT0_SHIFT)) & NETC_IERB_SVFHTDECR2_ES_PORT0_MASK)

#define NETC_IERB_SVFHTDECR2_ES_PORT1_MASK       (0x2U)
#define NETC_IERB_SVFHTDECR2_ES_PORT1_SHIFT      (1U)
#define NETC_IERB_SVFHTDECR2_ES_PORT1(x)         (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ES_PORT1_SHIFT)) & NETC_IERB_SVFHTDECR2_ES_PORT1_MASK)

#define NETC_IERB_SVFHTDECR2_ES_PORT2_MASK       (0x4U)
#define NETC_IERB_SVFHTDECR2_ES_PORT2_SHIFT      (2U)
#define NETC_IERB_SVFHTDECR2_ES_PORT2(x)         (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ES_PORT2_SHIFT)) & NETC_IERB_SVFHTDECR2_ES_PORT2_MASK)

#define NETC_IERB_SVFHTDECR2_ES_PORT3_MASK       (0x8U)
#define NETC_IERB_SVFHTDECR2_ES_PORT3_SHIFT      (3U)
#define NETC_IERB_SVFHTDECR2_ES_PORT3(x)         (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ES_PORT3_SHIFT)) & NETC_IERB_SVFHTDECR2_ES_PORT3_MASK)

#define NETC_IERB_SVFHTDECR2_ES_PORT4_MASK       (0x10U)
#define NETC_IERB_SVFHTDECR2_ES_PORT4_SHIFT      (4U)
#define NETC_IERB_SVFHTDECR2_ES_PORT4(x)         (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ES_PORT4_SHIFT)) & NETC_IERB_SVFHTDECR2_ES_PORT4_MASK)

#define NETC_IERB_SVFHTDECR2_MLO_MASK            (0x7000000U)
#define NETC_IERB_SVFHTDECR2_MLO_SHIFT           (24U)
#define NETC_IERB_SVFHTDECR2_MLO(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_MLO_SHIFT)) & NETC_IERB_SVFHTDECR2_MLO_MASK)

#define NETC_IERB_SVFHTDECR2_MFO_MASK            (0x18000000U)
#define NETC_IERB_SVFHTDECR2_MFO_SHIFT           (27U)
#define NETC_IERB_SVFHTDECR2_MFO(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_MFO_SHIFT)) & NETC_IERB_SVFHTDECR2_MFO_MASK)
/*! @} */

/* The count of NETC_IERB_SVFHTDECR2 */
#define NETC_IERB_SVFHTDECR2_COUNT               (1U)

/*! @name EBCR0 - ENETC 0 binding configuration register 0..ENETC 1 binding configuration register 0 */
/*! @{ */

#define NETC_IERB_EBCR0_RC_INST_MASK             (0xFU)
#define NETC_IERB_EBCR0_RC_INST_SHIFT            (0U)
#define NETC_IERB_EBCR0_RC_INST(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR0_RC_INST_SHIFT)) & NETC_IERB_EBCR0_RC_INST_MASK)

#define NETC_IERB_EBCR0_FN_MASK                  (0xF00U)
#define NETC_IERB_EBCR0_FN_SHIFT                 (8U)
#define NETC_IERB_EBCR0_FN(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR0_FN_SHIFT)) & NETC_IERB_EBCR0_FN_MASK)

#define NETC_IERB_EBCR0_VALID_MASK               (0x80000000U)
#define NETC_IERB_EBCR0_VALID_SHIFT              (31U)
#define NETC_IERB_EBCR0_VALID(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR0_VALID_SHIFT)) & NETC_IERB_EBCR0_VALID_MASK)
/*! @} */

/* The count of NETC_IERB_EBCR0 */
#define NETC_IERB_EBCR0_COUNT                    (2U)

/*! @name EBCR1 - ENETC 0 binding configuration register 1..ENETC 1 binding configuration register 1 */
/*! @{ */

#define NETC_IERB_EBCR1_NUM_RX_BDR_MASK          (0x3FFU)
#define NETC_IERB_EBCR1_NUM_RX_BDR_SHIFT         (0U)
#define NETC_IERB_EBCR1_NUM_RX_BDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR1_NUM_RX_BDR_SHIFT)) & NETC_IERB_EBCR1_NUM_RX_BDR_MASK)

#define NETC_IERB_EBCR1_NUM_TX_BDR_MASK          (0x3FF0000U)
#define NETC_IERB_EBCR1_NUM_TX_BDR_SHIFT         (16U)
#define NETC_IERB_EBCR1_NUM_TX_BDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR1_NUM_TX_BDR_SHIFT)) & NETC_IERB_EBCR1_NUM_TX_BDR_MASK)
/*! @} */

/* The count of NETC_IERB_EBCR1 */
#define NETC_IERB_EBCR1_COUNT                    (2U)

/*! @name EBCR2 - ENETC 0 binding configuration register 2..ENETC 1 binding configuration register 2 */
/*! @{ */

#define NETC_IERB_EBCR2_NUM_MAC_AFTE_MASK        (0xFFFU)
#define NETC_IERB_EBCR2_NUM_MAC_AFTE_SHIFT       (0U)
#define NETC_IERB_EBCR2_NUM_MAC_AFTE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR2_NUM_MAC_AFTE_SHIFT)) & NETC_IERB_EBCR2_NUM_MAC_AFTE_MASK)

#define NETC_IERB_EBCR2_NUM_VLAN_FTE_MASK        (0xFFF0000U)
#define NETC_IERB_EBCR2_NUM_VLAN_FTE_SHIFT       (16U)
#define NETC_IERB_EBCR2_NUM_VLAN_FTE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR2_NUM_VLAN_FTE_SHIFT)) & NETC_IERB_EBCR2_NUM_VLAN_FTE_MASK)
/*! @} */

/* The count of NETC_IERB_EBCR2 */
#define NETC_IERB_EBCR2_COUNT                    (2U)

/*! @name EVBCR - ENETC 0 VSI binding configuration register..ENETC 1 VSI binding configuration register */
/*! @{ */

#define NETC_IERB_EVBCR_NUM_VSI_MASK             (0xFU)
#define NETC_IERB_EVBCR_NUM_VSI_SHIFT            (0U)
#define NETC_IERB_EVBCR_NUM_VSI(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EVBCR_NUM_VSI_SHIFT)) & NETC_IERB_EVBCR_NUM_VSI_MASK)
/*! @} */

/* The count of NETC_IERB_EVBCR */
#define NETC_IERB_EVBCR_COUNT                    (2U)

/*! @name EMCR - ENETC 0 MSI-X configuration register..ENETC 1 MSI-X configuration register */
/*! @{ */

#define NETC_IERB_EMCR_NUM_MSIX_MASK             (0x7FFU)
#define NETC_IERB_EMCR_NUM_MSIX_SHIFT            (0U)
#define NETC_IERB_EMCR_NUM_MSIX(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EMCR_NUM_MSIX_SHIFT)) & NETC_IERB_EMCR_NUM_MSIX_MASK)
/*! @} */

/* The count of NETC_IERB_EMCR */
#define NETC_IERB_EMCR_COUNT                     (2U)

