JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name ETGSLR - ENETC 0 time gate scheduling lookahead register..ENETC 1 time gate scheduling lookahead register */
/*! @{ */

#define NETC_IERB_ETGSLR_MIN_LOOKAHEAD_MASK      (0xFFFFFU)
#define NETC_IERB_ETGSLR_MIN_LOOKAHEAD_SHIFT     (0U)
#define NETC_IERB_ETGSLR_MIN_LOOKAHEAD(x)        (((uint32_t)(((uint32_t)(x)) << NETC_IERB_ETGSLR_MIN_LOOKAHEAD_SHIFT)) & NETC_IERB_ETGSLR_MIN_LOOKAHEAD_MASK)

#define NETC_IERB_ETGSLR_ZERO_LOOKAHEAD_MASK     (0x80000000U)
#define NETC_IERB_ETGSLR_ZERO_LOOKAHEAD_SHIFT    (31U)
/*! ZERO_LOOKAHEAD - Zero Lookahead
 *  0b0..Use MIN_LOOKAHEAD value
 *  0b1..If a gate control list is configured or when time specific departure is enabled on any traffic class
 *       (PTCaTSDR[TSDE] set to 1, where a corresponds to the traffic class number), use MIN_LOOKAHEAD value, otherwise
 *       use value of zero
 */
#define NETC_IERB_ETGSLR_ZERO_LOOKAHEAD(x)       (((uint32_t)(((uint32_t)(x)) << NETC_IERB_ETGSLR_ZERO_LOOKAHEAD_SHIFT)) & NETC_IERB_ETGSLR_ZERO_LOOKAHEAD_MASK)
/*! @} */

/* The count of NETC_IERB_ETGSLR */
#define NETC_IERB_ETGSLR_COUNT                   (2U)

/*! @name VAMQR - VSI 0 access management qualifier register */
/*! @{ */

#define NETC_IERB_VAMQR_ARQOS_MASK               (0xF0000U)
#define NETC_IERB_VAMQR_ARQOS_SHIFT              (16U)
#define NETC_IERB_VAMQR_ARQOS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_IERB_VAMQR_ARQOS_SHIFT)) & NETC_IERB_VAMQR_ARQOS_MASK)

#define NETC_IERB_VAMQR_AWQOS_MASK               (0xF00000U)
#define NETC_IERB_VAMQR_AWQOS_SHIFT              (20U)
#define NETC_IERB_VAMQR_AWQOS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_IERB_VAMQR_AWQOS_SHIFT)) & NETC_IERB_VAMQR_AWQOS_MASK)

#define NETC_IERB_VAMQR_BMT_MASK                 (0x80000000U)
#define NETC_IERB_VAMQR_BMT_SHIFT                (31U)
#define NETC_IERB_VAMQR_BMT(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_IERB_VAMQR_BMT_SHIFT)) & NETC_IERB_VAMQR_BMT_MASK)
/*! @} */

/* The count of NETC_IERB_VAMQR */
#define NETC_IERB_VAMQR_COUNT                    (1U)

/*! @name VBLPR - VSI 0 boot loader parameter register 0..VSI 0 boot loader parameter register 1 */
/*! @{ */

#define NETC_IERB_VBLPR_PARAM_VAL_MASK           (0xFFFFFFFFU)
#define NETC_IERB_VBLPR_PARAM_VAL_SHIFT          (0U)
#define NETC_IERB_VBLPR_PARAM_VAL(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_VBLPR_PARAM_VAL_SHIFT)) & NETC_IERB_VBLPR_PARAM_VAL_MASK)
/*! @} */

/* The count of NETC_IERB_VBLPR */
#define NETC_IERB_VBLPR_COUNT                    (1U)

/* The count of NETC_IERB_VBLPR */
#define NETC_IERB_VBLPR_COUNT2                   (2U)

/*! @name VPMAR0 - VSI 0 primary MAC address register 0 */
/*! @{ */

#define NETC_IERB_VPMAR0_MAC_ADDR_MASK           (0xFFFFFFFFU)
#define NETC_IERB_VPMAR0_MAC_ADDR_SHIFT          (0U)
#define NETC_IERB_VPMAR0_MAC_ADDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_VPMAR0_MAC_ADDR_SHIFT)) & NETC_IERB_VPMAR0_MAC_ADDR_MASK)
/*! @} */

/* The count of NETC_IERB_VPMAR0 */
#define NETC_IERB_VPMAR0_COUNT                   (1U)

/*! @name VPMAR1 - VSI 0 primary MAC address register 1 */
/*! @{ */

#define NETC_IERB_VPMAR1_MAC_ADDR_MASK           (0xFFFFU)
#define NETC_IERB_VPMAR1_MAC_ADDR_SHIFT          (0U)
#define NETC_IERB_VPMAR1_MAC_ADDR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_VPMAR1_MAC_ADDR_SHIFT)) & NETC_IERB_VPMAR1_MAC_ADDR_MASK)
/*! @} */

/* The count of NETC_IERB_VPMAR1 */
#define NETC_IERB_VPMAR1_COUNT                   (1U)


/*!
 * @}
 */ /* end of group NETC_IERB_Register_Masks */


/* NETC_IERB - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral NETC_IERB base address */
  #define NETC_IERB_BASE                           (0x70800000u)
  /** Peripheral NETC_IERB base address */
  #define NETC_IERB_BASE_NS                        (0x60800000u)
  /** Peripheral NETC_IERB base pointer */
  #define NETC_IERB                                ((NETC_IERB_Type *)NETC_IERB_BASE)
  /** Peripheral NETC_IERB base pointer */
  #define NETC_IERB_NS                             ((NETC_IERB_Type *)NETC_IERB_BASE_NS)
  /** Array initializer of NETC_IERB peripheral base addresses */
  #define NETC_IERB_BASE_ADDRS                     { NETC_IERB_BASE }
  /** Array initializer of NETC_IERB peripheral base pointers */
  #define NETC_IERB_BASE_PTRS                      { NETC_IERB }
  /** Array initializer of NETC_IERB peripheral base addresses */
  #define NETC_IERB_BASE_ADDRS_NS                  { NETC_IERB_BASE_NS }
  /** Array initializer of NETC_IERB peripheral base pointers */
  #define NETC_IERB_BASE_PTRS_NS                   { NETC_IERB_NS }
#else
  /** Peripheral NETC_IERB base address */
  #define NETC_IERB_BASE                           (0x60800000u)
  /** Peripheral NETC_IERB base pointer */
  #define NETC_IERB                                ((NETC_IERB_Type *)NETC_IERB_BASE)
  /** Array initializer of NETC_IERB peripheral base addresses */
  #define NETC_IERB_BASE_ADDRS                     { NETC_IERB_BASE }
  /** Array initializer of NETC_IERB peripheral base pointers */
  #define NETC_IERB_BASE_PTRS                      { NETC_IERB }
#endif

/*!
 * @}
 */ /* end of group NETC_IERB_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- NETC_PORT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_PORT_Peripheral_Access_Layer NETC_PORT Peripheral Access Layer
 * @{
 */

/** NETC_PORT - Register Layout Typedef */
typedef struct {
  __I  uint32_t PCAPR;                             /**< Port capability register, offset: 0x0 */
  __I  uint32_t PMCAPR;                            /**< Port MAC capability register, offset: 0x4 */
  __I  uint32_t PIOCAPR;                           /**< Port I/O capability register, offset: 0x8 */
       uint8_t RESERVED_0[4];
  __IO uint32_t PCR;                               /**< Port configuration register, offset: 0x10 */
       uint8_t RESERVED_1[12];
  __IO uint32_t PMAR0;                             /**< Port MAC address register 0, offset: 0x20 */
  __IO uint32_t PMAR1;                             /**< Port MAC address register 1, offset: 0x24 */
       uint8_t RESERVED_2[40];
  __IO uint32_t PTAR;                              /**< Port TPID acceptance register, offset: 0x50 */
  __IO uint32_t PQOSMR;                            /**< Port QoS mode register, offset: 0x54 */
       uint8_t RESERVED_3[8];
  __I  uint32_t PQOR;                              /**< Port Queue Operational register, offset: 0x60, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_4[28];
  __IO uint32_t PPCR;                              /**< Port parser configuration register, offset: 0x80 */
  __IO uint32_t PIPFCR;                            /**< Port ingress port filter configuration register, offset: 0x84 */
       uint8_t RESERVED_5[24];
  __IO uint32_t PSGCR;                             /**< Port stream gate configuration register, offset: 0xA0 */
       uint8_t RESERVED_6[92];
  __IO uint32_t POR;                               /**< Port operational register, offset: 0x100 */
  __I  uint32_t PSR;                               /**< Port status register, offset: 0x104 */
  __IO uint32_t PRXSDUOR;                          /**< Port receive SDU overhead register, offset: 0x108 */
  __IO uint32_t PTXSDUOR;                          /**< Port transmit SDU overhead register, offset: 0x10C */
  __IO uint32_t PTGSCR;                            /**< Port time gate scheduling control register, offset: 0x110 */
  __I  uint32_t PTGAGLSR;                          /**< Port time gate scheduling admin gate list status register, offset: 0x114 */
  __I  uint32_t PTGAGLLR;                          /**< Port time gate scheduling admin gate list length register, offset: 0x118 */
  __I  uint32_t PTGOGLLR;                          /**< Port time gating operational gate list length register, offset: 0x11C */
  __IO uint32_t PTGSATOR;                          /**< Port time gate scheduling advance time offset register, offset: 0x120, available only on: ENETC0_PORT, ENETC1_PORT (missing on SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4) */
  __I  uint32_t PTGSHAR;                           /**< Port time gate scheduling hold advance register, offset: 0x124, available only on: ENETC0_PORT, SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3 (missing on ENETC1_PORT, SW0_PORT4) */
  __I  uint32_t PTGSRAR;                           /**< Port time gate scheduling release advance register, offset: 0x128, available only on: ENETC0_PORT, SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3 (missing on ENETC1_PORT, SW0_PORT4) */
  __IO uint32_t PTGSHCR;                           /**< Port time gate scheduling hold configuration register, offset: 0x12C, available only on: ENETC0_PORT, SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3 (missing on ENETC1_PORT, SW0_PORT4) */
       uint8_t RESERVED_7[4];
  __IO uint32_t PFPCR;                             /**< Port frame preemption configuration register, offset: 0x134, available only on: ENETC0_PORT, SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3 (missing on ENETC1_PORT, SW0_PORT4) */
  __IO uint32_t PDGSR;                             /**< Port default gate state register, offset: 0x138 */
       uint8_t RESERVED_8[132];
  __I  uint32_t PRXDCR;                            /**< Port Rx discard count register, offset: 0x1C0 */
       uint8_t RESERVED_9[4];
  __IO uint32_t PRXDCRR0;                          /**< Port Rx discard count reason register 0, offset: 0x1C8 */
  __IO uint32_t PRXDCRR1;                          /**< Port Rx discard count reason register 1, offset: 0x1CC */
       uint8_t RESERVED_10[16];
  __I  uint32_t PTXDCR;                            /**< Port Tx discard count register, offset: 0x1E0, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_11[4];
  __IO uint32_t PTXDCRR0;                          /**< Port Tx discard count reason register 0, offset: 0x1E8, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
  __IO uint32_t PTXDCRR1;                          /**< Port Tx discard count reason register 1, offset: 0x1EC, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_12[16];
  struct {                                         /* offset: 0x200, array step: 0x20 */
         uint8_t RESERVED_0[8];
    __IO uint32_t PTCTMSDUR;                         /**< Port traffic class 0 transmit maximum SDU register..Port traffic class 7 transmit maximum SDU register, array offset: 0x208, array step: 0x20 */
         uint8_t RESERVED_1[4];
    __IO uint32_t PTCCBSR0;                          /**< Port transmit traffic class 0 credit based shaper register 0..Port transmit traffic class 7 credit based shaper register 0, array offset: 0x210, array step: 0x20 */
    __IO uint32_t PTCCBSR1;                          /**< Port traffic class 0 credit based shaper register 1..Port traffic class 7 credit based shaper register 1, array offset: 0x214, array step: 0x20 */
         uint8_t RESERVED_2[8];
  } TCT_NUM[8];
       uint8_t RESERVED_13[256];
  __IO uint32_t PBPMCR0;                           /**< Port buffer pool mapping configuration register 0, offset: 0x400, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
  __IO uint32_t PBPMCR1;                           /**< Port buffer pool mapping configuration register 1, offset: 0x404, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_14[48];
  __IO uint32_t PPCPDEIMR;                         /**< Port PCP DEI mapping register, offset: 0x438 */
       uint8_t RESERVED_15[4];
  __IO uint32_t PMCR;                              /**< Port mirror configuration register, offset: 0x440, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_16[12];
  __IO uint32_t PCTFCR;                            /**< Port cut through forwarding configuration register, offset: 0x450, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3 (missing on ENETC0_PORT, ENETC1_PORT, SW0_PORT4) */
       uint8_t RESERVED_17[4];
  __IO uint32_t PLANIDCR;                          /**< Port LANID configuration register, offset: 0x458, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_18[4];
  __IO uint32_t PISIDCR;                           /**< Port ingress stream identification configuration register, offset: 0x460 */
  __IO uint32_t PFMCR;                             /**< Port frame modification configuration register, offset: 0x464, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_19[8];
  __IO uint32_t PIPV2QMR0;                         /**< Port IPV to queue mapping register 0, offset: 0x470, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_20[60];
  __I  uint32_t PTCMINLR;                          /**< Port time capture minimum latency register, offset: 0x4B0, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
  __I  uint32_t PTCMAXLR;                          /**< Port time capture maximum latency register, offset: 0x4B4, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_21[72];
  __IO uint32_t BPCR;                              /**< Bridge port configuration register, offset: 0x500, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_22[12];
  __IO uint32_t BPDVR;                             /**< Bridge port default VLAN register, offset: 0x510, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_23[12];
  __IO uint32_t BPSTGSR;                           /**< Bridge port spanning tree group state register, offset: 0x520, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_24[4];
  __IO uint32_t BPSCR0;                            /**< Bridge port storm control register 0, offset: 0x528, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
  __IO uint32_t BPSCR1;                            /**< Bridge port storm control register 1, offset: 0x52C, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
  __I  uint32_t BPOR;                              /**< Bridge port operational register, offset: 0x530, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_25[76];
  __I  uint32_t BPDCR;                             /**< Bridge port discard count register, offset: 0x580, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
       uint8_t RESERVED_26[4];
  __IO uint32_t BPDCRR0;                           /**< Bridge port discard count reason register 0, offset: 0x588, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
  __IO uint32_t BPDCRR1;                           /**< Bridge port discard count reason register 1, offset: 0x58C, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
  __IO uint32_t BPMLFSR;                           /**< Bridge port MAC learning failure status register, offset: 0x590, available only on: SW0_PORT0, SW0_PORT1, SW0_PORT2, SW0_PORT3, SW0_PORT4 (missing on ENETC0_PORT, ENETC1_PORT) */
} NETC_PORT_Type;

/* ----------------------------------------------------------------------------
   -- NETC_PORT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_PORT_Register_Masks NETC_PORT Register Masks
 * @{
 */

