JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define NETC_PORT_PBPMCR1_IPV5_INDEX_MASK        (0xFF00U)
#define NETC_PORT_PBPMCR1_IPV5_INDEX_SHIFT       (8U)
#define NETC_PORT_PBPMCR1_IPV5_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR1_IPV5_INDEX_SHIFT)) & NETC_PORT_PBPMCR1_IPV5_INDEX_MASK)

#define NETC_PORT_PBPMCR1_IPV6_INDEX_MASK        (0xFF0000U)
#define NETC_PORT_PBPMCR1_IPV6_INDEX_SHIFT       (16U)
#define NETC_PORT_PBPMCR1_IPV6_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR1_IPV6_INDEX_SHIFT)) & NETC_PORT_PBPMCR1_IPV6_INDEX_MASK)

#define NETC_PORT_PBPMCR1_IPV7_INDEX_MASK        (0xFF000000U)
#define NETC_PORT_PBPMCR1_IPV7_INDEX_SHIFT       (24U)
#define NETC_PORT_PBPMCR1_IPV7_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PBPMCR1_IPV7_INDEX_SHIFT)) & NETC_PORT_PBPMCR1_IPV7_INDEX_MASK)
/*! @} */

/*! @name PPCPDEIMR - Port PCP DEI mapping register */
/*! @{ */

#define NETC_PORT_PPCPDEIMR_IPCPMP_MASK          (0xFU)
#define NETC_PORT_PPCPDEIMR_IPCPMP_SHIFT         (0U)
#define NETC_PORT_PPCPDEIMR_IPCPMP(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_IPCPMP_SHIFT)) & NETC_PORT_PPCPDEIMR_IPCPMP_MASK)

#define NETC_PORT_PPCPDEIMR_IPCPMPV_MASK         (0x80U)
#define NETC_PORT_PPCPDEIMR_IPCPMPV_SHIFT        (7U)
/*! IPCPMPV
 *  0b0..Ingress PCP to PCP Mapping Profile is not valid.
 *  0b1..Ingress frame modification of outer VLAN tag's PCP value is mapped to a new value based on IPCPMP instance
 */
#define NETC_PORT_PPCPDEIMR_IPCPMPV(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_IPCPMPV_SHIFT)) & NETC_PORT_PPCPDEIMR_IPCPMPV_MASK)

#define NETC_PORT_PPCPDEIMR_EPCPMP_MASK          (0xF00U)
#define NETC_PORT_PPCPDEIMR_EPCPMP_SHIFT         (8U)
#define NETC_PORT_PPCPDEIMR_EPCPMP(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_EPCPMP_SHIFT)) & NETC_PORT_PPCPDEIMR_EPCPMP_MASK)

#define NETC_PORT_PPCPDEIMR_EPCPMPV_MASK         (0x8000U)
#define NETC_PORT_PPCPDEIMR_EPCPMPV_SHIFT        (15U)
/*! EPCPMPV
 *  0b0..Egress PCP to PCP Mapping Profile is not valid.
 *  0b1..Egress frame modification of outer VLAN tag's PCP value is mapped to a new value based on EPCPMP instance.
 */
#define NETC_PORT_PPCPDEIMR_EPCPMPV(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_EPCPMPV_SHIFT)) & NETC_PORT_PPCPDEIMR_EPCPMPV_MASK)

#define NETC_PORT_PPCPDEIMR_DR0DEI_MASK          (0x10000U)
#define NETC_PORT_PPCPDEIMR_DR0DEI_SHIFT         (16U)
#define NETC_PORT_PPCPDEIMR_DR0DEI(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_DR0DEI_SHIFT)) & NETC_PORT_PPCPDEIMR_DR0DEI_MASK)

#define NETC_PORT_PPCPDEIMR_DR1DEI_MASK          (0x20000U)
#define NETC_PORT_PPCPDEIMR_DR1DEI_SHIFT         (17U)
#define NETC_PORT_PPCPDEIMR_DR1DEI(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_DR1DEI_SHIFT)) & NETC_PORT_PPCPDEIMR_DR1DEI_MASK)

#define NETC_PORT_PPCPDEIMR_DR2DEI_MASK          (0x40000U)
#define NETC_PORT_PPCPDEIMR_DR2DEI_SHIFT         (18U)
#define NETC_PORT_PPCPDEIMR_DR2DEI(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_DR2DEI_SHIFT)) & NETC_PORT_PPCPDEIMR_DR2DEI_MASK)

#define NETC_PORT_PPCPDEIMR_DR3DEI_MASK          (0x80000U)
#define NETC_PORT_PPCPDEIMR_DR3DEI_SHIFT         (19U)
#define NETC_PORT_PPCPDEIMR_DR3DEI(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_DR3DEI_SHIFT)) & NETC_PORT_PPCPDEIMR_DR3DEI_MASK)

#define NETC_PORT_PPCPDEIMR_DRME_MASK            (0x100000U)
#define NETC_PORT_PPCPDEIMR_DRME_SHIFT           (20U)
/*! DRME
 *  0b0..Preserve the DR value in the outer VLAN.
 *  0b1..Update DR value in the outer VLAN based on DEnDEI field.
 */
#define NETC_PORT_PPCPDEIMR_DRME(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PPCPDEIMR_DRME_SHIFT)) & NETC_PORT_PPCPDEIMR_DRME_MASK)
/*! @} */

/*! @name PMCR - Port mirror configuration register */
/*! @{ */

#define NETC_PORT_PMCR_IMIRE_MASK                (0x1U)
#define NETC_PORT_PMCR_IMIRE_SHIFT               (0U)
#define NETC_PORT_PMCR_IMIRE(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PMCR_IMIRE_SHIFT)) & NETC_PORT_PMCR_IMIRE_MASK)
/*! @} */

/*! @name PCTFCR - Port cut through forwarding configuration register */
/*! @{ */

#define NETC_PORT_PCTFCR_ICTS_MASK               (0x1U)
#define NETC_PORT_PCTFCR_ICTS_SHIFT              (0U)
#define NETC_PORT_PCTFCR_ICTS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCTFCR_ICTS_SHIFT)) & NETC_PORT_PCTFCR_ICTS_MASK)

#define NETC_PORT_PCTFCR_ECTS_MASK               (0x2U)
#define NETC_PORT_PCTFCR_ECTS_SHIFT              (1U)
#define NETC_PORT_PCTFCR_ECTS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PCTFCR_ECTS_SHIFT)) & NETC_PORT_PCTFCR_ECTS_MASK)
/*! @} */

/*! @name PLANIDCR - Port LANID configuration register */
/*! @{ */

#define NETC_PORT_PLANIDCR_LANID_MASK            (0xFU)
#define NETC_PORT_PLANIDCR_LANID_SHIFT           (0U)
/*! LANID - LAN Identifier */
#define NETC_PORT_PLANIDCR_LANID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PLANIDCR_LANID_SHIFT)) & NETC_PORT_PLANIDCR_LANID_MASK)
/*! @} */

/*! @name PISIDCR - Port ingress stream identification configuration register */
/*! @{ */

#define NETC_PORT_PISIDCR_KCPAIR_MASK            (0x1U)
#define NETC_PORT_PISIDCR_KCPAIR_SHIFT           (0U)
#define NETC_PORT_PISIDCR_KCPAIR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PISIDCR_KCPAIR_SHIFT)) & NETC_PORT_PISIDCR_KCPAIR_MASK)

#define NETC_PORT_PISIDCR_KC0EN_MASK             (0x2U)
#define NETC_PORT_PISIDCR_KC0EN_SHIFT            (1U)
/*! KC0EN - Key Construction 0 Enable */
#define NETC_PORT_PISIDCR_KC0EN(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PISIDCR_KC0EN_SHIFT)) & NETC_PORT_PISIDCR_KC0EN_MASK)

#define NETC_PORT_PISIDCR_KC1EN_MASK             (0x4U)
#define NETC_PORT_PISIDCR_KC1EN_SHIFT            (2U)
/*! KC1EN - Key Construction 1 Enable */
#define NETC_PORT_PISIDCR_KC1EN(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PISIDCR_KC1EN_SHIFT)) & NETC_PORT_PISIDCR_KC1EN_MASK)

#define NETC_PORT_PISIDCR_ISEID_MASK             (0xFFFF0000U)
#define NETC_PORT_PISIDCR_ISEID_SHIFT            (16U)
#define NETC_PORT_PISIDCR_ISEID(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PISIDCR_ISEID_SHIFT)) & NETC_PORT_PISIDCR_ISEID_MASK)
/*! @} */

/*! @name PFMCR - Port frame modification configuration register */
/*! @{ */

#define NETC_PORT_PFMCR_FMMA_MASK                (0x1U)
#define NETC_PORT_PFMCR_FMMA_SHIFT               (0U)
/*! FMMA - Frame Modification Misconfiguration Action
 *  0b0..Discard the frame and counted against the port's Tx discard count register (PTXDCR) along with the
 *       setting of the Frame Modification Misconfiguration Discard Reason (FMMDR) flag to 1 in the port's Tx discard
 *       count reason register 0 (PTXDCRR0).
 *  0b1..Transmit the frame without performing any of the ingress and egress frame modification actions specified.
 */
#define NETC_PORT_PFMCR_FMMA(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PFMCR_FMMA_SHIFT)) & NETC_PORT_PFMCR_FMMA_MASK)
/*! @} */

/*! @name PIPV2QMR0 - Port IPV to queue mapping register 0 */
/*! @{ */

#define NETC_PORT_PIPV2QMR0_IPV0_Q_MASK          (0xFU)
#define NETC_PORT_PIPV2QMR0_IPV0_Q_SHIFT         (0U)
#define NETC_PORT_PIPV2QMR0_IPV0_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV0_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV0_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV1_Q_MASK          (0xF0U)
#define NETC_PORT_PIPV2QMR0_IPV1_Q_SHIFT         (4U)
#define NETC_PORT_PIPV2QMR0_IPV1_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV1_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV1_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV2_Q_MASK          (0xF00U)
#define NETC_PORT_PIPV2QMR0_IPV2_Q_SHIFT         (8U)
#define NETC_PORT_PIPV2QMR0_IPV2_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV2_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV2_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV3_Q_MASK          (0xF000U)
#define NETC_PORT_PIPV2QMR0_IPV3_Q_SHIFT         (12U)
#define NETC_PORT_PIPV2QMR0_IPV3_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV3_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV3_Q_MASK)

