JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define NETC_PORT_PIPV2QMR0_IPV4_Q_MASK          (0xF0000U)
#define NETC_PORT_PIPV2QMR0_IPV4_Q_SHIFT         (16U)
#define NETC_PORT_PIPV2QMR0_IPV4_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV4_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV4_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV5_Q_MASK          (0xF00000U)
#define NETC_PORT_PIPV2QMR0_IPV5_Q_SHIFT         (20U)
#define NETC_PORT_PIPV2QMR0_IPV5_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV5_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV5_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV6_Q_MASK          (0xF000000U)
#define NETC_PORT_PIPV2QMR0_IPV6_Q_SHIFT         (24U)
#define NETC_PORT_PIPV2QMR0_IPV6_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV6_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV6_Q_MASK)

#define NETC_PORT_PIPV2QMR0_IPV7_Q_MASK          (0xF0000000U)
#define NETC_PORT_PIPV2QMR0_IPV7_Q_SHIFT         (28U)
#define NETC_PORT_PIPV2QMR0_IPV7_Q(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PIPV2QMR0_IPV7_Q_SHIFT)) & NETC_PORT_PIPV2QMR0_IPV7_Q_MASK)
/*! @} */

/*! @name PTCMINLR - Port time capture minimum latency register */
/*! @{ */

#define NETC_PORT_PTCMINLR_LATENCY_MASK          (0x3FFFFFFFU)
#define NETC_PORT_PTCMINLR_LATENCY_SHIFT         (0U)
#define NETC_PORT_PTCMINLR_LATENCY(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCMINLR_LATENCY_SHIFT)) & NETC_PORT_PTCMINLR_LATENCY_MASK)

#define NETC_PORT_PTCMINLR_COUNT_MASK            (0xC0000000U)
#define NETC_PORT_PTCMINLR_COUNT_SHIFT           (30U)
#define NETC_PORT_PTCMINLR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCMINLR_COUNT_SHIFT)) & NETC_PORT_PTCMINLR_COUNT_MASK)
/*! @} */

/*! @name PTCMAXLR - Port time capture maximum latency register */
/*! @{ */

#define NETC_PORT_PTCMAXLR_LATENCY_MASK          (0x3FFFFFFFU)
#define NETC_PORT_PTCMAXLR_LATENCY_SHIFT         (0U)
#define NETC_PORT_PTCMAXLR_LATENCY(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PORT_PTCMAXLR_LATENCY_SHIFT)) & NETC_PORT_PTCMAXLR_LATENCY_MASK)
/*! @} */

/*! @name BPCR - Bridge port configuration register */
/*! @{ */

#define NETC_PORT_BPCR_DYN_LIMIT_MASK            (0xFFFFU)
#define NETC_PORT_BPCR_DYN_LIMIT_SHIFT           (0U)
/*! DYN_LIMIT - Dynamic Limit */
#define NETC_PORT_BPCR_DYN_LIMIT(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_DYN_LIMIT_SHIFT)) & NETC_PORT_BPCR_DYN_LIMIT_MASK)

#define NETC_PORT_BPCR_UUCASTE_MASK              (0x1000000U)
#define NETC_PORT_BPCR_UUCASTE_SHIFT             (24U)
/*! UUCASTE - Unknown Unicast Storm Control Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_PORT_BPCR_UUCASTE(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_UUCASTE_SHIFT)) & NETC_PORT_BPCR_UUCASTE_MASK)

#define NETC_PORT_BPCR_UMCASTE_MASK              (0x2000000U)
#define NETC_PORT_BPCR_UMCASTE_SHIFT             (25U)
/*! UMCASTE - Unknown Multicast Storm Control Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_PORT_BPCR_UMCASTE(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_UMCASTE_SHIFT)) & NETC_PORT_BPCR_UMCASTE_MASK)

#define NETC_PORT_BPCR_MCASTE_MASK               (0x4000000U)
#define NETC_PORT_BPCR_MCASTE_SHIFT              (26U)
/*! MCASTE - Multicast Storm Control Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_PORT_BPCR_MCASTE(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_MCASTE_SHIFT)) & NETC_PORT_BPCR_MCASTE_MASK)

#define NETC_PORT_BPCR_BCASTE_MASK               (0x8000000U)
#define NETC_PORT_BPCR_BCASTE_SHIFT              (27U)
/*! BCASTE - Broadcast Storm Control Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_PORT_BPCR_BCASTE(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_BCASTE_SHIFT)) & NETC_PORT_BPCR_BCASTE_MASK)

#define NETC_PORT_BPCR_STAMVD_MASK               (0x10000000U)
#define NETC_PORT_BPCR_STAMVD_SHIFT              (28U)
/*! STAMVD - Station Move Disallow
 *  0b0..Allowed
 *  0b1..Disallowed. A received frame for which a MAC station move is detected, will be discarded.
 */
#define NETC_PORT_BPCR_STAMVD(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_STAMVD_SHIFT)) & NETC_PORT_BPCR_STAMVD_MASK)

#define NETC_PORT_BPCR_SRCPRND_MASK              (0x20000000U)
#define NETC_PORT_BPCR_SRCPRND_SHIFT             (29U)
/*! SRCPRND - Source Port Pruning Disable
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define NETC_PORT_BPCR_SRCPRND(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPCR_SRCPRND_SHIFT)) & NETC_PORT_BPCR_SRCPRND_MASK)
/*! @} */

/*! @name BPDVR - Bridge port default VLAN register */
/*! @{ */

#define NETC_PORT_BPDVR_VID_MASK                 (0xFFFU)
#define NETC_PORT_BPDVR_VID_SHIFT                (0U)
#define NETC_PORT_BPDVR_VID(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_VID_SHIFT)) & NETC_PORT_BPDVR_VID_MASK)

#define NETC_PORT_BPDVR_DEI_MASK                 (0x1000U)
#define NETC_PORT_BPDVR_DEI_SHIFT                (12U)
#define NETC_PORT_BPDVR_DEI(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_DEI_SHIFT)) & NETC_PORT_BPDVR_DEI_MASK)

#define NETC_PORT_BPDVR_PCP_MASK                 (0xE000U)
#define NETC_PORT_BPDVR_PCP_SHIFT                (13U)
#define NETC_PORT_BPDVR_PCP(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_PCP_SHIFT)) & NETC_PORT_BPDVR_PCP_MASK)

#define NETC_PORT_BPDVR_TPID_MASK                (0x10000U)
#define NETC_PORT_BPDVR_TPID_SHIFT               (16U)
#define NETC_PORT_BPDVR_TPID(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_TPID_SHIFT)) & NETC_PORT_BPDVR_TPID_MASK)

#define NETC_PORT_BPDVR_RXTAGA_MASK              (0xF00000U)
#define NETC_PORT_BPDVR_RXTAGA_SHIFT             (20U)
#define NETC_PORT_BPDVR_RXTAGA(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_RXTAGA_SHIFT)) & NETC_PORT_BPDVR_RXTAGA_MASK)

#define NETC_PORT_BPDVR_RXVAM_MASK               (0x1000000U)
#define NETC_PORT_BPDVR_RXVAM_SHIFT              (24U)
#define NETC_PORT_BPDVR_RXVAM(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_RXVAM_SHIFT)) & NETC_PORT_BPDVR_RXVAM_MASK)

#define NETC_PORT_BPDVR_TXTAGA_MASK              (0x6000000U)
#define NETC_PORT_BPDVR_TXTAGA_SHIFT             (25U)
#define NETC_PORT_BPDVR_TXTAGA(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PORT_BPDVR_TXTAGA_SHIFT)) & NETC_PORT_BPDVR_TXTAGA_MASK)
/*! @} */

/*! @name BPSTGSR - Bridge port spanning tree group state register */
/*! @{ */

