JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define NETC_SW_CCAR_CWRSNP_MASK                 (0x4000U)
#define NETC_SW_CCAR_CWRSNP_SHIFT                (14U)
#define NETC_SW_CCAR_CWRSNP(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CWRSNP_SHIFT)) & NETC_SW_CCAR_CWRSNP_MASK)

#define NETC_SW_CCAR_CBD_RDCACHE_MASK            (0xF0000U)
#define NETC_SW_CCAR_CBD_RDCACHE_SHIFT           (16U)
#define NETC_SW_CCAR_CBD_RDCACHE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CBD_RDCACHE_SHIFT)) & NETC_SW_CCAR_CBD_RDCACHE_MASK)

#define NETC_SW_CCAR_CBD_RDDOMAIN_MASK           (0x300000U)
#define NETC_SW_CCAR_CBD_RDDOMAIN_SHIFT          (20U)
#define NETC_SW_CCAR_CBD_RDDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CBD_RDDOMAIN_SHIFT)) & NETC_SW_CCAR_CBD_RDDOMAIN_MASK)

#define NETC_SW_CCAR_CBD_RDSNP_MASK              (0x400000U)
#define NETC_SW_CCAR_CBD_RDSNP_SHIFT             (22U)
#define NETC_SW_CCAR_CBD_RDSNP(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CBD_RDSNP_SHIFT)) & NETC_SW_CCAR_CBD_RDSNP_MASK)

#define NETC_SW_CCAR_CRDCACHE_MASK               (0xF000000U)
#define NETC_SW_CCAR_CRDCACHE_SHIFT              (24U)
#define NETC_SW_CCAR_CRDCACHE(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CRDCACHE_SHIFT)) & NETC_SW_CCAR_CRDCACHE_MASK)

#define NETC_SW_CCAR_CRDDOMAIN_MASK              (0x30000000U)
#define NETC_SW_CCAR_CRDDOMAIN_SHIFT             (28U)
#define NETC_SW_CCAR_CRDDOMAIN(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CRDDOMAIN_SHIFT)) & NETC_SW_CCAR_CRDDOMAIN_MASK)

#define NETC_SW_CCAR_CRDSNP_MASK                 (0x40000000U)
#define NETC_SW_CCAR_CRDSNP_SHIFT                (30U)
#define NETC_SW_CCAR_CRDSNP(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_SW_CCAR_CRDSNP_SHIFT)) & NETC_SW_CCAR_CRDSNP_MASK)
/*! @} */

/*! @name MPCR - Management port configuration register */
/*! @{ */

#define NETC_SW_MPCR_PORT_MASK                   (0x1FU)
#define NETC_SW_MPCR_PORT_SHIFT                  (0U)
#define NETC_SW_MPCR_PORT(x)                     (((uint32_t)(((uint32_t)(x)) << NETC_SW_MPCR_PORT_SHIFT)) & NETC_SW_MPCR_PORT_MASK)
/*! @} */

/*! @name IMDCR0 - Ingress mirror destination configuration register 0 */
/*! @{ */

#define NETC_SW_IMDCR0_MIREN_MASK                (0x1U)
#define NETC_SW_IMDCR0_MIREN_SHIFT               (0U)
/*! MIREN - Mirror enable.
 *  0b0..Ingress mirroring disabled
 *  0b1..Ingress mirroring enabled
 */
#define NETC_SW_IMDCR0_MIREN(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_SW_IMDCR0_MIREN_SHIFT)) & NETC_SW_IMDCR0_MIREN_MASK)

#define NETC_SW_IMDCR0_MIRDEST_MASK              (0x2U)
#define NETC_SW_IMDCR0_MIRDEST_SHIFT             (1U)
/*! MIRDEST - Indicates the mirror destination */
#define NETC_SW_IMDCR0_MIRDEST(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_IMDCR0_MIRDEST_SHIFT)) & NETC_SW_IMDCR0_MIRDEST_MASK)

#define NETC_SW_IMDCR0_IPV_MASK                  (0x1CU)
#define NETC_SW_IMDCR0_IPV_SHIFT                 (2U)
#define NETC_SW_IMDCR0_IPV(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_SW_IMDCR0_IPV_SHIFT)) & NETC_SW_IMDCR0_IPV_MASK)

#define NETC_SW_IMDCR0_DR_MASK                   (0xC0U)
#define NETC_SW_IMDCR0_DR_SHIFT                  (6U)
#define NETC_SW_IMDCR0_DR(x)                     (((uint32_t)(((uint32_t)(x)) << NETC_SW_IMDCR0_DR_SHIFT)) & NETC_SW_IMDCR0_DR_MASK)

#define NETC_SW_IMDCR0_PORT_MASK                 (0x1F00U)
#define NETC_SW_IMDCR0_PORT_SHIFT                (8U)
#define NETC_SW_IMDCR0_PORT(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_SW_IMDCR0_PORT_SHIFT)) & NETC_SW_IMDCR0_PORT_MASK)
/*! @} */

/*! @name IMDCR1 - Ingress mirror destination configuration register 1 */
/*! @{ */

#define NETC_SW_IMDCR1_EFMEID_MASK               (0xFFFFU)
#define NETC_SW_IMDCR1_EFMEID_SHIFT              (0U)
#define NETC_SW_IMDCR1_EFMEID(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_IMDCR1_EFMEID_SHIFT)) & NETC_SW_IMDCR1_EFMEID_MASK)

#define NETC_SW_IMDCR1_EFM_LEN_CHANGE_MASK       (0x7F0000U)
#define NETC_SW_IMDCR1_EFM_LEN_CHANGE_SHIFT      (16U)
#define NETC_SW_IMDCR1_EFM_LEN_CHANGE(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_IMDCR1_EFM_LEN_CHANGE_SHIFT)) & NETC_SW_IMDCR1_EFM_LEN_CHANGE_MASK)
/*! @} */

/*! @name CTFCR - Cut-through forwarding count register */
/*! @{ */

#define NETC_SW_CTFCR_COUNT_MASK                 (0xFFFFFFFFU)
#define NETC_SW_CTFCR_COUNT_SHIFT                (0U)
#define NETC_SW_CTFCR_COUNT(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_SW_CTFCR_COUNT_SHIFT)) & NETC_SW_CTFCR_COUNT_MASK)
/*! @} */

/*! @name CBDRMR - Command BDR 0 mode register..Command BDR 1 mode register */
/*! @{ */

#define NETC_SW_CBDRMR_EN_MASK                   (0x80000000U)
#define NETC_SW_CBDRMR_EN_SHIFT                  (31U)
/*! EN - Enable command buffer descriptor ring
 *  0b0..Disabled
 *  0b1..Enabled. When the ring is non-empty, command buffer descriptors will be processed
 */
#define NETC_SW_CBDRMR_EN(x)                     (((uint32_t)(((uint32_t)(x)) << NETC_SW_CBDRMR_EN_SHIFT)) & NETC_SW_CBDRMR_EN_MASK)
/*! @} */

/* The count of NETC_SW_CBDRMR */
#define NETC_SW_CBDRMR_COUNT                     (2U)

/*! @name CBDRSR - Command BDR 0 status register..Command BDR 1 status register */
/*! @{ */

#define NETC_SW_CBDRSR_BUSY_MASK                 (0x1U)
#define NETC_SW_CBDRSR_BUSY_SHIFT                (0U)
/*! BUSY - Busy.
 *  0b0..Idle
 *  0b1..Busy
 */
#define NETC_SW_CBDRSR_BUSY(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_SW_CBDRSR_BUSY_SHIFT)) & NETC_SW_CBDRSR_BUSY_MASK)
/*! @} */

/* The count of NETC_SW_CBDRSR */
#define NETC_SW_CBDRSR_COUNT                     (2U)

/*! @name CBDRBAR0 - Command BDR base address register 0 */
/*! @{ */

#define NETC_SW_CBDRBAR0_ADDRL_MASK              (0xFFFFFF80U)
#define NETC_SW_CBDRBAR0_ADDRL_SHIFT             (7U)
#define NETC_SW_CBDRBAR0_ADDRL(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_CBDRBAR0_ADDRL_SHIFT)) & NETC_SW_CBDRBAR0_ADDRL_MASK)
/*! @} */

/* The count of NETC_SW_CBDRBAR0 */
#define NETC_SW_CBDRBAR0_COUNT                   (2U)

