JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define NETC_SW_VFHTDECR0_IPMFLE_MASK            (0x40000000U)
#define NETC_SW_VFHTDECR0_IPMFLE_SHIFT           (30U)
/*! IPMFLE - IP Multicast Flooding Enable
 *  0b0..IP Multicast Flooding disabled, the frame is discarded.
 *  0b1..IP Multicast Flooding enabled, the frame is flooded.
 */
#define NETC_SW_VFHTDECR0_IPMFLE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR0_IPMFLE_SHIFT)) & NETC_SW_VFHTDECR0_IPMFLE_MASK)
/*! @} */

/*! @name VFHTDECR1 - VLAN filter hash table default entry configuration registers 1 */
/*! @{ */

#define NETC_SW_VFHTDECR1_FID_MASK               (0xFFFU)
#define NETC_SW_VFHTDECR1_FID_SHIFT              (0U)
#define NETC_SW_VFHTDECR1_FID(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR1_FID_SHIFT)) & NETC_SW_VFHTDECR1_FID_MASK)

#define NETC_SW_VFHTDECR1_VL_MODE_MASK           (0x1000U)
#define NETC_SW_VFHTDECR1_VL_MODE_SHIFT          (12U)
#define NETC_SW_VFHTDECR1_VL_MODE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR1_VL_MODE_SHIFT)) & NETC_SW_VFHTDECR1_VL_MODE_MASK)

#define NETC_SW_VFHTDECR1_BASE_ETEID_MASK        (0xFFFF0000U)
#define NETC_SW_VFHTDECR1_BASE_ETEID_SHIFT       (16U)
#define NETC_SW_VFHTDECR1_BASE_ETEID(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR1_BASE_ETEID_SHIFT)) & NETC_SW_VFHTDECR1_BASE_ETEID_MASK)
/*! @} */

/*! @name VFHTDECR2 - VLAN filter hash table default entry configuration registers 2 */
/*! @{ */

#define NETC_SW_VFHTDECR2_ET_PORT0_MASK          (0x1U)
#define NETC_SW_VFHTDECR2_ET_PORT0_SHIFT         (0U)
/*! ET_PORT0 - Egress Treatment Applicability Port n.
 *  0b0..Port has no entry in the Egress Treatment table
 *  0b1..Port has an entry in the Egress Treatment table
 */
#define NETC_SW_VFHTDECR2_ET_PORT0(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR2_ET_PORT0_SHIFT)) & NETC_SW_VFHTDECR2_ET_PORT0_MASK)

#define NETC_SW_VFHTDECR2_ET_PORT1_MASK          (0x2U)
#define NETC_SW_VFHTDECR2_ET_PORT1_SHIFT         (1U)
/*! ET_PORT1 - Egress Treatment Applicability Port n.
 *  0b0..Port has no entry in the Egress Treatment table
 *  0b1..Port has an entry in the Egress Treatment table
 */
#define NETC_SW_VFHTDECR2_ET_PORT1(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR2_ET_PORT1_SHIFT)) & NETC_SW_VFHTDECR2_ET_PORT1_MASK)

#define NETC_SW_VFHTDECR2_ET_PORT2_MASK          (0x4U)
#define NETC_SW_VFHTDECR2_ET_PORT2_SHIFT         (2U)
/*! ET_PORT2 - Egress Treatment Applicability Port n.
 *  0b0..Port has no entry in the Egress Treatment table
 *  0b1..Port has an entry in the Egress Treatment table
 */
#define NETC_SW_VFHTDECR2_ET_PORT2(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR2_ET_PORT2_SHIFT)) & NETC_SW_VFHTDECR2_ET_PORT2_MASK)

#define NETC_SW_VFHTDECR2_ET_PORT3_MASK          (0x8U)
#define NETC_SW_VFHTDECR2_ET_PORT3_SHIFT         (3U)
/*! ET_PORT3 - Egress Treatment Applicability Port n.
 *  0b0..Port has no entry in the Egress Treatment table
 *  0b1..Port has an entry in the Egress Treatment table
 */
#define NETC_SW_VFHTDECR2_ET_PORT3(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR2_ET_PORT3_SHIFT)) & NETC_SW_VFHTDECR2_ET_PORT3_MASK)

#define NETC_SW_VFHTDECR2_ET_PORT4_MASK          (0x10U)
#define NETC_SW_VFHTDECR2_ET_PORT4_SHIFT         (4U)
/*! ET_PORT4 - Egress Treatment Applicability Port n.
 *  0b0..Port has no entry in the Egress Treatment table
 *  0b1..Port has an entry in the Egress Treatment table
 */
#define NETC_SW_VFHTDECR2_ET_PORT4(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR2_ET_PORT4_SHIFT)) & NETC_SW_VFHTDECR2_ET_PORT4_MASK)

#define NETC_SW_VFHTDECR2_MLO_MASK               (0x7000000U)
#define NETC_SW_VFHTDECR2_MLO_SHIFT              (24U)
#define NETC_SW_VFHTDECR2_MLO(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR2_MLO_SHIFT)) & NETC_SW_VFHTDECR2_MLO_MASK)

#define NETC_SW_VFHTDECR2_MFO_MASK               (0x18000000U)
#define NETC_SW_VFHTDECR2_MFO_SHIFT              (27U)
#define NETC_SW_VFHTDECR2_MFO(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR2_MFO_SHIFT)) & NETC_SW_VFHTDECR2_MFO_MASK)
/*! @} */

/*! @name FDBHTCAPR - FDB hash table capability register */
/*! @{ */

#define NETC_SW_FDBHTCAPR_NUM_GMAC_MASK          (0x1FFU)
#define NETC_SW_FDBHTCAPR_NUM_GMAC_SHIFT         (0U)
#define NETC_SW_FDBHTCAPR_NUM_GMAC(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_FDBHTCAPR_NUM_GMAC_SHIFT)) & NETC_SW_FDBHTCAPR_NUM_GMAC_MASK)

#define NETC_SW_FDBHTCAPR_ACCESS_METH_MASK       (0xF00000U)
#define NETC_SW_FDBHTCAPR_ACCESS_METH_SHIFT      (20U)
#define NETC_SW_FDBHTCAPR_ACCESS_METH(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_FDBHTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_FDBHTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name FDBHTMCR - FDB hash table memory configuration register */
/*! @{ */

#define NETC_SW_FDBHTMCR_DYN_LIMIT_MASK          (0xFFFFU)
#define NETC_SW_FDBHTMCR_DYN_LIMIT_SHIFT         (0U)
#define NETC_SW_FDBHTMCR_DYN_LIMIT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_FDBHTMCR_DYN_LIMIT_SHIFT)) & NETC_SW_FDBHTMCR_DYN_LIMIT_MASK)
/*! @} */

/*! @name FDBHTOR0 - FDB hash table operational register 0 */
/*! @{ */

#define NETC_SW_FDBHTOR0_STATIC_ENTRIES_MASK     (0xFFFFU)
#define NETC_SW_FDBHTOR0_STATIC_ENTRIES_SHIFT    (0U)
#define NETC_SW_FDBHTOR0_STATIC_ENTRIES(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_FDBHTOR0_STATIC_ENTRIES_SHIFT)) & NETC_SW_FDBHTOR0_STATIC_ENTRIES_MASK)

#define NETC_SW_FDBHTOR0_NUM_GENTRIES_MASK       (0x1FF0000U)
#define NETC_SW_FDBHTOR0_NUM_GENTRIES_SHIFT      (16U)
#define NETC_SW_FDBHTOR0_NUM_GENTRIES(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_FDBHTOR0_NUM_GENTRIES_SHIFT)) & NETC_SW_FDBHTOR0_NUM_GENTRIES_MASK)
/*! @} */

/*! @name FDBHTOR1 - FDB hash table operational register 1 */
/*! @{ */

#define NETC_SW_FDBHTOR1_DYN_ENTRIES_MASK        (0xFFFFU)
#define NETC_SW_FDBHTOR1_DYN_ENTRIES_SHIFT       (0U)
#define NETC_SW_FDBHTOR1_DYN_ENTRIES(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_FDBHTOR1_DYN_ENTRIES_SHIFT)) & NETC_SW_FDBHTOR1_DYN_ENTRIES_MASK)

#define NETC_SW_FDBHTOR1_HWM_DYN_ENTRIES_MASK    (0xFFFF0000U)
#define NETC_SW_FDBHTOR1_HWM_DYN_ENTRIES_SHIFT   (16U)
#define NETC_SW_FDBHTOR1_HWM_DYN_ENTRIES(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_FDBHTOR1_HWM_DYN_ENTRIES_SHIFT)) & NETC_SW_FDBHTOR1_HWM_DYN_ENTRIES_MASK)
/*! @} */

/*! @name IPMFHTCAPR - IP multicast filter hash table capability register */
/*! @{ */

#define NETC_SW_IPMFHTCAPR_ACCESS_METH_MASK      (0xF00000U)
#define NETC_SW_IPMFHTCAPR_ACCESS_METH_SHIFT     (20U)
#define NETC_SW_IPMFHTCAPR_ACCESS_METH(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_IPMFHTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_IPMFHTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name IPV4MFHTOR - IPv4 multicast filter hash table operation register */
/*! @{ */

#define NETC_SW_IPV4MFHTOR_ASM_ENTRIES_MASK      (0xFFFFU)
#define NETC_SW_IPV4MFHTOR_ASM_ENTRIES_SHIFT     (0U)
#define NETC_SW_IPV4MFHTOR_ASM_ENTRIES(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_IPV4MFHTOR_ASM_ENTRIES_SHIFT)) & NETC_SW_IPV4MFHTOR_ASM_ENTRIES_MASK)

#define NETC_SW_IPV4MFHTOR_SSM_ENTRIES_MASK      (0xFFFF0000U)
#define NETC_SW_IPV4MFHTOR_SSM_ENTRIES_SHIFT     (16U)
#define NETC_SW_IPV4MFHTOR_SSM_ENTRIES(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_IPV4MFHTOR_SSM_ENTRIES_SHIFT)) & NETC_SW_IPV4MFHTOR_SSM_ENTRIES_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group NETC_SW_Register_Masks */


/* NETC_SW - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SW0_BASE base address */
  #define SW0_BASE_BASE                            (0x70A00000u)
  /** Peripheral SW0_BASE base address */
  #define SW0_BASE_BASE_NS                         (0x60A00000u)
  /** Peripheral SW0_BASE base pointer */
  #define SW0_BASE                                 ((NETC_SW_Type *)SW0_BASE_BASE)
  /** Peripheral SW0_BASE base pointer */
  #define SW0_BASE_NS                              ((NETC_SW_Type *)SW0_BASE_BASE_NS)
  /** Array initializer of NETC_SW peripheral base addresses */
  #define NETC_SW_BASE_ADDRS                       { SW0_BASE_BASE }
  /** Array initializer of NETC_SW peripheral base pointers */
  #define NETC_SW_BASE_PTRS                        { SW0_BASE }
  /** Array initializer of NETC_SW peripheral base addresses */
  #define NETC_SW_BASE_ADDRS_NS                    { SW0_BASE_BASE_NS }
  /** Array initializer of NETC_SW peripheral base pointers */
  #define NETC_SW_BASE_PTRS_NS                     { SW0_BASE_NS }
#else
  /** Peripheral SW0_BASE base address */
  #define SW0_BASE_BASE                            (0x60A00000u)
  /** Peripheral SW0_BASE base pointer */
  #define SW0_BASE                                 ((NETC_SW_Type *)SW0_BASE_BASE)
  /** Array initializer of NETC_SW peripheral base addresses */
  #define NETC_SW_BASE_ADDRS                       { SW0_BASE_BASE }
  /** Array initializer of NETC_SW peripheral base pointers */
  #define NETC_SW_BASE_PTRS                        { SW0_BASE }
#endif

/*!
 * @}
 */ /* end of group NETC_SW_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- NETC_SW_ENETC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_SW_ENETC_Peripheral_Access_Layer NETC_SW_ENETC Peripheral Access Layer
 * @{
 */

