JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name IPCAPR - Ingress port capability register */
/*! @{ */

#define NETC_SW_ENETC_IPCAPR_RP_MASK             (0x1U)
#define NETC_SW_ENETC_IPCAPR_RP_SHIFT            (0U)
#define NETC_SW_ENETC_IPCAPR_RP(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPCAPR_RP_SHIFT)) & NETC_SW_ENETC_IPCAPR_RP_MASK)

#define NETC_SW_ENETC_IPCAPR_IPFLT_MASK          (0x2U)
#define NETC_SW_ENETC_IPCAPR_IPFLT_SHIFT         (1U)
#define NETC_SW_ENETC_IPCAPR_IPFLT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPCAPR_IPFLT_SHIFT)) & NETC_SW_ENETC_IPCAPR_IPFLT_MASK)

#define NETC_SW_ENETC_IPCAPR_ISID_MASK           (0x4U)
#define NETC_SW_ENETC_IPCAPR_ISID_SHIFT          (2U)
#define NETC_SW_ENETC_IPCAPR_ISID(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPCAPR_ISID_SHIFT)) & NETC_SW_ENETC_IPCAPR_ISID_MASK)

#define NETC_SW_ENETC_IPCAPR_SDU_MASK            (0x1F00U)
#define NETC_SW_ENETC_IPCAPR_SDU_SHIFT           (8U)
/*! SDU - Indicates support for various PDU/SDUs (Protocol/Service Data Unit) definitions. */
#define NETC_SW_ENETC_IPCAPR_SDU(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPCAPR_SDU_SHIFT)) & NETC_SW_ENETC_IPCAPR_SDU_MASK)

#define NETC_SW_ENETC_IPCAPR_NUM_VQMP_MASK       (0xF0000U)
#define NETC_SW_ENETC_IPCAPR_NUM_VQMP_SHIFT      (16U)
#define NETC_SW_ENETC_IPCAPR_NUM_VQMP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IPCAPR_NUM_VQMP_SHIFT)) & NETC_SW_ENETC_IPCAPR_NUM_VQMP_MASK)
/*! @} */

/*! @name EPCAPR - Egress port capability register */
/*! @{ */

#define NETC_SW_ENETC_EPCAPR_ET_MASK             (0x1U)
#define NETC_SW_ENETC_EPCAPR_ET_SHIFT            (0U)
#define NETC_SW_ENETC_EPCAPR_ET(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_EPCAPR_ET_SHIFT)) & NETC_SW_ENETC_EPCAPR_ET_MASK)

#define NETC_SW_ENETC_EPCAPR_SDU_MASK            (0x1F00U)
#define NETC_SW_ENETC_EPCAPR_SDU_SHIFT           (8U)
/*! SDU - Indicates support for various PDU/SDUs (Protocol/Service Data Unit) definitions. */
#define NETC_SW_ENETC_EPCAPR_SDU(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_EPCAPR_SDU_SHIFT)) & NETC_SW_ENETC_EPCAPR_SDU_MASK)

#define NETC_SW_ENETC_EPCAPR_NUM_QVMP_MASK       (0xF0000U)
#define NETC_SW_ENETC_EPCAPR_NUM_QVMP_SHIFT      (16U)
#define NETC_SW_ENETC_EPCAPR_NUM_QVMP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_EPCAPR_NUM_QVMP_SHIFT)) & NETC_SW_ENETC_EPCAPR_NUM_QVMP_MASK)
/*! @} */

/*! @name OSR - Operational state register */
/*! @{ */

#define NETC_SW_ENETC_OSR_STATE_MASK             (0x1U)
#define NETC_SW_ENETC_OSR_STATE_SHIFT            (0U)
#define NETC_SW_ENETC_OSR_STATE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_OSR_STATE_SHIFT)) & NETC_SW_ENETC_OSR_STATE_MASK)

#define NETC_SW_ENETC_OSR_ITM_STATE_MASK         (0x2U)
#define NETC_SW_ENETC_OSR_ITM_STATE_SHIFT        (1U)
#define NETC_SW_ENETC_OSR_ITM_STATE(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_OSR_ITM_STATE_SHIFT)) & NETC_SW_ENETC_OSR_ITM_STATE_MASK)
/*! @} */

/*! @name CMECR - Correctable memory error configuration register */
/*! @{ */

#define NETC_SW_ENETC_CMECR_THRESHOLD_MASK       (0xFFU)
#define NETC_SW_ENETC_CMECR_THRESHOLD_SHIFT      (0U)
/*! THRESHOLD - Threshold */
#define NETC_SW_ENETC_CMECR_THRESHOLD(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_CMECR_THRESHOLD_SHIFT)) & NETC_SW_ENETC_CMECR_THRESHOLD_MASK)
/*! @} */

/*! @name CMESR - Correctable memory error status register */
/*! @{ */

#define NETC_SW_ENETC_CMESR_MEM_ID_MASK          (0x1F0000U)
#define NETC_SW_ENETC_CMESR_MEM_ID_SHIFT         (16U)
/*! MEM_ID - Memory ID */
#define NETC_SW_ENETC_CMESR_MEM_ID(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_CMESR_MEM_ID_SHIFT)) & NETC_SW_ENETC_CMESR_MEM_ID_MASK)

#define NETC_SW_ENETC_CMESR_SBEE_MASK            (0x80000000U)
#define NETC_SW_ENETC_CMESR_SBEE_SHIFT           (31U)
/*! SBEE - Single-bit ECC error */
#define NETC_SW_ENETC_CMESR_SBEE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_CMESR_SBEE_SHIFT)) & NETC_SW_ENETC_CMESR_SBEE_MASK)
/*! @} */

/*! @name CMECTR - Correctable memory error count register */
/*! @{ */

#define NETC_SW_ENETC_CMECTR_COUNT_MASK          (0xFFU)
#define NETC_SW_ENETC_CMECTR_COUNT_SHIFT         (0U)
/*! COUNT - Count */
#define NETC_SW_ENETC_CMECTR_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_CMECTR_COUNT_SHIFT)) & NETC_SW_ENETC_CMECTR_COUNT_MASK)
/*! @} */

/*! @name UNMACECR - Uncorrectable non-fatal MAC error configuration register */
/*! @{ */

#define NETC_SW_ENETC_UNMACECR_PORT0_MASK        (0x1U)
#define NETC_SW_ENETC_UNMACECR_PORT0_SHIFT       (0U)
/*! PORT0 - Report disable port */
#define NETC_SW_ENETC_UNMACECR_PORT0(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMACECR_PORT0_SHIFT)) & NETC_SW_ENETC_UNMACECR_PORT0_MASK)

#define NETC_SW_ENETC_UNMACECR_PORT1_MASK        (0x2U)
#define NETC_SW_ENETC_UNMACECR_PORT1_SHIFT       (1U)
/*! PORT1 - Report disable port */
#define NETC_SW_ENETC_UNMACECR_PORT1(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMACECR_PORT1_SHIFT)) & NETC_SW_ENETC_UNMACECR_PORT1_MASK)

#define NETC_SW_ENETC_UNMACECR_PORT2_MASK        (0x4U)
#define NETC_SW_ENETC_UNMACECR_PORT2_SHIFT       (2U)
/*! PORT2 - Report disable port */
#define NETC_SW_ENETC_UNMACECR_PORT2(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMACECR_PORT2_SHIFT)) & NETC_SW_ENETC_UNMACECR_PORT2_MASK)

#define NETC_SW_ENETC_UNMACECR_PORT3_MASK        (0x8U)
#define NETC_SW_ENETC_UNMACECR_PORT3_SHIFT       (3U)
/*! PORT3 - Report disable port */
#define NETC_SW_ENETC_UNMACECR_PORT3(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMACECR_PORT3_SHIFT)) & NETC_SW_ENETC_UNMACECR_PORT3_MASK)

#define NETC_SW_ENETC_UNMACECR_PORT4_MASK        (0x10U)
#define NETC_SW_ENETC_UNMACECR_PORT4_SHIFT       (4U)
/*! PORT4 - Report disable port */
#define NETC_SW_ENETC_UNMACECR_PORT4(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UNMACECR_PORT4_SHIFT)) & NETC_SW_ENETC_UNMACECR_PORT4_MASK)
/*! @} */

