JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name FMDITMAR - Frame modification data index table memory allocation register */
/*! @{ */

#define NETC_SW_ENETC_FMDITMAR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_ENETC_FMDITMAR_NUM_WORDS_SHIFT   (0U)
#define NETC_SW_ENETC_FMDITMAR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_FMDITMAR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_FMDITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ETCAPR - Egress treatment capability register */
/*! @{ */

#define NETC_SW_ENETC_ETCAPR_ESQR_MASK           (0x1U)
#define NETC_SW_ENETC_ETCAPR_ESQR_SHIFT          (0U)
/*! ESQR - Egress Sequence Recovery supported */
#define NETC_SW_ENETC_ETCAPR_ESQR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ETCAPR_ESQR_SHIFT)) & NETC_SW_ENETC_ETCAPR_ESQR_MASK)
/*! @} */

/*! @name ETTCAPR - Egress treatment table capability register */
/*! @{ */

#define NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_MASK   (0xFFFFU)
#define NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_SHIFT  (0U)
#define NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_ETTCAPR_ACCESS_METH_MASK   (0xF00000U)
#define NETC_SW_ENETC_ETTCAPR_ACCESS_METH_SHIFT  (20U)
#define NETC_SW_ENETC_ETTCAPR_ACCESS_METH(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ETTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ETTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name ETTOR - Egress treatment table operational register */
/*! @{ */

#define NETC_SW_ENETC_ETTOR_NUM_ENTRIES_MASK     (0xFFFFU)
#define NETC_SW_ENETC_ETTOR_NUM_ENTRIES_SHIFT    (0U)
#define NETC_SW_ENETC_ETTOR_NUM_ENTRIES(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ETTOR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ETTOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name TGSTCAPR - Time gate scheduling table capability register */
/*! @{ */

#define NETC_SW_ENETC_TGSTCAPR_NUM_WORDS_MASK    (0xFFFFU)
#define NETC_SW_ENETC_TGSTCAPR_NUM_WORDS_SHIFT   (0U)
/*! NUM_WORDS - Number of Words */
#define NETC_SW_ENETC_TGSTCAPR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TGSTCAPR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_TGSTCAPR_NUM_WORDS_MASK)

#define NETC_SW_ENETC_TGSTCAPR_ACCESS_METH_MASK  (0xF00000U)
#define NETC_SW_ENETC_TGSTCAPR_ACCESS_METH_SHIFT (20U)
/*! ACCESS_METH - Access Method
 *  0bxxx1..Index
 *  0bxx1x..EntryId
 *  0bx1xx..Search
 *  0b1xxx..
 */
#define NETC_SW_ENETC_TGSTCAPR_ACCESS_METH(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TGSTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_TGSTCAPR_ACCESS_METH_MASK)

#define NETC_SW_ENETC_TGSTCAPR_MAX_GCL_LEN_MASK  (0x3000000U)
#define NETC_SW_ENETC_TGSTCAPR_MAX_GCL_LEN_SHIFT (24U)
/*! MAX_GCL_LEN - Maximum Gate Control List Length
 *  0b00..64
 *  0b01..128
 *  0b10..256
 *  0b11..
 */
#define NETC_SW_ENETC_TGSTCAPR_MAX_GCL_LEN(x)    (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TGSTCAPR_MAX_GCL_LEN_SHIFT)) & NETC_SW_ENETC_TGSTCAPR_MAX_GCL_LEN_MASK)
/*! @} */

/*! @name TGSTMOR - Time gate scheduling table memory operation register */
/*! @{ */

#define NETC_SW_ENETC_TGSTMOR_NUM_WORDS_MASK     (0xFFFFU)
#define NETC_SW_ENETC_TGSTMOR_NUM_WORDS_SHIFT    (0U)
#define NETC_SW_ENETC_TGSTMOR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TGSTMOR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_TGSTMOR_NUM_WORDS_MASK)
/*! @} */

/*! @name ESQRCAPR - Egress sequence recovery capability register */
/*! @{ */

#define NETC_SW_ENETC_ESQRCAPR_SQR_TYPE_MASK     (0x3U)
#define NETC_SW_ENETC_ESQRCAPR_SQR_TYPE_SHIFT    (0U)
#define NETC_SW_ENETC_ESQRCAPR_SQR_TYPE(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ESQRCAPR_SQR_TYPE_SHIFT)) & NETC_SW_ENETC_ESQRCAPR_SQR_TYPE_MASK)

#define NETC_SW_ENETC_ESQRCAPR_SQR_ALG_MASK      (0xCU)
#define NETC_SW_ENETC_ESQRCAPR_SQR_ALG_SHIFT     (2U)
#define NETC_SW_ENETC_ESQRCAPR_SQR_ALG(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ESQRCAPR_SQR_ALG_SHIFT)) & NETC_SW_ENETC_ESQRCAPR_SQR_ALG_MASK)

#define NETC_SW_ENETC_ESQRCAPR_SQR_MAX_HL_MASK   (0x700U)
#define NETC_SW_ENETC_ESQRCAPR_SQR_MAX_HL_SHIFT  (8U)
#define NETC_SW_ENETC_ESQRCAPR_SQR_MAX_HL(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ESQRCAPR_SQR_MAX_HL_SHIFT)) & NETC_SW_ENETC_ESQRCAPR_SQR_MAX_HL_MASK)
/*! @} */

/*! @name ESQRTCAPR - Egress sequence recovery table capability register */
/*! @{ */

#define NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_ESQRTCAPR_ACCESS_METH_MASK (0xF00000U)
#define NETC_SW_ENETC_ESQRTCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_ESQRTCAPR_ACCESS_METH(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ESQRTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ESQRTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name ECTCAPR - Egress counter table capability register */
/*! @{ */

#define NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES_MASK   (0xFFFFU)
#define NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES_SHIFT  (0U)
#define NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_ECTCAPR_ACCESS_METH_MASK   (0xF00000U)
#define NETC_SW_ENETC_ECTCAPR_ACCESS_METH_SHIFT  (20U)
#define NETC_SW_ENETC_ECTCAPR_ACCESS_METH(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ECTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ECTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name HTMCAPR - Hash table memory capability register */
/*! @{ */

#define NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK     (0xFFFFU)
#define NETC_SW_ENETC_HTMCAPR_NUM_WORDS_SHIFT    (0U)
#define NETC_SW_ENETC_HTMCAPR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_HTMCAPR_NUM_WORDS_SHIFT)) & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK)

#define NETC_SW_ENETC_HTMCAPR_WORD_SIZE_MASK     (0x30000000U)
#define NETC_SW_ENETC_HTMCAPR_WORD_SIZE_SHIFT    (28U)
#define NETC_SW_ENETC_HTMCAPR_WORD_SIZE(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_HTMCAPR_WORD_SIZE_SHIFT)) & NETC_SW_ENETC_HTMCAPR_WORD_SIZE_MASK)

#define NETC_SW_ENETC_HTMCAPR_MLOC_MASK          (0xC0000000U)
#define NETC_SW_ENETC_HTMCAPR_MLOC_SHIFT         (30U)
#define NETC_SW_ENETC_HTMCAPR_MLOC(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_HTMCAPR_MLOC_SHIFT)) & NETC_SW_ENETC_HTMCAPR_MLOC_MASK)
/*! @} */

/*! @name HTMOR - Hash table memory operational register */
/*! @{ */

#define NETC_SW_ENETC_HTMOR_AMOUNT_MASK          (0xFFFFU)
#define NETC_SW_ENETC_HTMOR_AMOUNT_SHIFT         (0U)
#define NETC_SW_ENETC_HTMOR_AMOUNT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_HTMOR_AMOUNT_SHIFT)) & NETC_SW_ENETC_HTMOR_AMOUNT_MASK)

#define NETC_SW_ENETC_HTMOR_WATERMARK_MASK       (0xFFFF0000U)
#define NETC_SW_ENETC_HTMOR_WATERMARK_SHIFT      (16U)
#define NETC_SW_ENETC_HTMOR_WATERMARK(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_HTMOR_WATERMARK_SHIFT)) & NETC_SW_ENETC_HTMOR_WATERMARK_MASK)
/*! @} */

/*! @name ISIDCAPR - Ingress stream identification capability register */
/*! @{ */

#define NETC_SW_ENETC_ISIDCAPR_NUM_KC_MASK       (0x3U)
#define NETC_SW_ENETC_ISIDCAPR_NUM_KC_SHIFT      (0U)
#define NETC_SW_ENETC_ISIDCAPR_NUM_KC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDCAPR_NUM_KC_SHIFT)) & NETC_SW_ENETC_ISIDCAPR_NUM_KC_MASK)

#define NETC_SW_ENETC_ISIDCAPR_NUM_PF_MASK       (0x1CU)
#define NETC_SW_ENETC_ISIDCAPR_NUM_PF_SHIFT      (2U)
#define NETC_SW_ENETC_ISIDCAPR_NUM_PF(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDCAPR_NUM_PF_SHIFT)) & NETC_SW_ENETC_ISIDCAPR_NUM_PF_MASK)

#define NETC_SW_ENETC_ISIDCAPR_MAX_KSIZE_MASK    (0x1F00U)
#define NETC_SW_ENETC_ISIDCAPR_MAX_KSIZE_SHIFT   (8U)
#define NETC_SW_ENETC_ISIDCAPR_MAX_KSIZE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDCAPR_MAX_KSIZE_SHIFT)) & NETC_SW_ENETC_ISIDCAPR_MAX_KSIZE_MASK)

#define NETC_SW_ENETC_ISIDCAPR_UFT_MASK          (0x10000U)
#define NETC_SW_ENETC_ISIDCAPR_UFT_SHIFT         (16U)
#define NETC_SW_ENETC_ISIDCAPR_UFT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDCAPR_UFT_SHIFT)) & NETC_SW_ENETC_ISIDCAPR_UFT_MASK)

#define NETC_SW_ENETC_ISIDCAPR_ETHFT_MASK        (0x20000U)
#define NETC_SW_ENETC_ISIDCAPR_ETHFT_SHIFT       (17U)
#define NETC_SW_ENETC_ISIDCAPR_ETHFT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDCAPR_ETHFT_SHIFT)) & NETC_SW_ENETC_ISIDCAPR_ETHFT_MASK)
/*! @} */

/*! @name ISIDHTCAPR - Ingress stream identification hash table capability register */
/*! @{ */

#define NETC_SW_ENETC_ISIDHTCAPR_ACCESS_METH_MASK (0xF00000U)
#define NETC_SW_ENETC_ISIDHTCAPR_ACCESS_METH_SHIFT (20U)
#define NETC_SW_ENETC_ISIDHTCAPR_ACCESS_METH(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDHTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_ENETC_ISIDHTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name ISIDKC0OR - Ingress stream identification key construction 0 operational register */
/*! @{ */

