JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name OTP_SHADOW_PARTA - OTP shadow register */
/*! @{ */

#define OCOTP_FSB_OTP_SHADOW_PARTA_SHADOW_MASK   (0xFFFFFFFFU)
#define OCOTP_FSB_OTP_SHADOW_PARTA_SHADOW_SHIFT  (0U)
/*! SHADOW - OTP shadow register, fsb have read access of shadow 0-51 (offset should be 0*4-51*4) */
#define OCOTP_FSB_OTP_SHADOW_PARTA_SHADOW(x)     (((uint32_t)(((uint32_t)(x)) << OCOTP_FSB_OTP_SHADOW_PARTA_SHADOW_SHIFT)) & OCOTP_FSB_OTP_SHADOW_PARTA_SHADOW_MASK)
/*! @} */

/* The count of OCOTP_FSB_OTP_SHADOW_PARTA */
#define OCOTP_FSB_OTP_SHADOW_PARTA_COUNT         (52U)

/*! @name OTP_SHADOW_PARTB - OTP shadow register */
/*! @{ */

#define OCOTP_FSB_OTP_SHADOW_PARTB_SHADOW_MASK   (0xFFFFFFFFU)
#define OCOTP_FSB_OTP_SHADOW_PARTB_SHADOW_SHIFT  (0U)
/*! SHADOW - OTP shadow register, fsb have read access of shadow 312-511 (offset should be 312*4-511*4) */
#define OCOTP_FSB_OTP_SHADOW_PARTB_SHADOW(x)     (((uint32_t)(((uint32_t)(x)) << OCOTP_FSB_OTP_SHADOW_PARTB_SHADOW_SHIFT)) & OCOTP_FSB_OTP_SHADOW_PARTB_SHADOW_MASK)
/*! @} */

/* The count of OCOTP_FSB_OTP_SHADOW_PARTB */
#define OCOTP_FSB_OTP_SHADOW_PARTB_COUNT         (200U)


/*!
 * @}
 */ /* end of group OCOTP_FSB_Register_Masks */


/* OCOTP_FSB - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral OCOTP_FSB base address */
  #define OCOTP_FSB_BASE                           (0x57518000u)
  /** Peripheral OCOTP_FSB base address */
  #define OCOTP_FSB_BASE_NS                        (0x47518000u)
  /** Peripheral OCOTP_FSB base pointer */
  #define OCOTP_FSB                                ((OCOTP_FSB_Type *)OCOTP_FSB_BASE)
  /** Peripheral OCOTP_FSB base pointer */
  #define OCOTP_FSB_NS                             ((OCOTP_FSB_Type *)OCOTP_FSB_BASE_NS)
  /** Array initializer of OCOTP_FSB peripheral base addresses */
  #define OCOTP_FSB_BASE_ADDRS                     { OCOTP_FSB_BASE }
  /** Array initializer of OCOTP_FSB peripheral base pointers */
  #define OCOTP_FSB_BASE_PTRS                      { OCOTP_FSB }
  /** Array initializer of OCOTP_FSB peripheral base addresses */
  #define OCOTP_FSB_BASE_ADDRS_NS                  { OCOTP_FSB_BASE_NS }
  /** Array initializer of OCOTP_FSB peripheral base pointers */
  #define OCOTP_FSB_BASE_PTRS_NS                   { OCOTP_FSB_NS }
#else
  /** Peripheral OCOTP_FSB base address */
  #define OCOTP_FSB_BASE                           (0x47518000u)
  /** Peripheral OCOTP_FSB base pointer */
  #define OCOTP_FSB                                ((OCOTP_FSB_Type *)OCOTP_FSB_BASE)
  /** Array initializer of OCOTP_FSB peripheral base addresses */
  #define OCOTP_FSB_BASE_ADDRS                     { OCOTP_FSB_BASE }
  /** Array initializer of OCOTP_FSB peripheral base pointers */
  #define OCOTP_FSB_BASE_PTRS                      { OCOTP_FSB }
#endif

/*!
 * @}
 */ /* end of group OCOTP_FSB_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- OSC_RC_400M Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSC_RC_400M_Peripheral_Access_Layer OSC_RC_400M Peripheral Access Layer
 * @{
 */

/** OSC_RC_400M - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0 */
    __IO uint32_t RW;                                /**< Analog Control Register CTRL0, offset: 0x0 */
    __IO uint32_t SET;                               /**< Analog Control Register CTRL0, offset: 0x4 */
    __IO uint32_t CLR;                               /**< Analog Control Register CTRL0, offset: 0x8 */
    __IO uint32_t TOG;                               /**< Analog Control Register CTRL0, offset: 0xC */
  } CTRL0;
  struct {                                         /* offset: 0x10 */
    __IO uint32_t RW;                                /**< Analog Control Register CTRL0, offset: 0x10 */
    __IO uint32_t SET;                               /**< Analog Control Register CTRL0, offset: 0x14 */
    __IO uint32_t CLR;                               /**< Analog Control Register CTRL0, offset: 0x18 */
    __IO uint32_t TOG;                               /**< Analog Control Register CTRL0, offset: 0x1C */
  } CTRL1;
  struct {                                         /* offset: 0x20 */
    __IO uint32_t RW;                                /**< Analog Control Register CTRL0, offset: 0x20 */
    __IO uint32_t SET;                               /**< Analog Control Register CTRL0, offset: 0x24 */
    __IO uint32_t CLR;                               /**< Analog Control Register CTRL0, offset: 0x28 */
    __IO uint32_t TOG;                               /**< Analog Control Register CTRL0, offset: 0x2C */
  } CTRL2;
  struct {                                         /* offset: 0x30 */
    __IO uint32_t RW;                                /**< Analog Control Register CTRL0, offset: 0x30 */
    __IO uint32_t SET;                               /**< Analog Control Register CTRL0, offset: 0x34 */
    __IO uint32_t CLR;                               /**< Analog Control Register CTRL0, offset: 0x38 */
    __IO uint32_t TOG;                               /**< Analog Control Register CTRL0, offset: 0x3C */
  } CTRL3;
  struct {                                         /* offset: 0x40 */
    __IO uint32_t RW;                                /**< Analog Control Register CTRL0, offset: 0x40 */
    __IO uint32_t SET;                               /**< Analog Control Register CTRL0, offset: 0x44 */
    __IO uint32_t CLR;                               /**< Analog Control Register CTRL0, offset: 0x48 */
    __IO uint32_t TOG;                               /**< Analog Control Register CTRL0, offset: 0x4C */
  } CTRL4;
  struct {                                         /* offset: 0x50 */
    __I  uint32_t RW;                                /**< Analog Status Register STAT0, offset: 0x50 */
    __I  uint32_t SET;                               /**< Analog Status Register STAT0, offset: 0x54 */
    __I  uint32_t CLR;                               /**< Analog Status Register STAT0, offset: 0x58 */
    __I  uint32_t TOG;                               /**< Analog Status Register STAT0, offset: 0x5C */
  } STAT0;
  struct {                                         /* offset: 0x60 */
    __I  uint32_t RW;                                /**< Analog Status Register STAT0, offset: 0x60 */
    __I  uint32_t SET;                               /**< Analog Status Register STAT0, offset: 0x64 */
    __I  uint32_t CLR;                               /**< Analog Status Register STAT0, offset: 0x68 */
    __I  uint32_t TOG;                               /**< Analog Status Register STAT0, offset: 0x6C */
  } STAT1;
  struct {                                         /* offset: 0x70 */
    __I  uint32_t RW;                                /**< Analog Status Register STAT0, offset: 0x70 */
    __I  uint32_t SET;                               /**< Analog Status Register STAT0, offset: 0x74 */
    __I  uint32_t CLR;                               /**< Analog Status Register STAT0, offset: 0x78 */
    __I  uint32_t TOG;                               /**< Analog Status Register STAT0, offset: 0x7C */
  } STAT2;
} OSC_RC_400M_Type;

/* ----------------------------------------------------------------------------
   -- OSC_RC_400M Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSC_RC_400M_Register_Masks OSC_RC_400M Register Masks
 * @{
 */

/*! @name CTRL0 - Analog Control Register CTRL0 */
/*! @{ */

