JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define RGPIO_ISFR_ISF25_MASK                    (0x2000000U)
#define RGPIO_ISFR_ISF25_SHIFT                   (25U)
/*! ISF25 - Interrupt Status Flag
 *  0b0..Configured interrupt is not detected on the pin of the same number.
 *  0b1..Configured interrupt is detected on the pin of the same number. If the pin is configured to generate a
 *       DMA request, then the corresponding flag will be cleared automatically at the completion of the requested
 *       DMA transfer. Otherwise, the flag remains set until a logic 1 is written to the flag. If the pin is
 *       configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately
 *       after it is cleared.
 */
#define RGPIO_ISFR_ISF25(x)                      (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF25_SHIFT)) & RGPIO_ISFR_ISF25_MASK)

#define RGPIO_ISFR_ISF26_MASK                    (0x4000000U)
#define RGPIO_ISFR_ISF26_SHIFT                   (26U)
/*! ISF26 - Interrupt Status Flag
 *  0b0..Configured interrupt is not detected on the pin of the same number.
 *  0b1..Configured interrupt is detected on the pin of the same number. If the pin is configured to generate a
 *       DMA request, then the corresponding flag will be cleared automatically at the completion of the requested
 *       DMA transfer. Otherwise, the flag remains set until a logic 1 is written to the flag. If the pin is
 *       configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately
 *       after it is cleared.
 */
#define RGPIO_ISFR_ISF26(x)                      (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF26_SHIFT)) & RGPIO_ISFR_ISF26_MASK)

#define RGPIO_ISFR_ISF27_MASK                    (0x8000000U)
#define RGPIO_ISFR_ISF27_SHIFT                   (27U)
/*! ISF27 - Interrupt Status Flag
 *  0b0..Configured interrupt is not detected on the pin of the same number.
 *  0b1..Configured interrupt is detected on the pin of the same number. If the pin is configured to generate a
 *       DMA request, then the corresponding flag will be cleared automatically at the completion of the requested
 *       DMA transfer. Otherwise, the flag remains set until a logic 1 is written to the flag. If the pin is
 *       configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately
 *       after it is cleared.
 */
#define RGPIO_ISFR_ISF27(x)                      (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF27_SHIFT)) & RGPIO_ISFR_ISF27_MASK)

#define RGPIO_ISFR_ISF28_MASK                    (0x10000000U)
#define RGPIO_ISFR_ISF28_SHIFT                   (28U)
/*! ISF28 - Interrupt Status Flag
 *  0b0..Configured interrupt is not detected on the pin of the same number.
 *  0b1..Configured interrupt is detected on the pin of the same number. If the pin is configured to generate a
 *       DMA request, then the corresponding flag will be cleared automatically at the completion of the requested
 *       DMA transfer. Otherwise, the flag remains set until a logic 1 is written to the flag. If the pin is
 *       configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately
 *       after it is cleared.
 */
#define RGPIO_ISFR_ISF28(x)                      (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF28_SHIFT)) & RGPIO_ISFR_ISF28_MASK)

#define RGPIO_ISFR_ISF29_MASK                    (0x20000000U)
#define RGPIO_ISFR_ISF29_SHIFT                   (29U)
/*! ISF29 - Interrupt Status Flag
 *  0b0..Configured interrupt is not detected on the pin of the same number.
 *  0b1..Configured interrupt is detected on the pin of the same number. If the pin is configured to generate a
 *       DMA request, then the corresponding flag will be cleared automatically at the completion of the requested
 *       DMA transfer. Otherwise, the flag remains set until a logic 1 is written to the flag. If the pin is
 *       configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately
 *       after it is cleared.
 */
#define RGPIO_ISFR_ISF29(x)                      (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF29_SHIFT)) & RGPIO_ISFR_ISF29_MASK)

#define RGPIO_ISFR_ISF30_MASK                    (0x40000000U)
#define RGPIO_ISFR_ISF30_SHIFT                   (30U)
/*! ISF30 - Interrupt Status Flag
 *  0b0..Configured interrupt is not detected on the pin of the same number.
 *  0b1..Configured interrupt is detected on the pin of the same number. If the pin is configured to generate a
 *       DMA request, then the corresponding flag will be cleared automatically at the completion of the requested
 *       DMA transfer. Otherwise, the flag remains set until a logic 1 is written to the flag. If the pin is
 *       configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately
 *       after it is cleared.
 */
#define RGPIO_ISFR_ISF30(x)                      (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF30_SHIFT)) & RGPIO_ISFR_ISF30_MASK)

#define RGPIO_ISFR_ISF31_MASK                    (0x80000000U)
#define RGPIO_ISFR_ISF31_SHIFT                   (31U)
/*! ISF31 - Interrupt Status Flag
 *  0b0..Configured interrupt is not detected on the pin of the same number.
 *  0b1..Configured interrupt is detected on the pin of the same number. If the pin is configured to generate a
 *       DMA request, then the corresponding flag will be cleared automatically at the completion of the requested
 *       DMA transfer. Otherwise, the flag remains set until a logic 1 is written to the flag. If the pin is
 *       configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately
 *       after it is cleared.
 */
#define RGPIO_ISFR_ISF31(x)                      (((uint32_t)(((uint32_t)(x)) << RGPIO_ISFR_ISF31_SHIFT)) & RGPIO_ISFR_ISF31_MASK)
/*! @} */

/* The count of RGPIO_ISFR */
#define RGPIO_ISFR_COUNT                         (2U)


/*!
 * @}
 */ /* end of group RGPIO_Register_Masks */


/* RGPIO - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RGPIO1 base address */
  #define RGPIO1_BASE                              (0x57400000u)
  /** Peripheral RGPIO1 base address */
  #define RGPIO1_BASE_NS                           (0x47400000u)
  /** Peripheral RGPIO1 base pointer */
  #define RGPIO1                                   ((RGPIO_Type *)RGPIO1_BASE)
  /** Peripheral RGPIO1 base pointer */
  #define RGPIO1_NS                                ((RGPIO_Type *)RGPIO1_BASE_NS)
  /** Peripheral RGPIO2 base address */
  #define RGPIO2_BASE                              (0x53810000u)
  /** Peripheral RGPIO2 base address */
  #define RGPIO2_BASE_NS                           (0x43810000u)
  /** Peripheral RGPIO2 base pointer */
  #define RGPIO2                                   ((RGPIO_Type *)RGPIO2_BASE)
  /** Peripheral RGPIO2 base pointer */
  #define RGPIO2_NS                                ((RGPIO_Type *)RGPIO2_BASE_NS)
  /** Peripheral RGPIO3 base address */
  #define RGPIO3_BASE                              (0x53820000u)
  /** Peripheral RGPIO3 base address */
  #define RGPIO3_BASE_NS                           (0x43820000u)
  /** Peripheral RGPIO3 base pointer */
  #define RGPIO3                                   ((RGPIO_Type *)RGPIO3_BASE)
  /** Peripheral RGPIO3 base pointer */
  #define RGPIO3_NS                                ((RGPIO_Type *)RGPIO3_BASE_NS)
  /** Peripheral RGPIO4 base address */
  #define RGPIO4_BASE                              (0x53830000u)
  /** Peripheral RGPIO4 base address */
  #define RGPIO4_BASE_NS                           (0x43830000u)
  /** Peripheral RGPIO4 base pointer */
  #define RGPIO4                                   ((RGPIO_Type *)RGPIO4_BASE)
  /** Peripheral RGPIO4 base pointer */
  #define RGPIO4_NS                                ((RGPIO_Type *)RGPIO4_BASE_NS)
  /** Peripheral RGPIO5 base address */
  #define RGPIO5_BASE                              (0x53840000u)
  /** Peripheral RGPIO5 base address */
  #define RGPIO5_BASE_NS                           (0x43840000u)
  /** Peripheral RGPIO5 base pointer */
  #define RGPIO5                                   ((RGPIO_Type *)RGPIO5_BASE)
  /** Peripheral RGPIO5 base pointer */
  #define RGPIO5_NS                                ((RGPIO_Type *)RGPIO5_BASE_NS)
  /** Peripheral RGPIO6 base address */
  #define RGPIO6_BASE                              (0x53850000u)
  /** Peripheral RGPIO6 base address */
  #define RGPIO6_BASE_NS                           (0x43850000u)
  /** Peripheral RGPIO6 base pointer */
  #define RGPIO6                                   ((RGPIO_Type *)RGPIO6_BASE)
  /** Peripheral RGPIO6 base pointer */
  #define RGPIO6_NS                                ((RGPIO_Type *)RGPIO6_BASE_NS)
  /** Array initializer of RGPIO peripheral base addresses */
  #define RGPIO_BASE_ADDRS                         { 0u, RGPIO1_BASE, RGPIO2_BASE, RGPIO3_BASE, RGPIO4_BASE, RGPIO5_BASE, RGPIO6_BASE }
  /** Array initializer of RGPIO peripheral base pointers */
  #define RGPIO_BASE_PTRS                          { (RGPIO_Type *)0u, RGPIO1, RGPIO2, RGPIO3, RGPIO4, RGPIO5, RGPIO6 }
  /** Array initializer of RGPIO peripheral base addresses */
  #define RGPIO_BASE_ADDRS_NS                      { 0u, RGPIO1_BASE_NS, RGPIO2_BASE_NS, RGPIO3_BASE_NS, RGPIO4_BASE_NS, RGPIO5_BASE_NS, RGPIO6_BASE_NS }
  /** Array initializer of RGPIO peripheral base pointers */
  #define RGPIO_BASE_PTRS_NS                       { (RGPIO_Type *)0u, RGPIO1_NS, RGPIO2_NS, RGPIO3_NS, RGPIO4_NS, RGPIO5_NS, RGPIO6_NS }
#else
  /** Peripheral RGPIO1 base address */
  #define RGPIO1_BASE                              (0x47400000u)
  /** Peripheral RGPIO1 base pointer */
  #define RGPIO1                                   ((RGPIO_Type *)RGPIO1_BASE)
  /** Peripheral RGPIO2 base address */
  #define RGPIO2_BASE                              (0x43810000u)
  /** Peripheral RGPIO2 base pointer */
  #define RGPIO2                                   ((RGPIO_Type *)RGPIO2_BASE)
  /** Peripheral RGPIO3 base address */
  #define RGPIO3_BASE                              (0x43820000u)
  /** Peripheral RGPIO3 base pointer */
  #define RGPIO3                                   ((RGPIO_Type *)RGPIO3_BASE)
  /** Peripheral RGPIO4 base address */
  #define RGPIO4_BASE                              (0x43830000u)
  /** Peripheral RGPIO4 base pointer */
  #define RGPIO4                                   ((RGPIO_Type *)RGPIO4_BASE)
  /** Peripheral RGPIO5 base address */
  #define RGPIO5_BASE                              (0x43840000u)
  /** Peripheral RGPIO5 base pointer */
  #define RGPIO5                                   ((RGPIO_Type *)RGPIO5_BASE)
  /** Peripheral RGPIO6 base address */
  #define RGPIO6_BASE                              (0x43850000u)
  /** Peripheral RGPIO6 base pointer */
  #define RGPIO6                                   ((RGPIO_Type *)RGPIO6_BASE)
  /** Array initializer of RGPIO peripheral base addresses */
  #define RGPIO_BASE_ADDRS                         { 0u, RGPIO1_BASE, RGPIO2_BASE, RGPIO3_BASE, RGPIO4_BASE, RGPIO5_BASE, RGPIO6_BASE }
  /** Array initializer of RGPIO peripheral base pointers */
  #define RGPIO_BASE_PTRS                          { (RGPIO_Type *)0u, RGPIO1, RGPIO2, RGPIO3, RGPIO4, RGPIO5, RGPIO6 }
#endif

/*!
 * @}
 */ /* end of group RGPIO_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- ROM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ROM_Peripheral_Access_Layer ROM Peripheral Access Layer
 * @{
 */

/** ROM - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[180];
  __IO uint32_t ROMPATCHD[16];                     /**< Data Registers, array offset: 0xB4, array step: 0x4 */
  __IO uint32_t ROMPATCHCNTL;                      /**< Control Register, offset: 0xF4 */
       uint32_t ROMPATCHENH;                       /**< Enable Register High, offset: 0xF8 */
  __IO uint32_t ROMPATCHENL;                       /**< Enable Register Low, offset: 0xFC */
  __IO uint32_t ROMPATCHA[32];                     /**< Address Registers, array offset: 0x100, array step: 0x4 */
       uint8_t RESERVED_1[136];
  __IO uint32_t ROMPATCHSR;                        /**< Status Register, offset: 0x208 */
} ROM_Type;

/* ----------------------------------------------------------------------------
   -- ROM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ROM_Register_Masks ROM Register Masks
 * @{
 */

/*! @name ROMPATCHD - Data Registers */
/*! @{ */

#define ROM_ROMPATCHD_DATAX_MASK                 (0xFFFFFFFFU)
#define ROM_ROMPATCHD_DATAX_SHIFT                (0U)
/*! DATAX - Data Fix Registers */
#define ROM_ROMPATCHD_DATAX(x)                   (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHD_DATAX_SHIFT)) & ROM_ROMPATCHD_DATAX_MASK)
/*! @} */

