JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define ROM_ROMPATCHCNTL_LK_MASK                 (0x80000000U)
#define ROM_ROMPATCHCNTL_LK_SHIFT                (31U)
/*! LK - Register Lock
 *  0b0..All registers remain accessible (unlocked).
 *  0b1..Lock access to all registers. All ROMCP register accesses are treated as read-as-zero, except for this LK
 *       bit which reads as set. All writes are ignored.
 */
#define ROM_ROMPATCHCNTL_LK(x)                   (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHCNTL_LK_SHIFT)) & ROM_ROMPATCHCNTL_LK_MASK)
/*! @} */

/*! @name ROMPATCHENL - Enable Register Low */
/*! @{ */

#define ROM_ROMPATCHENL_ENABLE_MASK              (0xFFFFFFFFU)
#define ROM_ROMPATCHENL_ENABLE_SHIFT             (0U)
/*! ENABLE - Enable Address Comparator
 *  0b00000000000000000000000000000000..Address comparator is disabled
 *  0b00000000000000000000000000000001..Address comparator is enabled; after the associated address is matched, the ROMC will trigger a opcode patch or data fix event.
 */
#define ROM_ROMPATCHENL_ENABLE(x)                (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHENL_ENABLE_SHIFT)) & ROM_ROMPATCHENL_ENABLE_MASK)
/*! @} */

/*! @name ROMPATCHA - Address Registers */
/*! @{ */

#define ROM_ROMPATCHA_THUMBX_MASK                (0x1U)
#define ROM_ROMPATCHA_THUMBX_SHIFT               (0U)
/*! THUMBX - THUMB Comparator Select
 *  0b0..ARM patch
 *  0b1..THUMB patch (ignore if a data fix)
 */
#define ROM_ROMPATCHA_THUMBX(x)                  (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHA_THUMBX_SHIFT)) & ROM_ROMPATCHA_THUMBX_MASK)

#define ROM_ROMPATCHA_ADDRX_MASK                 (0x7FFFFEU)
#define ROM_ROMPATCHA_ADDRX_SHIFT                (1U)
/*! ADDRX - Address Comparator Registers */
#define ROM_ROMPATCHA_ADDRX(x)                   (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHA_ADDRX_SHIFT)) & ROM_ROMPATCHA_ADDRX_MASK)
/*! @} */

/* The count of ROM_ROMPATCHA */
#define ROM_ROMPATCHA_COUNT                      (32U)

/*! @name ROMPATCHSR - Status Register */
/*! @{ */

#define ROM_ROMPATCHSR_SOURCE_MASK               (0x3FU)
#define ROM_ROMPATCHSR_SOURCE_SHIFT              (0U)
/*! SOURCE - ROMCP Source Number
 *  0b000000..Address Comparator 0 matched
 *  0b000001..Address Comparator 1 matched
 *  0b001111..Address Comparator 15 matched
 */
#define ROM_ROMPATCHSR_SOURCE(x)                 (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHSR_SOURCE_SHIFT)) & ROM_ROMPATCHSR_SOURCE_MASK)

#define ROM_ROMPATCHSR_SW_MASK                   (0x20000U)
#define ROM_ROMPATCHSR_SW_SHIFT                  (17U)
/*! SW - ROMCP AHB Multiple Address Comparator Match Indicator
 *  0b0..No event or comparator collisions have occurred
 *  0b1..A collision has occurred
 */
#define ROM_ROMPATCHSR_SW(x)                     (((uint32_t)(((uint32_t)(x)) << ROM_ROMPATCHSR_SW_SHIFT)) & ROM_ROMPATCHSR_SW_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ROM_Register_Masks */


/* ROM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral ROM base address */
  #define ROM_BASE                                 (0x54430000u)
  /** Peripheral ROM base address */
  #define ROM_BASE_NS                              (0x44430000u)
  /** Peripheral ROM base pointer */
  #define ROM                                      ((ROM_Type *)ROM_BASE)
  /** Peripheral ROM base pointer */
  #define ROM_NS                                   ((ROM_Type *)ROM_BASE_NS)
  /** Array initializer of ROM peripheral base addresses */
  #define ROM_BASE_ADDRS                           { ROM_BASE }
  /** Array initializer of ROM peripheral base pointers */
  #define ROM_BASE_PTRS                            { ROM }
  /** Array initializer of ROM peripheral base addresses */
  #define ROM_BASE_ADDRS_NS                        { ROM_BASE_NS }
  /** Array initializer of ROM peripheral base pointers */
  #define ROM_BASE_PTRS_NS                         { ROM_NS }
#else
  /** Peripheral ROM base address */
  #define ROM_BASE                                 (0x44430000u)
  /** Peripheral ROM base pointer */
  #define ROM                                      ((ROM_Type *)ROM_BASE)
  /** Array initializer of ROM peripheral base addresses */
  #define ROM_BASE_ADDRS                           { ROM_BASE }
  /** Array initializer of ROM peripheral base pointers */
  #define ROM_BASE_PTRS                            { ROM }
#endif

/*!
 * @}
 */ /* end of group ROM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RTWDOG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RTWDOG_Peripheral_Access_Layer RTWDOG Peripheral Access Layer
 * @{
 */

/** RTWDOG - Register Layout Typedef */
typedef struct {
  __IO uint32_t CS;                                /**< WDOG Control and Status, offset: 0x0 */
  __IO uint32_t CNT;                               /**< WDOG Counter, offset: 0x4 */
  __IO uint32_t TOVAL;                             /**< WDOG Timeout Value, offset: 0x8 */
  __IO uint32_t WIN;                               /**< Watchdog Window, offset: 0xC */
} RTWDOG_Type;

/* ----------------------------------------------------------------------------
   -- RTWDOG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RTWDOG_Register_Masks RTWDOG Register Masks
 * @{
 */

/*! @name CS - WDOG Control and Status */
/*! @{ */

#define RTWDOG_CS_STOP_MASK                      (0x1U)
#define RTWDOG_CS_STOP_SHIFT                     (0U)
/*! STOP - Stop Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define RTWDOG_CS_STOP(x)                        (((uint32_t)(((uint32_t)(x)) << RTWDOG_CS_STOP_SHIFT)) & RTWDOG_CS_STOP_MASK)

#define RTWDOG_CS_WAIT_MASK                      (0x2U)
#define RTWDOG_CS_WAIT_SHIFT                     (1U)
/*! WAIT - Wait Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define RTWDOG_CS_WAIT(x)                        (((uint32_t)(((uint32_t)(x)) << RTWDOG_CS_WAIT_SHIFT)) & RTWDOG_CS_WAIT_MASK)

