JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define SPDIF_SPDIFRXCCHANNEL_ADDR_159_128_RXCCHANNEL_ADDR_159_128_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFRXCCHANNEL_ADDR_159_128_RXCCHANNEL_ADDR_159_128_SHIFT (0U)
/*! RxCChannel_Addr_159_128 - RxCChannel_Addr_159_128 */
#define SPDIF_SPDIFRXCCHANNEL_ADDR_159_128_RXCCHANNEL_ADDR_159_128(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFRXCCHANNEL_ADDR_159_128_RXCCHANNEL_ADDR_159_128_SHIFT)) & SPDIF_SPDIFRXCCHANNEL_ADDR_159_128_RXCCHANNEL_ADDR_159_128_MASK)
/*! @} */

/*! @name SPDIFRXCCHANNEL_ADDR_191_160 - SPDIF receive C channel register, bits 191-160 */
/*! @{ */

#define SPDIF_SPDIFRXCCHANNEL_ADDR_191_160_RXCCHANNEL_ADDR_191_160_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFRXCCHANNEL_ADDR_191_160_RXCCHANNEL_ADDR_191_160_SHIFT (0U)
/*! RxCChannel_Addr_191_160 - RxCChannel_Addr_191_160 */
#define SPDIF_SPDIFRXCCHANNEL_ADDR_191_160_RXCCHANNEL_ADDR_191_160(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFRXCCHANNEL_ADDR_191_160_RXCCHANNEL_ADDR_191_160_SHIFT)) & SPDIF_SPDIFRXCCHANNEL_ADDR_191_160_RXCCHANNEL_ADDR_191_160_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_31_0 - SPDIF transmit C channel register, bits 31-0 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_31_0_TXCCHANNEL_ADDR_31_0_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_31_0_TXCCHANNEL_ADDR_31_0_SHIFT (0U)
/*! TxCChannel_Addr_31_0 - TxCChannel_Addr_31_0 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_31_0_TXCCHANNEL_ADDR_31_0(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_31_0_TXCCHANNEL_ADDR_31_0_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_31_0_TXCCHANNEL_ADDR_31_0_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_63_32 - SPDIF transmit C channel register, bits 63-32 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_63_32_TXCCHANNEL_ADDR_63_32_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_63_32_TXCCHANNEL_ADDR_63_32_SHIFT (0U)
/*! TxCChannel_Addr_63_32 - TxCChannel_Addr_63_32 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_63_32_TXCCHANNEL_ADDR_63_32(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_63_32_TXCCHANNEL_ADDR_63_32_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_63_32_TXCCHANNEL_ADDR_63_32_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_95_64 - SPDIF transmit C channel register, bits 95-64 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_95_64_TXCCHANNEL_ADDR_95_64_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_95_64_TXCCHANNEL_ADDR_95_64_SHIFT (0U)
/*! TxCChannel_Addr_95_64 - TxCChannel_Addr_95_64 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_95_64_TXCCHANNEL_ADDR_95_64(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_95_64_TXCCHANNEL_ADDR_95_64_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_95_64_TXCCHANNEL_ADDR_95_64_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_127_96 - SPDIF transmit C channel register, bits 127-96 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_127_96_TXCCHANNEL_ADDR_127_96_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_127_96_TXCCHANNEL_ADDR_127_96_SHIFT (0U)
/*! TxCChannel_Addr_127_96 - TxCChannel_Addr_127_96 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_127_96_TXCCHANNEL_ADDR_127_96(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_127_96_TXCCHANNEL_ADDR_127_96_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_127_96_TXCCHANNEL_ADDR_127_96_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_159_128 - SPDIF transmit C channel register, bits 159-128 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_159_128_TXCCHANNEL_ADDR_159_128_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_159_128_TXCCHANNEL_ADDR_159_128_SHIFT (0U)
/*! TxCChannel_Addr_159_128 - TxCChannel_Addr_159_128 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_159_128_TXCCHANNEL_ADDR_159_128(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_159_128_TXCCHANNEL_ADDR_159_128_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_159_128_TXCCHANNEL_ADDR_159_128_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_191_160 - SPDIF transmit C channel register, bits 191-160 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_191_160_TXCCHANNEL_ADDR_191_160_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_191_160_TXCCHANNEL_ADDR_191_160_SHIFT (0U)
/*! TxCChannel_Addr_191_160 - TxCChannel_Addr_191_160 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_191_160_TXCCHANNEL_ADDR_191_160(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_191_160_TXCCHANNEL_ADDR_191_160_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_191_160_TXCCHANNEL_ADDR_191_160_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SPDIF_Register_Masks */


/* SPDIF - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SPDIF base address */
  #define SPDIF_BASE                               (0x52BA0000u)
  /** Peripheral SPDIF base address */
  #define SPDIF_BASE_NS                            (0x42BA0000u)
  /** Peripheral SPDIF base pointer */
  #define SPDIF                                    ((SPDIF_Type *)SPDIF_BASE)
  /** Peripheral SPDIF base pointer */
  #define SPDIF_NS                                 ((SPDIF_Type *)SPDIF_BASE_NS)
  /** Array initializer of SPDIF peripheral base addresses */
  #define SPDIF_BASE_ADDRS                         { SPDIF_BASE }
  /** Array initializer of SPDIF peripheral base pointers */
  #define SPDIF_BASE_PTRS                          { SPDIF }
  /** Array initializer of SPDIF peripheral base addresses */
  #define SPDIF_BASE_ADDRS_NS                      { SPDIF_BASE_NS }
  /** Array initializer of SPDIF peripheral base pointers */
  #define SPDIF_BASE_PTRS_NS                       { SPDIF_NS }
#else
  /** Peripheral SPDIF base address */
  #define SPDIF_BASE                               (0x42BA0000u)
  /** Peripheral SPDIF base pointer */
  #define SPDIF                                    ((SPDIF_Type *)SPDIF_BASE)
  /** Array initializer of SPDIF peripheral base addresses */
  #define SPDIF_BASE_ADDRS                         { SPDIF_BASE }
  /** Array initializer of SPDIF peripheral base pointers */
  #define SPDIF_BASE_PTRS                          { SPDIF }
#endif
/** Interrupt vectors for the SPDIF peripheral type */
#define SPDIF_IRQS                               { SPDIF_IRQn }

/*!
 * @}
 */ /* end of group SPDIF_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SRC_GENERAL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRC_GENERAL_Peripheral_Access_Layer SRC_GENERAL Peripheral Access Layer
 * @{
 */

/** SRC_GENERAL - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t AUTHEN_CTRL;                       /**< Authentication Control, offset: 0x4 */
       uint8_t RESERVED_1[8];
  __IO uint32_t SCR;                               /**< SRC Control Register, offset: 0x10 */
  __IO uint32_t SRTMR;                             /**< SRC Reset Trigger Mode Register, offset: 0x14 */
  __IO uint32_t SRMASK;                            /**< SRC Reset Mask Register, offset: 0x18 */
       uint8_t RESERVED_2[36];
  __I  uint32_t SBMR1;                             /**< SRC Boot Mode Register 1, offset: 0x40 */
  __I  uint32_t SBMR2;                             /**< SRC Boot Mode Register 2, offset: 0x44 */
       uint8_t RESERVED_3[4];
  __IO uint32_t SRSR_BBSM;                         /**< SRC Reset Status Register backup in BBSM domain, offset: 0x4C */
  __IO uint32_t SRSR;                              /**< SRC Reset Status Register, offset: 0x50 */
  __IO uint32_t GPR[20];                           /**< SRC General Purpose Register, array offset: 0x54, array step: 0x4 */
} SRC_GENERAL_Type;

/* ----------------------------------------------------------------------------
   -- SRC_GENERAL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRC_GENERAL_Register_Masks SRC_GENERAL Register Masks
 * @{
 */

/*! @name AUTHEN_CTRL - Authentication Control */
/*! @{ */

#define SRC_GENERAL_AUTHEN_CTRL_LOCK_CFG_MASK    (0x80U)
#define SRC_GENERAL_AUTHEN_CTRL_LOCK_CFG_SHIFT   (7U)
/*! LOCK_CFG - Configuration lock
 *  0b0..General registers are not locked.
 *  0b1..LOCK_CFG and registers in the list are locked.
 */
#define SRC_GENERAL_AUTHEN_CTRL_LOCK_CFG(x)      (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_AUTHEN_CTRL_LOCK_CFG_SHIFT)) & SRC_GENERAL_AUTHEN_CTRL_LOCK_CFG_MASK)

#define SRC_GENERAL_AUTHEN_CTRL_TZ_USER_MASK     (0x100U)
#define SRC_GENERAL_AUTHEN_CTRL_TZ_USER_SHIFT    (8U)
/*! TZ_USER - Allow user mode write
 *  0b0..General registers can only be written in privilege mode.
 *  0b1..General registers can be written either in privilege mode or user mode.
 */
#define SRC_GENERAL_AUTHEN_CTRL_TZ_USER(x)       (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_AUTHEN_CTRL_TZ_USER_SHIFT)) & SRC_GENERAL_AUTHEN_CTRL_TZ_USER_MASK)

#define SRC_GENERAL_AUTHEN_CTRL_TZ_NS_MASK       (0x200U)
#define SRC_GENERAL_AUTHEN_CTRL_TZ_NS_SHIFT      (9U)
/*! TZ_NS - Allow non-secure mode access
 *  0b0..General registers can only be written in secure mode.
 *  0b1..General registers can be written either in secure mode or non-secure mode.
 */
#define SRC_GENERAL_AUTHEN_CTRL_TZ_NS(x)         (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_AUTHEN_CTRL_TZ_NS_SHIFT)) & SRC_GENERAL_AUTHEN_CTRL_TZ_NS_MASK)

