JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define SRC_GENERAL_SRSR_CM33_REQUEST_MASK       (0x200U)
#define SRC_GENERAL_SRSR_CM33_REQUEST_SHIFT      (9U)
/*! CM33_REQUEST - Indicates whether reset was the result of cm33 reset request
 *  0b0..Reset is not a result of cm33 reset request.
 *  0b1..Reset is a result of cm33 reset request.
 */
#define SRC_GENERAL_SRSR_CM33_REQUEST(x)         (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_CM33_REQUEST_SHIFT)) & SRC_GENERAL_SRSR_CM33_REQUEST_MASK)

#define SRC_GENERAL_SRSR_CM33_LOCKUP_MASK        (0x400U)
#define SRC_GENERAL_SRSR_CM33_LOCKUP_SHIFT       (10U)
/*! CM33_LOCKUP - Indicates a reset has been caused by cm33 CPU lockup
 *  0b0..Reset is not a result of the cm33 lockup.
 *  0b1..Reset is a result of the cm33 lockup.
 */
#define SRC_GENERAL_SRSR_CM33_LOCKUP(x)          (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_CM33_LOCKUP_SHIFT)) & SRC_GENERAL_SRSR_CM33_LOCKUP_MASK)

#define SRC_GENERAL_SRSR_CM7_REQUEST_MASK        (0x800U)
#define SRC_GENERAL_SRSR_CM7_REQUEST_SHIFT       (11U)
/*! CM7_REQUEST - Indicates whether reset was the result of cm7 reset request
 *  0b0..Reset is not a result of cm7 reset request.
 *  0b1..Reset is a result of cm7 reset request.
 */
#define SRC_GENERAL_SRSR_CM7_REQUEST(x)          (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_CM7_REQUEST_SHIFT)) & SRC_GENERAL_SRSR_CM7_REQUEST_MASK)

#define SRC_GENERAL_SRSR_CM7_LOCKUP_MASK         (0x1000U)
#define SRC_GENERAL_SRSR_CM7_LOCKUP_SHIFT        (12U)
/*! CM7_LOCKUP - Indicates a reset has been caused by CM7 CPU
 *  0b0..Reset is not a result of the cm7 lockup.
 *  0b1..Reset is a result of the cm7 lockup.
 */
#define SRC_GENERAL_SRSR_CM7_LOCKUP(x)           (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_CM7_LOCKUP_SHIFT)) & SRC_GENERAL_SRSR_CM7_LOCKUP_MASK)

#define SRC_GENERAL_SRSR_DCDC_OVVT_MASK          (0x2000U)
#define SRC_GENERAL_SRSR_DCDC_OVVT_SHIFT         (13U)
/*! DCDC_OVVT - Indicates a reset has been caused by DCDC over voltage
 *  0b0..Reset is not a result of the DCDC over voltage.
 *  0b1..Reset is a result of the DCDC over voltage.
 */
#define SRC_GENERAL_SRSR_DCDC_OVVT(x)            (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_DCDC_OVVT_SHIFT)) & SRC_GENERAL_SRSR_DCDC_OVVT_MASK)

#define SRC_GENERAL_SRSR_ECAT_RSTO_MASK          (0x4000U)
#define SRC_GENERAL_SRSR_ECAT_RSTO_SHIFT         (14U)
/*! ECAT_RSTO - Indicates a reset has been caused by ECAT reset output
 *  0b0..Reset is not a result of the ECAT reset output.
 *  0b1..Reset is a result of the ECAT reset output.
 */
#define SRC_GENERAL_SRSR_ECAT_RSTO(x)            (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_ECAT_RSTO_SHIFT)) & SRC_GENERAL_SRSR_ECAT_RSTO_MASK)

#define SRC_GENERAL_SRSR_IPP_POR_B_MASK          (0x10000U)
#define SRC_GENERAL_SRSR_IPP_POR_B_SHIFT         (16U)
/*! IPP_POR_B - Indicates whether the reset was the result of chip PAD POR_B.
 *  0b0..Reset is not a result of chip PAD POR_B.
 *  0b1..Reset is a result of chip PAD POR_B.
 */
#define SRC_GENERAL_SRSR_IPP_POR_B(x)            (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_IPP_POR_B_SHIFT)) & SRC_GENERAL_SRSR_IPP_POR_B_MASK)
/*! @} */

/*! @name GPR - SRC General Purpose Register */
/*! @{ */

#define SRC_GENERAL_GPR_GPR_MASK                 (0xFFFFFFFFU)
#define SRC_GENERAL_GPR_GPR_SHIFT                (0U)
/*! GPR - General Purpose Register. */
#define SRC_GENERAL_GPR_GPR(x)                   (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_GPR_GPR_SHIFT)) & SRC_GENERAL_GPR_GPR_MASK)
/*! @} */

/* The count of SRC_GENERAL_GPR */
#define SRC_GENERAL_GPR_COUNT                    (20U)


/*!
 * @}
 */ /* end of group SRC_GENERAL_Register_Masks */


/* SRC_GENERAL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SRC_GENERAL_REG base address */
  #define SRC_GENERAL_REG_BASE                     (0x54460000u)
  /** Peripheral SRC_GENERAL_REG base address */
  #define SRC_GENERAL_REG_BASE_NS                  (0x44460000u)
  /** Peripheral SRC_GENERAL_REG base pointer */
  #define SRC_GENERAL_REG                          ((SRC_GENERAL_Type *)SRC_GENERAL_REG_BASE)
  /** Peripheral SRC_GENERAL_REG base pointer */
  #define SRC_GENERAL_REG_NS                       ((SRC_GENERAL_Type *)SRC_GENERAL_REG_BASE_NS)
  /** Array initializer of SRC_GENERAL peripheral base addresses */
  #define SRC_GENERAL_BASE_ADDRS                   { SRC_GENERAL_REG_BASE }
  /** Array initializer of SRC_GENERAL peripheral base pointers */
  #define SRC_GENERAL_BASE_PTRS                    { SRC_GENERAL_REG }
  /** Array initializer of SRC_GENERAL peripheral base addresses */
  #define SRC_GENERAL_BASE_ADDRS_NS                { SRC_GENERAL_REG_BASE_NS }
  /** Array initializer of SRC_GENERAL peripheral base pointers */
  #define SRC_GENERAL_BASE_PTRS_NS                 { SRC_GENERAL_REG_NS }
#else
  /** Peripheral SRC_GENERAL_REG base address */
  #define SRC_GENERAL_REG_BASE                     (0x44460000u)
  /** Peripheral SRC_GENERAL_REG base pointer */
  #define SRC_GENERAL_REG                          ((SRC_GENERAL_Type *)SRC_GENERAL_REG_BASE)
  /** Array initializer of SRC_GENERAL peripheral base addresses */
  #define SRC_GENERAL_BASE_ADDRS                   { SRC_GENERAL_REG_BASE }
  /** Array initializer of SRC_GENERAL peripheral base pointers */
  #define SRC_GENERAL_BASE_PTRS                    { SRC_GENERAL_REG }
#endif

/*!
 * @}
 */ /* end of group SRC_GENERAL_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SRC_MIF_LN28FDSOI_SPLLRAM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRC_MIF_LN28FDSOI_SPLLRAM_Peripheral_Access_Layer SRC_MIF_LN28FDSOI_SPLLRAM Peripheral Access Layer
 * @{
 */

/** SRC_MIF_LN28FDSOI_SPLLRAM - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t MIF_CTRL;                          /**< MPC Control, offset: 0x4 */
  __I  uint32_t MIF_STAT;                          /**< MIF Status, offset: 0x8 */
       uint8_t RESERVED_1[20];
  __IO uint32_t MIF_MLPL_IG;                       /**< MIF MLPL control of IG, offset: 0x20 */
  __IO uint32_t MIF_DLY_IG;                        /**< MIF Delay of IG, offset: 0x24 */
       uint8_t RESERVED_2[8];
  __IO uint32_t MIF_MLPL_WLPD;                     /**< MIF MLPL control of WLPD, offset: 0x30 */
  __IO uint32_t MIF_DLY_WLPD;                      /**< MIF Delay of WLPD, offset: 0x34 */
       uint8_t RESERVED_3[8];
  __IO uint32_t MIF_MLPL_PD_B;                     /**< MIF MLPL control of PD_B, offset: 0x40 */
  __IO uint32_t MIF_DLY_PD_B;                      /**< MIF Delay of PD_B, offset: 0x44 */
} SRC_MIF_LN28FDSOI_SPLLRAM_Type;

/* ----------------------------------------------------------------------------
   -- SRC_MIF_LN28FDSOI_SPLLRAM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRC_MIF_LN28FDSOI_SPLLRAM_Register_Masks SRC_MIF_LN28FDSOI_SPLLRAM Register Masks
 * @{
 */

