JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name MIF_CTRL - MPC Control */
/*! @{ */

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_SW_CTRL_PIN_MASK (0x1U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_SW_CTRL_PIN_SHIFT (0U)
/*! SW_CTRL_PIN - Memory low power pins controlled by SW
 *  0b0..Use CURRENT_MLPL field to select MLPL_CTRL to control low power signal.
 *  0b1..Use SW_* field to control low power signal directly.
 */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_SW_CTRL_PIN(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_SW_CTRL_PIN_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_SW_CTRL_PIN_MASK)

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_MEM_PWR_ST_EN_MASK (0x2U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_MEM_PWR_ST_EN_SHIFT (1U)
/*! MEM_PWR_ST_EN - Memory power status will be considered when determining slice power status.
 *  0b0..Memory power status will not be considered when determining slice power status.
 *  0b1..Memory power status will be considered when determining slice power status.
 */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_MEM_PWR_ST_EN(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_MEM_PWR_ST_EN_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_MEM_PWR_ST_EN_MASK)

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_LOCK_CFG_MASK (0x100000U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_LOCK_CFG_SHIFT (20U)
/*! LOCK_CFG - Configuration lock
 *  0b0..The fields are not locked.
 *  0b1..The fields are locked.
 */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_LOCK_CFG(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_LOCK_CFG_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_CTRL_LOCK_CFG_MASK)
/*! @} */

/*! @name MIF_STAT - MIF Status */
/*! @{ */

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_MLPL_STATE_MASK (0x7U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_MLPL_STATE_SHIFT (0U)
/*! MLPL_STATE - Current state of CURRENT_MLPL */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_MLPL_STATE(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_MLPL_STATE_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_MLPL_STATE_MASK)

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_IG_STATE_MASK (0x8U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_IG_STATE_SHIFT (3U)
/*! IG_STATE - Current state of IG
 *  0b0..IG is 0.
 *  0b1..IG is 1.
 */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_IG_STATE(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_IG_STATE_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_IG_STATE_MASK)

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_WLPD_STATE_MASK (0x10U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_WLPD_STATE_SHIFT (4U)
/*! WLPD_STATE - Current state of WLPD
 *  0b0..WLPD is 0.
 *  0b1..WLPD is 1.
 */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_WLPD_STATE(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_WLPD_STATE_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_WLPD_STATE_MASK)

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_PD_B_STATE_MASK (0x20U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_PD_B_STATE_SHIFT (5U)
/*! PD_B_STATE - Current state of PD_B
 *  0b0..PD_B is 0.
 *  0b1..PD_B is 1.
 */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_PD_B_STATE(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_PD_B_STATE_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_STAT_PD_B_STATE_MASK)
/*! @} */

/*! @name MIF_MLPL_IG - MIF MLPL control of IG */
/*! @{ */

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_IG_MLPL_CTRL_MASK (0xFFU)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_IG_MLPL_CTRL_SHIFT (0U)
/*! MLPL_CTRL - Signal behavior at 8 different MLPL settings */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_IG_MLPL_CTRL(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_IG_MLPL_CTRL_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_IG_MLPL_CTRL_MASK)

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_IG_SW_IG_MASK (0x10000U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_IG_SW_IG_SHIFT (16U)
/*! SW_IG - Software control IG
 *  0b0..IG is 0.
 *  0b1..IG is 1.
 */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_IG_SW_IG(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_IG_SW_IG_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_IG_SW_IG_MASK)
/*! @} */

/*! @name MIF_DLY_IG - MIF Delay of IG */
/*! @{ */

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_IG_PRE_HI_DLY_MASK (0xFFFFU)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_IG_PRE_HI_DLY_SHIFT (0U)
/*! PRE_HI_DLY - Delay before asserting signal to high, locked by LOCK_CFG field */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_IG_PRE_HI_DLY(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_IG_PRE_HI_DLY_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_IG_PRE_HI_DLY_MASK)

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_IG_PRE_LO_DLY_MASK (0xFFFF0000U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_IG_PRE_LO_DLY_SHIFT (16U)
/*! PRE_LO_DLY - Delay before de-asserting signal to low, locked by LOCK_CFG field */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_IG_PRE_LO_DLY(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_IG_PRE_LO_DLY_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_IG_PRE_LO_DLY_MASK)
/*! @} */

/*! @name MIF_MLPL_WLPD - MIF MLPL control of WLPD */
/*! @{ */

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_WLPD_MLPL_CTRL_MASK (0xFFU)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_WLPD_MLPL_CTRL_SHIFT (0U)
/*! MLPL_CTRL - Signal behavior at 8 different MLPL settings */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_WLPD_MLPL_CTRL(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_WLPD_MLPL_CTRL_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_WLPD_MLPL_CTRL_MASK)

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_WLPD_SW_WLPD_MASK (0x10000U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_WLPD_SW_WLPD_SHIFT (16U)
/*! SW_WLPD - Software control WLPD
 *  0b1..WLPD is 1.
 *  0b0..WLPD is 0.
 */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_WLPD_SW_WLPD(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_WLPD_SW_WLPD_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_WLPD_SW_WLPD_MASK)
/*! @} */

/*! @name MIF_DLY_WLPD - MIF Delay of WLPD */
/*! @{ */

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_WLPD_PRE_HI_DLY_MASK (0xFFFFU)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_WLPD_PRE_HI_DLY_SHIFT (0U)
/*! PRE_HI_DLY - Delay before asserting signal to high, locked by LOCK_CFG field */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_WLPD_PRE_HI_DLY(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_WLPD_PRE_HI_DLY_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_WLPD_PRE_HI_DLY_MASK)

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_WLPD_PRE_LO_DLY_MASK (0xFFFF0000U)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_WLPD_PRE_LO_DLY_SHIFT (16U)
/*! PRE_LO_DLY - Delay before de-asserting signal to low, locked by LOCK_CFG field */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_WLPD_PRE_LO_DLY(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_WLPD_PRE_LO_DLY_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_DLY_WLPD_PRE_LO_DLY_MASK)
/*! @} */

/*! @name MIF_MLPL_PD_B - MIF MLPL control of PD_B */
/*! @{ */

#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_PD_B_MLPL_CTRL_MASK (0xFFU)
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_PD_B_MLPL_CTRL_SHIFT (0U)
/*! MLPL_CTRL - Signal behavior at 8 different MLPL settings */
#define SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_PD_B_MLPL_CTRL(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_PD_B_MLPL_CTRL_SHIFT)) & SRC_MIF_LN28FDSOI_SPLLRAM_MIF_MLPL_PD_B_MLPL_CTRL_MASK)

