JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define SRC_MIF_S28SPREGH_PSWA_MIF_MLPL_ARR_PDN_SW_ARR_PDN_MASK (0x10000U)
#define SRC_MIF_S28SPREGH_PSWA_MIF_MLPL_ARR_PDN_SW_ARR_PDN_SHIFT (16U)
/*! SW_ARR_PDN - Software control arr pdn
 *  0b0..ARR_PDN is 0.
 *  0b1..ARR_PDN is 1.
 */
#define SRC_MIF_S28SPREGH_PSWA_MIF_MLPL_ARR_PDN_SW_ARR_PDN(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_S28SPREGH_PSWA_MIF_MLPL_ARR_PDN_SW_ARR_PDN_SHIFT)) & SRC_MIF_S28SPREGH_PSWA_MIF_MLPL_ARR_PDN_SW_ARR_PDN_MASK)
/*! @} */

/*! @name MIF_DLY_ARR_HF - MIF Delay of array high-fanout power switch */
/*! @{ */

#define SRC_MIF_S28SPREGH_PSWA_MIF_DLY_ARR_HF_PRE_HI_DLY_MASK (0xFFFFU)
#define SRC_MIF_S28SPREGH_PSWA_MIF_DLY_ARR_HF_PRE_HI_DLY_SHIFT (0U)
/*! PRE_HI_DLY - Delay before turn off the high-fanout power switch, locked by LOCK_CFG field */
#define SRC_MIF_S28SPREGH_PSWA_MIF_DLY_ARR_HF_PRE_HI_DLY(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_S28SPREGH_PSWA_MIF_DLY_ARR_HF_PRE_HI_DLY_SHIFT)) & SRC_MIF_S28SPREGH_PSWA_MIF_DLY_ARR_HF_PRE_HI_DLY_MASK)

#define SRC_MIF_S28SPREGH_PSWA_MIF_DLY_ARR_HF_PRE_LO_DLY_MASK (0xFFFF0000U)
#define SRC_MIF_S28SPREGH_PSWA_MIF_DLY_ARR_HF_PRE_LO_DLY_SHIFT (16U)
/*! PRE_LO_DLY - Delay before turn on the high-fanout power switch, locked by LOCK_CFG field */
#define SRC_MIF_S28SPREGH_PSWA_MIF_DLY_ARR_HF_PRE_LO_DLY(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIF_S28SPREGH_PSWA_MIF_DLY_ARR_HF_PRE_LO_DLY_SHIFT)) & SRC_MIF_S28SPREGH_PSWA_MIF_DLY_ARR_HF_PRE_LO_DLY_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SRC_MIF_S28SPREGH_PSWA_Register_Masks */


/* SRC_MIF_S28SPREGH_PSWA - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CM7PLATFORM_TCM base address */
  #define CM7PLATFORM_TCM_BASE                     (0x54464C00u)
  /** Peripheral CM7PLATFORM_TCM base address */
  #define CM7PLATFORM_TCM_BASE_NS                  (0x44464C00u)
  /** Peripheral CM7PLATFORM_TCM base pointer */
  #define CM7PLATFORM_TCM                          ((SRC_MIF_S28SPREGH_PSWA_Type *)CM7PLATFORM_TCM_BASE)
  /** Peripheral CM7PLATFORM_TCM base pointer */
  #define CM7PLATFORM_TCM_NS                       ((SRC_MIF_S28SPREGH_PSWA_Type *)CM7PLATFORM_TCM_BASE_NS)
  /** Array initializer of SRC_MIF_S28SPREGH_PSWA peripheral base addresses */
  #define SRC_MIF_S28SPREGH_PSWA_BASE_ADDRS        { CM7PLATFORM_TCM_BASE }
  /** Array initializer of SRC_MIF_S28SPREGH_PSWA peripheral base pointers */
  #define SRC_MIF_S28SPREGH_PSWA_BASE_PTRS         { CM7PLATFORM_TCM }
  /** Array initializer of SRC_MIF_S28SPREGH_PSWA peripheral base addresses */
  #define SRC_MIF_S28SPREGH_PSWA_BASE_ADDRS_NS     { CM7PLATFORM_TCM_BASE_NS }
  /** Array initializer of SRC_MIF_S28SPREGH_PSWA peripheral base pointers */
  #define SRC_MIF_S28SPREGH_PSWA_BASE_PTRS_NS      { CM7PLATFORM_TCM_NS }
#else
  /** Peripheral CM7PLATFORM_TCM base address */
  #define CM7PLATFORM_TCM_BASE                     (0x44464C00u)
  /** Peripheral CM7PLATFORM_TCM base pointer */
  #define CM7PLATFORM_TCM                          ((SRC_MIF_S28SPREGH_PSWA_Type *)CM7PLATFORM_TCM_BASE)
  /** Array initializer of SRC_MIF_S28SPREGH_PSWA peripheral base addresses */
  #define SRC_MIF_S28SPREGH_PSWA_BASE_ADDRS        { CM7PLATFORM_TCM_BASE }
  /** Array initializer of SRC_MIF_S28SPREGH_PSWA peripheral base pointers */
  #define SRC_MIF_S28SPREGH_PSWA_BASE_PTRS         { CM7PLATFORM_TCM }
#endif

/*!
 * @}
 */ /* end of group SRC_MIF_S28SPREGH_PSWA_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SRC_MIX_SLICE Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRC_MIX_SLICE_Peripheral_Access_Layer SRC_MIX_SLICE Peripheral Access Layer
 * @{
 */

/** SRC_MIX_SLICE - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t AUTHEN_CTRL;                       /**< Authentication Control, offset: 0x4 */
       uint8_t RESERVED_1[8];
  __IO uint32_t SLICE_SW_CTRL;                     /**< SLICE Software Control, offset: 0x10 */
  __I  uint32_t FUNC_STAT;                         /**< Function Status, offset: 0x14 */
       uint8_t RESERVED_2[8];
  __I  uint32_t UPI_STAT_0;                        /**< UPI Status 0, offset: 0x20 */
  __I  uint32_t UPI_STAT_1;                        /**< UPI Status 1, offset: 0x24 */
       uint8_t RESERVED_3[8];
  __IO uint32_t LPM_SETTING_0;                     /**< Low Power Mode Setting 0, offset: 0x30 */
  __IO uint32_t LPM_SETTING_1;                     /**< Low Power Mode Setting 1, offset: 0x34 */
  __IO uint32_t LPM_SETTING_2;                     /**< Low Power Mode Setting 2, offset: 0x38 */
       uint8_t RESERVED_4[4];
  __IO uint32_t EDGELOCK_HDSK_CTRL;                /**< Edgelock Handshake Control, offset: 0x40 */
  __I  uint32_t EDGELOCK_HDSK_STAT;                /**< Edgelock Handshake Status, offset: 0x44 */
  __IO uint32_t EDGELOCK_HDSK_CNT_CFG;             /**< Edgelock Handshake Counter Config, offset: 0x48 */
  __I  uint32_t EDGELOCK_HDSK_CNT_STAT;            /**< Edgelock Handshake Counter Status, offset: 0x4C */
  __IO uint32_t ISO_DLY_PRE;                       /**< ISO Delay Pre control, offset: 0x50 */
  __IO uint32_t PSW_DLY_PRE_HF;                    /**< PSW Delay Pre for HF, offset: 0x54 */
  __IO uint32_t PSW_DLY_PRE_LF;                    /**< PSW Delay Pre for LF, offset: 0x58 */
  __IO uint32_t PSW_CTRL;                          /**< PSW Control, offset: 0x5C */
  __I  uint32_t PSW_STAT;                          /**< PSW Status, offset: 0x60 */
  __IO uint32_t PSW_CNT_CFG_HF;                    /**< PSW Counter Config for HF, offset: 0x64 */
  __I  uint32_t PSW_CNT_STAT_HF;                   /**< PSW Counter Status for HF, offset: 0x68 */
  __IO uint32_t PSW_CNT_CFG_LF;                    /**< PSW Counter Config for LF, offset: 0x6C */
  __I  uint32_t PSW_CNT_STAT_LF;                   /**< PSW Counter Status for LF, offset: 0x70 */
       uint8_t RESERVED_5[12];
  __IO uint32_t MLPL_TRIG_CTRL;                    /**< Memory Low Power Level Trigger Control, offset: 0x80 */
  __IO uint32_t MLPL_CFG;                          /**< Memory Low Power Level Config, offset: 0x84 */
  __I  uint32_t MLPL_STAT;                         /**< Memory Low Power Level Status, offset: 0x88 */
} SRC_MIX_SLICE_Type;

/* ----------------------------------------------------------------------------
   -- SRC_MIX_SLICE Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRC_MIX_SLICE_Register_Masks SRC_MIX_SLICE Register Masks
 * @{
 */

/*! @name AUTHEN_CTRL - Authentication Control */
/*! @{ */

#define SRC_MIX_SLICE_AUTHEN_CTRL_LPM_MODE_MASK  (0x4U)
#define SRC_MIX_SLICE_AUTHEN_CTRL_LPM_MODE_SHIFT (2U)
/*! LPM_MODE - HW low power mode
 *  0b0..Low power mode controlled by software. SLICE_SW_CTRL register can be updated. LPM_SETTING_0 register cannot be updated.
 *  0b1..Low power mode controlled by GPC. SLICE_SW_CTRL register cannot be updated. LPM_SETTING_0 register can be updated.
 */
#define SRC_MIX_SLICE_AUTHEN_CTRL_LPM_MODE(x)    (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_AUTHEN_CTRL_LPM_MODE_SHIFT)) & SRC_MIX_SLICE_AUTHEN_CTRL_LPM_MODE_MASK)

#define SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_CFG_MASK  (0x80U)
#define SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_CFG_SHIFT (7U)
/*! LOCK_CFG - Configuration lock
 *  0b0..Registers are not locked.
 *  0b1..Fields and registers in the list are locked.
 */
#define SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_CFG(x)    (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_CFG_SHIFT)) & SRC_MIX_SLICE_AUTHEN_CTRL_LOCK_CFG_MASK)

