JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define TRDC_MRC_DOM6_RGD_NSE_BIT10_MASK         (0x400U)
#define TRDC_MRC_DOM6_RGD_NSE_BIT10_SHIFT        (10U)
/*! BIT10 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM6_RGD_NSE_BIT10(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM6_RGD_NSE_BIT10_SHIFT)) & TRDC_MRC_DOM6_RGD_NSE_BIT10_MASK)

#define TRDC_MRC_DOM6_RGD_NSE_BIT11_MASK         (0x800U)
#define TRDC_MRC_DOM6_RGD_NSE_BIT11_SHIFT        (11U)
/*! BIT11 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM6_RGD_NSE_BIT11(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM6_RGD_NSE_BIT11_SHIFT)) & TRDC_MRC_DOM6_RGD_NSE_BIT11_MASK)

#define TRDC_MRC_DOM6_RGD_NSE_BIT12_MASK         (0x1000U)
#define TRDC_MRC_DOM6_RGD_NSE_BIT12_SHIFT        (12U)
/*! BIT12 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM6_RGD_NSE_BIT12(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM6_RGD_NSE_BIT12_SHIFT)) & TRDC_MRC_DOM6_RGD_NSE_BIT12_MASK)

#define TRDC_MRC_DOM6_RGD_NSE_BIT13_MASK         (0x2000U)
#define TRDC_MRC_DOM6_RGD_NSE_BIT13_SHIFT        (13U)
/*! BIT13 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM6_RGD_NSE_BIT13(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM6_RGD_NSE_BIT13_SHIFT)) & TRDC_MRC_DOM6_RGD_NSE_BIT13_MASK)

#define TRDC_MRC_DOM6_RGD_NSE_BIT14_MASK         (0x4000U)
#define TRDC_MRC_DOM6_RGD_NSE_BIT14_SHIFT        (14U)
/*! BIT14 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM6_RGD_NSE_BIT14(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM6_RGD_NSE_BIT14_SHIFT)) & TRDC_MRC_DOM6_RGD_NSE_BIT14_MASK)

#define TRDC_MRC_DOM6_RGD_NSE_BIT15_MASK         (0x8000U)
#define TRDC_MRC_DOM6_RGD_NSE_BIT15_SHIFT        (15U)
/*! BIT15 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM6_RGD_NSE_BIT15(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM6_RGD_NSE_BIT15_SHIFT)) & TRDC_MRC_DOM6_RGD_NSE_BIT15_MASK)
/*! @} */

/* The count of TRDC_MRC_DOM6_RGD_NSE */
#define TRDC_MRC_DOM6_RGD_NSE_COUNT              (7U)

/*! @name MRC_DOM7_RGD_W - MRC Region Descriptor Word 0..MRC Region Descriptor Word 1 */
/*! @{ */

#define TRDC_MRC_DOM7_RGD_W_MRACSEL_MASK         (0x7U)
#define TRDC_MRC_DOM7_RGD_W_MRACSEL_SHIFT        (0U)
/*! MRACSEL - Memory Region Access Control Select
 *  0b000..Select MRC_GLBAC0 access control policy
 *  0b001..Select MRC_GLBAC1 access control policy
 *  0b010..Select MRC_GLBAC2 access control policy
 *  0b011..Select MRC_GLBAC3 access control policy
 *  0b100..Select MRC_GLBAC4 access control policy
 *  0b101..Select MRC_GLBAC5 access control policy
 *  0b110..Select MRC_GLBAC6 access control policy
 *  0b111..Select MRC_GLBAC7 access control policy
 */
#define TRDC_MRC_DOM7_RGD_W_MRACSEL(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM7_RGD_W_MRACSEL_SHIFT)) & TRDC_MRC_DOM7_RGD_W_MRACSEL_MASK)

#define TRDC_MRC_DOM7_RGD_W_VLD_MASK             (0x1U)
#define TRDC_MRC_DOM7_RGD_W_VLD_SHIFT            (0U)
/*! VLD - Valid */
#define TRDC_MRC_DOM7_RGD_W_VLD(x)               (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM7_RGD_W_VLD_SHIFT)) & TRDC_MRC_DOM7_RGD_W_VLD_MASK)

#define TRDC_MRC_DOM7_RGD_W_NSE_MASK             (0x10U)
#define TRDC_MRC_DOM7_RGD_W_NSE_SHIFT            (4U)
/*! NSE - NonSecure Enable
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in this register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM7_RGD_W_NSE(x)               (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM7_RGD_W_NSE_SHIFT)) & TRDC_MRC_DOM7_RGD_W_NSE_MASK)

#define TRDC_MRC_DOM7_RGD_W_END_ADDR_MASK        (0xFFFFC000U)
#define TRDC_MRC_DOM7_RGD_W_END_ADDR_SHIFT       (14U)
/*! END_ADDR - End Address */
#define TRDC_MRC_DOM7_RGD_W_END_ADDR(x)          (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM7_RGD_W_END_ADDR_SHIFT)) & TRDC_MRC_DOM7_RGD_W_END_ADDR_MASK)

#define TRDC_MRC_DOM7_RGD_W_STRT_ADDR_MASK       (0xFFFFC000U)
#define TRDC_MRC_DOM7_RGD_W_STRT_ADDR_SHIFT      (14U)
/*! STRT_ADDR - Start Address */
#define TRDC_MRC_DOM7_RGD_W_STRT_ADDR(x)         (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM7_RGD_W_STRT_ADDR_SHIFT)) & TRDC_MRC_DOM7_RGD_W_STRT_ADDR_MASK)
/*! @} */

/* The count of TRDC_MRC_DOM7_RGD_W */
#define TRDC_MRC_DOM7_RGD_W_COUNT                (7U)

/* The count of TRDC_MRC_DOM7_RGD_W */
#define TRDC_MRC_DOM7_RGD_W_COUNT2               (16U)

/* The count of TRDC_MRC_DOM7_RGD_W */
#define TRDC_MRC_DOM7_RGD_W_COUNT3               (2U)

/*! @name MRC_DOM7_RGD_NSE - MRC Region Descriptor NonSecure Enable */
/*! @{ */

