JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
/*! @name UTRIM - VREF User Trim */
/*! @{ */

#define VREF_UTRIM_VREFTRIM_MASK                 (0x3F00U)
#define VREF_UTRIM_VREFTRIM_SHIFT                (8U)
/*! VREFTRIM - VREF Trim bits
 *  0b000000..Min
 *  0b000001..Max-31*(4/3) mV
 *  0b111111..Max
 */
#define VREF_UTRIM_VREFTRIM(x)                   (((uint32_t)(((uint32_t)(x)) << VREF_UTRIM_VREFTRIM_SHIFT)) & VREF_UTRIM_VREFTRIM_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group VREF_Register_Masks */


/* VREF - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral VREF base address */
  #define VREF_BASE                                (0x52E30000u)
  /** Peripheral VREF base address */
  #define VREF_BASE_NS                             (0x42E30000u)
  /** Peripheral VREF base pointer */
  #define VREF                                     ((VREF_Type *)VREF_BASE)
  /** Peripheral VREF base pointer */
  #define VREF_NS                                  ((VREF_Type *)VREF_BASE_NS)
  /** Array initializer of VREF peripheral base addresses */
  #define VREF_BASE_ADDRS                          { VREF_BASE }
  /** Array initializer of VREF peripheral base pointers */
  #define VREF_BASE_PTRS                           { VREF }
  /** Array initializer of VREF peripheral base addresses */
  #define VREF_BASE_ADDRS_NS                       { VREF_BASE_NS }
  /** Array initializer of VREF peripheral base pointers */
  #define VREF_BASE_PTRS_NS                        { VREF_NS }
#else
  /** Peripheral VREF base address */
  #define VREF_BASE                                (0x42E30000u)
  /** Peripheral VREF base pointer */
  #define VREF                                     ((VREF_Type *)VREF_BASE)
  /** Array initializer of VREF peripheral base addresses */
  #define VREF_BASE_ADDRS                          { VREF_BASE }
  /** Array initializer of VREF peripheral base pointers */
  #define VREF_BASE_PTRS                           { VREF }
#endif

/*!
 * @}
 */ /* end of group VREF_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- XBAR_NUM_OUT221 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBAR_NUM_OUT221_Peripheral_Access_Layer XBAR_NUM_OUT221 Peripheral Access Layer
 * @{
 */

/** XBAR_NUM_OUT221 - Register Layout Typedef */
typedef struct {
  __IO uint16_t SEL[111];                          /**< Crossbar Select Register, array offset: 0x0, array step: 0x2 */
  __IO uint16_t CTRL[2];                           /**< Crossbar Control Register, array offset: 0xDE, array step: 0x2 */
} XBAR_NUM_OUT221_Type;

/* ----------------------------------------------------------------------------
   -- XBAR_NUM_OUT221 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBAR_NUM_OUT221_Register_Masks XBAR_NUM_OUT221 Register Masks
 * @{
 */

/*! @name SEL - Crossbar Select Register */
/*! @{ */

#define XBAR_NUM_OUT221_SEL_SEL0_MASK            (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL0_SHIFT           (0U)
/*! SEL0 - SEL0 */
#define XBAR_NUM_OUT221_SEL_SEL0(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL0_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL0_MASK)

#define XBAR_NUM_OUT221_SEL_SEL1_MASK            (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL1_SHIFT           (8U)
/*! SEL1 - SEL1 */
#define XBAR_NUM_OUT221_SEL_SEL1(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL1_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL1_MASK)

#define XBAR_NUM_OUT221_SEL_SEL2_MASK            (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL2_SHIFT           (0U)
/*! SEL2 - SEL2 */
#define XBAR_NUM_OUT221_SEL_SEL2(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL2_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL2_MASK)

#define XBAR_NUM_OUT221_SEL_SEL3_MASK            (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL3_SHIFT           (8U)
/*! SEL3 - SEL3 */
#define XBAR_NUM_OUT221_SEL_SEL3(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL3_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL3_MASK)

#define XBAR_NUM_OUT221_SEL_SEL4_MASK            (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL4_SHIFT           (0U)
/*! SEL4 - SEL4 */
#define XBAR_NUM_OUT221_SEL_SEL4(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL4_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL4_MASK)

#define XBAR_NUM_OUT221_SEL_SEL5_MASK            (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL5_SHIFT           (8U)
/*! SEL5 - SEL5 */
#define XBAR_NUM_OUT221_SEL_SEL5(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL5_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL5_MASK)

#define XBAR_NUM_OUT221_SEL_SEL6_MASK            (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL6_SHIFT           (0U)
/*! SEL6 - SEL6 */
#define XBAR_NUM_OUT221_SEL_SEL6(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL6_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL6_MASK)

#define XBAR_NUM_OUT221_SEL_SEL7_MASK            (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL7_SHIFT           (8U)
/*! SEL7 - SEL7 */
#define XBAR_NUM_OUT221_SEL_SEL7(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL7_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL7_MASK)

#define XBAR_NUM_OUT221_SEL_SEL8_MASK            (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL8_SHIFT           (0U)
/*! SEL8 - SEL8 */
#define XBAR_NUM_OUT221_SEL_SEL8(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL8_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL8_MASK)

#define XBAR_NUM_OUT221_SEL_SEL9_MASK            (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL9_SHIFT           (8U)
/*! SEL9 - SEL9 */
#define XBAR_NUM_OUT221_SEL_SEL9(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL9_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL9_MASK)

#define XBAR_NUM_OUT221_SEL_SEL10_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL10_SHIFT          (0U)
/*! SEL10 - SEL10 */
#define XBAR_NUM_OUT221_SEL_SEL10(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL10_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL10_MASK)

