JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define XBAR_NUM_OUT221_SEL_SEL11_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL11_SHIFT          (8U)
/*! SEL11 - SEL11 */
#define XBAR_NUM_OUT221_SEL_SEL11(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL11_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL11_MASK)

#define XBAR_NUM_OUT221_SEL_SEL12_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL12_SHIFT          (0U)
/*! SEL12 - SEL12 */
#define XBAR_NUM_OUT221_SEL_SEL12(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL12_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL12_MASK)

#define XBAR_NUM_OUT221_SEL_SEL13_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL13_SHIFT          (8U)
/*! SEL13 - SEL13 */
#define XBAR_NUM_OUT221_SEL_SEL13(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL13_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL13_MASK)

#define XBAR_NUM_OUT221_SEL_SEL14_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL14_SHIFT          (0U)
/*! SEL14 - SEL14 */
#define XBAR_NUM_OUT221_SEL_SEL14(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL14_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL14_MASK)

#define XBAR_NUM_OUT221_SEL_SEL15_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL15_SHIFT          (8U)
/*! SEL15 - SEL15 */
#define XBAR_NUM_OUT221_SEL_SEL15(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL15_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL15_MASK)

#define XBAR_NUM_OUT221_SEL_SEL16_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL16_SHIFT          (0U)
/*! SEL16 - SEL16 */
#define XBAR_NUM_OUT221_SEL_SEL16(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL16_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL16_MASK)

#define XBAR_NUM_OUT221_SEL_SEL17_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL17_SHIFT          (8U)
/*! SEL17 - SEL17 */
#define XBAR_NUM_OUT221_SEL_SEL17(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL17_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL17_MASK)

#define XBAR_NUM_OUT221_SEL_SEL18_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL18_SHIFT          (0U)
/*! SEL18 - SEL18 */
#define XBAR_NUM_OUT221_SEL_SEL18(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL18_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL18_MASK)

#define XBAR_NUM_OUT221_SEL_SEL19_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL19_SHIFT          (8U)
/*! SEL19 - SEL19 */
#define XBAR_NUM_OUT221_SEL_SEL19(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL19_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL19_MASK)

#define XBAR_NUM_OUT221_SEL_SEL20_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL20_SHIFT          (0U)
/*! SEL20 - SEL20 */
#define XBAR_NUM_OUT221_SEL_SEL20(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL20_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL20_MASK)

#define XBAR_NUM_OUT221_SEL_SEL21_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL21_SHIFT          (8U)
/*! SEL21 - SEL21 */
#define XBAR_NUM_OUT221_SEL_SEL21(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL21_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL21_MASK)

#define XBAR_NUM_OUT221_SEL_SEL22_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL22_SHIFT          (0U)
/*! SEL22 - SEL22 */
#define XBAR_NUM_OUT221_SEL_SEL22(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL22_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL22_MASK)

#define XBAR_NUM_OUT221_SEL_SEL23_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL23_SHIFT          (8U)
/*! SEL23 - SEL23 */
#define XBAR_NUM_OUT221_SEL_SEL23(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL23_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL23_MASK)

#define XBAR_NUM_OUT221_SEL_SEL24_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL24_SHIFT          (0U)
/*! SEL24 - SEL24 */
#define XBAR_NUM_OUT221_SEL_SEL24(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL24_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL24_MASK)

#define XBAR_NUM_OUT221_SEL_SEL25_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL25_SHIFT          (8U)
/*! SEL25 - SEL25 */
#define XBAR_NUM_OUT221_SEL_SEL25(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL25_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL25_MASK)

#define XBAR_NUM_OUT221_SEL_SEL26_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL26_SHIFT          (0U)
/*! SEL26 - SEL26 */
#define XBAR_NUM_OUT221_SEL_SEL26(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL26_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL26_MASK)

#define XBAR_NUM_OUT221_SEL_SEL27_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL27_SHIFT          (8U)
/*! SEL27 - SEL27 */
#define XBAR_NUM_OUT221_SEL_SEL27(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL27_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL27_MASK)

#define XBAR_NUM_OUT221_SEL_SEL28_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL28_SHIFT          (0U)
/*! SEL28 - SEL28 */
#define XBAR_NUM_OUT221_SEL_SEL28(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL28_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL28_MASK)

#define XBAR_NUM_OUT221_SEL_SEL29_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL29_SHIFT          (8U)
/*! SEL29 - SEL29 */
#define XBAR_NUM_OUT221_SEL_SEL29(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL29_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL29_MASK)

#define XBAR_NUM_OUT221_SEL_SEL30_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL30_SHIFT          (0U)
/*! SEL30 - SEL30 */
#define XBAR_NUM_OUT221_SEL_SEL30(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL30_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL30_MASK)

#define XBAR_NUM_OUT221_SEL_SEL31_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL31_SHIFT          (8U)
/*! SEL31 - SEL31 */
#define XBAR_NUM_OUT221_SEL_SEL31(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL31_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL31_MASK)

#define XBAR_NUM_OUT221_SEL_SEL32_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL32_SHIFT          (0U)
/*! SEL32 - SEL32 */
#define XBAR_NUM_OUT221_SEL_SEL32(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL32_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL32_MASK)

#define XBAR_NUM_OUT221_SEL_SEL33_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL33_SHIFT          (8U)
/*! SEL33 - SEL33 */
#define XBAR_NUM_OUT221_SEL_SEL33(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL33_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL33_MASK)

#define XBAR_NUM_OUT221_SEL_SEL34_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL34_SHIFT          (0U)
/*! SEL34 - SEL34 */
#define XBAR_NUM_OUT221_SEL_SEL34(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL34_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL34_MASK)

