JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define XBAR_NUM_OUT221_SEL_SEL83_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL83_SHIFT          (8U)
/*! SEL83 - SEL83 */
#define XBAR_NUM_OUT221_SEL_SEL83(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL83_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL83_MASK)

#define XBAR_NUM_OUT221_SEL_SEL84_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL84_SHIFT          (0U)
/*! SEL84 - SEL84 */
#define XBAR_NUM_OUT221_SEL_SEL84(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL84_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL84_MASK)

#define XBAR_NUM_OUT221_SEL_SEL85_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL85_SHIFT          (8U)
/*! SEL85 - SEL85 */
#define XBAR_NUM_OUT221_SEL_SEL85(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL85_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL85_MASK)

#define XBAR_NUM_OUT221_SEL_SEL86_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL86_SHIFT          (0U)
/*! SEL86 - SEL86 */
#define XBAR_NUM_OUT221_SEL_SEL86(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL86_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL86_MASK)

#define XBAR_NUM_OUT221_SEL_SEL87_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL87_SHIFT          (8U)
/*! SEL87 - SEL87 */
#define XBAR_NUM_OUT221_SEL_SEL87(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL87_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL87_MASK)

#define XBAR_NUM_OUT221_SEL_SEL88_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL88_SHIFT          (0U)
/*! SEL88 - SEL88 */
#define XBAR_NUM_OUT221_SEL_SEL88(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL88_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL88_MASK)

#define XBAR_NUM_OUT221_SEL_SEL89_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL89_SHIFT          (8U)
/*! SEL89 - SEL89 */
#define XBAR_NUM_OUT221_SEL_SEL89(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL89_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL89_MASK)

#define XBAR_NUM_OUT221_SEL_SEL90_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL90_SHIFT          (0U)
/*! SEL90 - SEL90 */
#define XBAR_NUM_OUT221_SEL_SEL90(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL90_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL90_MASK)

#define XBAR_NUM_OUT221_SEL_SEL91_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL91_SHIFT          (8U)
/*! SEL91 - SEL91 */
#define XBAR_NUM_OUT221_SEL_SEL91(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL91_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL91_MASK)

#define XBAR_NUM_OUT221_SEL_SEL92_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL92_SHIFT          (0U)
/*! SEL92 - SEL92 */
#define XBAR_NUM_OUT221_SEL_SEL92(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL92_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL92_MASK)

#define XBAR_NUM_OUT221_SEL_SEL93_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL93_SHIFT          (8U)
/*! SEL93 - SEL93 */
#define XBAR_NUM_OUT221_SEL_SEL93(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL93_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL93_MASK)

#define XBAR_NUM_OUT221_SEL_SEL94_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL94_SHIFT          (0U)
/*! SEL94 - SEL94 */
#define XBAR_NUM_OUT221_SEL_SEL94(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL94_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL94_MASK)

#define XBAR_NUM_OUT221_SEL_SEL95_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL95_SHIFT          (8U)
/*! SEL95 - SEL95 */
#define XBAR_NUM_OUT221_SEL_SEL95(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL95_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL95_MASK)

#define XBAR_NUM_OUT221_SEL_SEL96_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL96_SHIFT          (0U)
/*! SEL96 - SEL96 */
#define XBAR_NUM_OUT221_SEL_SEL96(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL96_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL96_MASK)

#define XBAR_NUM_OUT221_SEL_SEL97_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL97_SHIFT          (8U)
/*! SEL97 - SEL97 */
#define XBAR_NUM_OUT221_SEL_SEL97(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL97_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL97_MASK)

#define XBAR_NUM_OUT221_SEL_SEL98_MASK           (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL98_SHIFT          (0U)
/*! SEL98 - SEL98 */
#define XBAR_NUM_OUT221_SEL_SEL98(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL98_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL98_MASK)

#define XBAR_NUM_OUT221_SEL_SEL99_MASK           (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL99_SHIFT          (8U)
/*! SEL99 - SEL99 */
#define XBAR_NUM_OUT221_SEL_SEL99(x)             (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL99_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL99_MASK)

#define XBAR_NUM_OUT221_SEL_SEL100_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL100_SHIFT         (0U)
/*! SEL100 - SEL100 */
#define XBAR_NUM_OUT221_SEL_SEL100(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL100_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL100_MASK)

#define XBAR_NUM_OUT221_SEL_SEL101_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL101_SHIFT         (8U)
/*! SEL101 - SEL101 */
#define XBAR_NUM_OUT221_SEL_SEL101(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL101_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL101_MASK)

#define XBAR_NUM_OUT221_SEL_SEL102_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL102_SHIFT         (0U)
/*! SEL102 - SEL102 */
#define XBAR_NUM_OUT221_SEL_SEL102(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL102_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL102_MASK)

#define XBAR_NUM_OUT221_SEL_SEL103_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL103_SHIFT         (8U)
/*! SEL103 - SEL103 */
#define XBAR_NUM_OUT221_SEL_SEL103(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL103_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL103_MASK)

#define XBAR_NUM_OUT221_SEL_SEL104_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL104_SHIFT         (0U)
/*! SEL104 - SEL104 */
#define XBAR_NUM_OUT221_SEL_SEL104(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL104_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL104_MASK)

#define XBAR_NUM_OUT221_SEL_SEL105_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL105_SHIFT         (8U)
/*! SEL105 - SEL105 */
#define XBAR_NUM_OUT221_SEL_SEL105(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL105_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL105_MASK)

#define XBAR_NUM_OUT221_SEL_SEL106_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL106_SHIFT         (0U)
/*! SEL106 - SEL106 */
#define XBAR_NUM_OUT221_SEL_SEL106(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL106_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL106_MASK)

