JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define XBAR_NUM_OUT221_SEL_SEL186_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL186_SHIFT         (0U)
/*! SEL186 - SEL186 */
#define XBAR_NUM_OUT221_SEL_SEL186(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL186_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL186_MASK)

#define XBAR_NUM_OUT221_SEL_SEL187_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL187_SHIFT         (8U)
/*! SEL187 - SEL187 */
#define XBAR_NUM_OUT221_SEL_SEL187(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL187_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL187_MASK)

#define XBAR_NUM_OUT221_SEL_SEL188_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL188_SHIFT         (0U)
/*! SEL188 - SEL188 */
#define XBAR_NUM_OUT221_SEL_SEL188(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL188_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL188_MASK)

#define XBAR_NUM_OUT221_SEL_SEL189_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL189_SHIFT         (8U)
/*! SEL189 - SEL189 */
#define XBAR_NUM_OUT221_SEL_SEL189(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL189_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL189_MASK)

#define XBAR_NUM_OUT221_SEL_SEL190_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL190_SHIFT         (0U)
/*! SEL190 - SEL190 */
#define XBAR_NUM_OUT221_SEL_SEL190(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL190_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL190_MASK)

#define XBAR_NUM_OUT221_SEL_SEL191_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL191_SHIFT         (8U)
/*! SEL191 - SEL191 */
#define XBAR_NUM_OUT221_SEL_SEL191(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL191_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL191_MASK)

#define XBAR_NUM_OUT221_SEL_SEL192_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL192_SHIFT         (0U)
/*! SEL192 - SEL192 */
#define XBAR_NUM_OUT221_SEL_SEL192(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL192_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL192_MASK)

#define XBAR_NUM_OUT221_SEL_SEL193_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL193_SHIFT         (8U)
/*! SEL193 - SEL193 */
#define XBAR_NUM_OUT221_SEL_SEL193(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL193_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL193_MASK)

#define XBAR_NUM_OUT221_SEL_SEL194_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL194_SHIFT         (0U)
/*! SEL194 - SEL194 */
#define XBAR_NUM_OUT221_SEL_SEL194(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL194_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL194_MASK)

#define XBAR_NUM_OUT221_SEL_SEL195_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL195_SHIFT         (8U)
/*! SEL195 - SEL195 */
#define XBAR_NUM_OUT221_SEL_SEL195(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL195_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL195_MASK)

#define XBAR_NUM_OUT221_SEL_SEL196_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL196_SHIFT         (0U)
/*! SEL196 - SEL196 */
#define XBAR_NUM_OUT221_SEL_SEL196(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL196_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL196_MASK)

#define XBAR_NUM_OUT221_SEL_SEL197_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL197_SHIFT         (8U)
/*! SEL197 - SEL197 */
#define XBAR_NUM_OUT221_SEL_SEL197(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL197_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL197_MASK)

#define XBAR_NUM_OUT221_SEL_SEL198_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL198_SHIFT         (0U)
/*! SEL198 - SEL198 */
#define XBAR_NUM_OUT221_SEL_SEL198(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL198_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL198_MASK)

#define XBAR_NUM_OUT221_SEL_SEL199_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL199_SHIFT         (8U)
/*! SEL199 - SEL199 */
#define XBAR_NUM_OUT221_SEL_SEL199(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL199_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL199_MASK)

#define XBAR_NUM_OUT221_SEL_SEL200_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL200_SHIFT         (0U)
/*! SEL200 - SEL200 */
#define XBAR_NUM_OUT221_SEL_SEL200(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL200_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL200_MASK)

#define XBAR_NUM_OUT221_SEL_SEL201_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL201_SHIFT         (8U)
/*! SEL201 - SEL201 */
#define XBAR_NUM_OUT221_SEL_SEL201(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL201_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL201_MASK)

#define XBAR_NUM_OUT221_SEL_SEL202_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL202_SHIFT         (0U)
/*! SEL202 - SEL202 */
#define XBAR_NUM_OUT221_SEL_SEL202(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL202_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL202_MASK)

#define XBAR_NUM_OUT221_SEL_SEL203_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL203_SHIFT         (8U)
/*! SEL203 - SEL203 */
#define XBAR_NUM_OUT221_SEL_SEL203(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL203_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL203_MASK)

#define XBAR_NUM_OUT221_SEL_SEL204_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL204_SHIFT         (0U)
/*! SEL204 - SEL204 */
#define XBAR_NUM_OUT221_SEL_SEL204(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL204_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL204_MASK)

#define XBAR_NUM_OUT221_SEL_SEL205_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL205_SHIFT         (8U)
/*! SEL205 - SEL205 */
#define XBAR_NUM_OUT221_SEL_SEL205(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL205_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL205_MASK)

#define XBAR_NUM_OUT221_SEL_SEL206_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL206_SHIFT         (0U)
/*! SEL206 - SEL206 */
#define XBAR_NUM_OUT221_SEL_SEL206(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL206_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL206_MASK)

#define XBAR_NUM_OUT221_SEL_SEL207_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL207_SHIFT         (8U)
/*! SEL207 - SEL207 */
#define XBAR_NUM_OUT221_SEL_SEL207(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL207_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL207_MASK)

#define XBAR_NUM_OUT221_SEL_SEL208_MASK          (0xFFU)
#define XBAR_NUM_OUT221_SEL_SEL208_SHIFT         (0U)
/*! SEL208 - SEL208 */
#define XBAR_NUM_OUT221_SEL_SEL208(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL208_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL208_MASK)

#define XBAR_NUM_OUT221_SEL_SEL209_MASK          (0xFF00U)
#define XBAR_NUM_OUT221_SEL_SEL209_SHIFT         (8U)
/*! SEL209 - SEL209 */
#define XBAR_NUM_OUT221_SEL_SEL209(x)            (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT221_SEL_SEL209_SHIFT)) & XBAR_NUM_OUT221_SEL_SEL209_MASK)

