JayHeng/imxrt-tool-flash-algo/boards/nxp_evkmimxrt1180_rev.c/flash_algo_c0_silicon/Keil_JLink/rom_api/MIMXRT1189_cm33.h
#define XBAR_NUM_OUT32_SEL_SEL8_MASK             (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL8_SHIFT            (0U)
/*! SEL8 - SEL8 */
#define XBAR_NUM_OUT32_SEL_SEL8(x)               (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL8_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL8_MASK)

#define XBAR_NUM_OUT32_SEL_SEL10_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL10_SHIFT           (0U)
/*! SEL10 - SEL10 */
#define XBAR_NUM_OUT32_SEL_SEL10(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL10_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL10_MASK)

#define XBAR_NUM_OUT32_SEL_SEL12_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL12_SHIFT           (0U)
/*! SEL12 - SEL12 */
#define XBAR_NUM_OUT32_SEL_SEL12(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL12_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL12_MASK)

#define XBAR_NUM_OUT32_SEL_SEL14_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL14_SHIFT           (0U)
/*! SEL14 - SEL14 */
#define XBAR_NUM_OUT32_SEL_SEL14(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL14_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL14_MASK)

#define XBAR_NUM_OUT32_SEL_SEL16_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL16_SHIFT           (0U)
/*! SEL16 - SEL16 */
#define XBAR_NUM_OUT32_SEL_SEL16(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL16_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL16_MASK)

#define XBAR_NUM_OUT32_SEL_SEL18_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL18_SHIFT           (0U)
/*! SEL18 - SEL18 */
#define XBAR_NUM_OUT32_SEL_SEL18(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL18_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL18_MASK)

#define XBAR_NUM_OUT32_SEL_SEL20_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL20_SHIFT           (0U)
/*! SEL20 - SEL20 */
#define XBAR_NUM_OUT32_SEL_SEL20(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL20_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL20_MASK)

#define XBAR_NUM_OUT32_SEL_SEL22_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL22_SHIFT           (0U)
/*! SEL22 - SEL22 */
#define XBAR_NUM_OUT32_SEL_SEL22(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL22_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL22_MASK)

#define XBAR_NUM_OUT32_SEL_SEL24_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL24_SHIFT           (0U)
/*! SEL24 - SEL24 */
#define XBAR_NUM_OUT32_SEL_SEL24(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL24_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL24_MASK)

#define XBAR_NUM_OUT32_SEL_SEL26_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL26_SHIFT           (0U)
/*! SEL26 - SEL26 */
#define XBAR_NUM_OUT32_SEL_SEL26(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL26_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL26_MASK)

#define XBAR_NUM_OUT32_SEL_SEL28_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL28_SHIFT           (0U)
/*! SEL28 - SEL28 */
#define XBAR_NUM_OUT32_SEL_SEL28(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL28_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL28_MASK)

#define XBAR_NUM_OUT32_SEL_SEL30_MASK            (0xFFU)
#define XBAR_NUM_OUT32_SEL_SEL30_SHIFT           (0U)
/*! SEL30 - SEL30 */
#define XBAR_NUM_OUT32_SEL_SEL30(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL30_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL30_MASK)

#define XBAR_NUM_OUT32_SEL_SEL1_MASK             (0xFF00U)
#define XBAR_NUM_OUT32_SEL_SEL1_SHIFT            (8U)
/*! SEL1 - SEL1 */
#define XBAR_NUM_OUT32_SEL_SEL1(x)               (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL1_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL1_MASK)

#define XBAR_NUM_OUT32_SEL_SEL3_MASK             (0xFF00U)
#define XBAR_NUM_OUT32_SEL_SEL3_SHIFT            (8U)
/*! SEL3 - SEL3 */
#define XBAR_NUM_OUT32_SEL_SEL3(x)               (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL3_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL3_MASK)

#define XBAR_NUM_OUT32_SEL_SEL5_MASK             (0xFF00U)
#define XBAR_NUM_OUT32_SEL_SEL5_SHIFT            (8U)
/*! SEL5 - SEL5 */
#define XBAR_NUM_OUT32_SEL_SEL5(x)               (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL5_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL5_MASK)

#define XBAR_NUM_OUT32_SEL_SEL7_MASK             (0xFF00U)
#define XBAR_NUM_OUT32_SEL_SEL7_SHIFT            (8U)
/*! SEL7 - SEL7 */
#define XBAR_NUM_OUT32_SEL_SEL7(x)               (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL7_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL7_MASK)

#define XBAR_NUM_OUT32_SEL_SEL9_MASK             (0xFF00U)
#define XBAR_NUM_OUT32_SEL_SEL9_SHIFT            (8U)
/*! SEL9 - SEL9 */
#define XBAR_NUM_OUT32_SEL_SEL9(x)               (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL9_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL9_MASK)

#define XBAR_NUM_OUT32_SEL_SEL11_MASK            (0xFF00U)
#define XBAR_NUM_OUT32_SEL_SEL11_SHIFT           (8U)
/*! SEL11 - SEL11 */
#define XBAR_NUM_OUT32_SEL_SEL11(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL11_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL11_MASK)

#define XBAR_NUM_OUT32_SEL_SEL13_MASK            (0xFF00U)
#define XBAR_NUM_OUT32_SEL_SEL13_SHIFT           (8U)
/*! SEL13 - SEL13 */
#define XBAR_NUM_OUT32_SEL_SEL13(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL13_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL13_MASK)

#define XBAR_NUM_OUT32_SEL_SEL15_MASK            (0xFF00U)
#define XBAR_NUM_OUT32_SEL_SEL15_SHIFT           (8U)
/*! SEL15 - SEL15 */
#define XBAR_NUM_OUT32_SEL_SEL15(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL15_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL15_MASK)

#define XBAR_NUM_OUT32_SEL_SEL17_MASK            (0xFF00U)
#define XBAR_NUM_OUT32_SEL_SEL17_SHIFT           (8U)
/*! SEL17 - SEL17 */
#define XBAR_NUM_OUT32_SEL_SEL17(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL17_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL17_MASK)

#define XBAR_NUM_OUT32_SEL_SEL19_MASK            (0xFF00U)
#define XBAR_NUM_OUT32_SEL_SEL19_SHIFT           (8U)
/*! SEL19 - SEL19 */
#define XBAR_NUM_OUT32_SEL_SEL19(x)              (((uint16_t)(((uint16_t)(x)) << XBAR_NUM_OUT32_SEL_SEL19_SHIFT)) & XBAR_NUM_OUT32_SEL_SEL19_MASK)

